[
  {
    "title": "CSEC Information Technology - Part 1",
    "content": "SYLLABUS    INFORMATION TECHNOLOGY     CXC 30/G/SYLL 17        Caribbean Secondary  Education Certificate ®           Effective for examinations from May–June 2020              CXC 30/G/SYLL 17 www.cxc.org  Correspondence related to the syllabus should be addressed to:    The Pro-Registrar  Caribbean Examinations Council  Caenwood Centre  37 Arnold Road, Kingston 5, Jamaica    Telephone Number: + 1 (876) 630-5200  Facsimile Number:  + 1 (876) 967-4972   E-mail Address: cxcwzo@cxc.org  Website: w"
  },
  {
    "title": "CSEC Information Technology - Part 2",
    "content": "-4972   E-mail Address: cxcwzo@cxc.org  Website: www.cxc.org    Copyright ©2017 by Caribbean Examinations Council   Prince Road, Pine Plantation Road, St Michael BB11091                                                            CXC 08/G/SYLL 17  www.cxc.org    Contents         RATIONALE.. .......................................................................................................................................... 1    AIMS......................... ..................................."
  },
  {
    "title": "CSEC Information Technology - Part 3",
    "content": ".............. ............................................................................................................................... 2    ORGANISATION OF THE SYLLABUS ........................................................................................................ 2    SUGGESTED TIMETABLE ALLOCATION .................................................................................................. 3    FORMAT OF THE EXAMINATIONS ..................................................."
  },
  {
    "title": "CSEC Information Technology - Part 4",
    "content": "........................................................................................................ 3    CERTIFICATION AND DEFINITION OF PROFILE DIMENSIONS ................................................................ 4    HARDWARE AND SOFTWARE REQUIREMENTS ..................................................................................... 5    NOTES TO TEACHERS ............................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 5",
    "content": ".................................................. 6    REGULATIONS FOR RESIT CANDIDATES ................................................................................................ 7    REGULATIONS FOR PRIVATE CANDIDATES ........................................................................................... 7    SECTION 1: COMPUTER FUNDAMENTALS AND INFORMATION PROCESSING ...................................... 8    SECTION 2: COMPUTER NETWORKS AND WEB TECHNOLOGIES ......................."
  },
  {
    "title": "CSEC Information Technology - Part 6",
    "content": "WORKS AND WEB TECHNOLOGIES ........................................................ 13    SECTION 3: SOCIAL AND ECONOMIC IMPACT OF INFORMATION AND    COMMUNICATIONS TECHNOLOGY (ICT) .......................................................................... 15    SECTION 4: WORD-PROCESSING AND WEB PAGE DESIGN ................................................................. 19    SECTION 5: SPREADSHEETS .............................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 7",
    "content": "..................................................................... 22    SECTION 6: DATABASE MANAGEMENT ............................................................................................... 24    SECTION 7: PROBLEM-SOLVING AND PROGRAM DESIGN .................................................................. 26    SECTION 8: PROGRAM IMPLEMENTATION ......................................................................................... 29    GUIDELINES FOR THE CONDUCT OF THE SCHOOL-B"
  },
  {
    "title": "CSEC Information Technology - Part 8",
    "content": ". 29    GUIDELINES FOR THE CONDUCT OF THE SCHOOL-BASED ASSESSMENT ............................................ 31    RECOMMENDED TEXTS ....................................................................................................................... 43    GLOSSARY OF INFORMATION TECHNOLOGY CONCEPTS .................................................................... 44    GLOSSARY OF BEHAVIOURAL VERBS USED IN THE INFORMATION TECHNOLOGY EXAMINATIONS .. 52      CXC 08/G/SYLL 17  www.cxc.org"
  },
  {
    "title": "CSEC Information Technology - Part 9",
    "content": "NATIONS .. 52      CXC 08/G/SYLL 17  www.cxc.org    NOTE TO TEACHERS AND LEARNERS          This document CXC 30/G/SYLL 17 replaces CXC 30/G/SYLL 08 issued in 2008.        Revised 2000  Revised 2008  Amended 2013  Revised 2017        Please check the website, www.cxc.org for updates on CXC®’s syllabuses.                  PLEASE NOTE    Throughout  the syllabus,  this  icon  represents  key  features  that  teachers  and  learners  need to pay keen attention.       CXC 30/G/SYLL 17 1 www.cxc.org"
  },
  {
    "title": "CSEC Information Technology - Part 10",
    "content": "attention.       CXC 30/G/SYLL 17 1 www.cxc.org       Information Technology Syllabus           RATIONALE        Information Technology (IT) continues to evolve in response to the need for more efficient techniques  to  manage  the  significantly  increased  volume  and  sophistication  of  the  knowledge  reservoir  of  mankind. It merges the study of Computer Science, Information and Communications Technology (ICT)  and Office Automation. It involves the collection, processing, storage, retr"
  },
  {
    "title": "CSEC Information Technology - Part 11",
    "content": "involves the collection, processing, storage, retrieval, and dissemination of  information, and  impacts  both  work  and social activities. The  evolution  of  the  field  of  Information  Technology  continues  at  a rapid  pace.  New  technologies are  constantly emerging  and  existing  ones  become  obsolete  soon  after  they  appear.  The  rapid  advances  in  technology  undoubtedly  have  a  profound effect on information technology education and, as such, Information Technology curricu"
  },
  {
    "title": "CSEC Information Technology - Part 12",
    "content": "ation and, as such, Information Technology curricula  must be refreshed to remain relevant.    In  a  world characterized by rapid technological innovations,  it  is  imperative  that  Information  Technology  students are equipped  with  the  requisite  knowledge and  skills  that  will  enable  them  to  function  effectively  both  as  producers  and  consumers  of  technology.  It  is  also  important  to  prepare  students for the future by establishing foundational competencies which will"
  },
  {
    "title": "CSEC Information Technology - Part 13",
    "content": "establishing foundational competencies which will enable them to be flexible  to adapt to emerging technologies and new situations. To this end, the CSEC® Information Technology  syllabus is designed to provide knowledge and skills in the essential Information Technology domains  which  include:  computer  fundamentals,  problem-solving,  networks,  Web  Technologies,  productivity  tools,   computer   and   cybersecurity,   as   well   as   the   social implications   of   information   and  co"
  },
  {
    "title": "CSEC Information Technology - Part 14",
    "content": "social implications   of   information   and  communications  technology.  The  goal  is  to  use  learner-centred  and  problem-based  teaching,  and  assessment  strategies  to  develop  core  competencies  that  will  provide  pathways  to  multiple  post- secondary destinations.    Information  Technology  is the  key  to  development  and  productivity  in this modern  era  and  as  such,  Information Technology  education  must  be  seen  as  integral to meeting the  developmental  needs"
  },
  {
    "title": "CSEC Information Technology - Part 15",
    "content": "as  integral to meeting the  developmental  needs  of  our region.  All citizens should have practical exposure to the applications of Information Technology  in order to narrow the gap between Caribbean and developed nations.  Consequently, this programme  of  study in  Information  Technology promotes  the  development  of computer-related  skills  and  encourages the development of analytical and design skills which are applicable in all subject areas,  the work environment and the wider soc"
  },
  {
    "title": "CSEC Information Technology - Part 16",
    "content": "ect areas,  the work environment and the wider society. The syllabus aims to provide a blend of knowledge and  practical experience that fosters innovation, self-confidence, together with critical thinking skills that  will prepare students to meet the ICT needs of the region and beyond.    The Information Technology syllabus is based on objectives, skills and content which will cultivate the  attributes of the Ideal Caribbean Person as articulated by CARICOM. That is, a Caribbean person who  de"
  },
  {
    "title": "CSEC Information Technology - Part 17",
    "content": "ed by CARICOM. That is, a Caribbean person who  demonstrates multiple literacies, as well as independent and critical thinking, and questions the beliefs  and practices of the past and brings this to bear on the innovative application of science and technology  to problem-solving. Such a person will inevitably demonstrate a high level of self-confidence and self- esteem,  a  positive  work  ethic,  and  display  and  nurture  creative  imagination  in  the  economic  and  entrepreneurial spheres"
  },
  {
    "title": "CSEC Information Technology - Part 18",
    "content": "n  in  the  economic  and  entrepreneurial spheres and other areas of life. Also, in keeping with the UNESCO Pillars of Learning,  this course of study will contribute to the development of a person who will learn to be, learn to know,  learn to do, learn to live together, and learn to transform oneself and society.       CXC 30/G/SYLL 17 2 www.cxc.org   AIMS    The syllabus aims to:    1. prepare students to function effectively in a dynamic technological era;    2. promote the development of"
  },
  {
    "title": "CSEC Information Technology - Part 19",
    "content": "chnological era;    2. promote the development of computer-related skills for application to real-life situations;    3. prepare students to use information technology responsibly;     4. facilitate the development and application of problem-solving and other twenty-first century  skills;    5. provide a foundation for post-secondary education; and,    6. prepare students for suitable employment.        ORGANISATION OF THE SYLLABUS    The syllabus is organised under eight main sections.    1. C"
  },
  {
    "title": "CSEC Information Technology - Part 20",
    "content": "us is organised under eight main sections.    1. Computer Fundamentals and Information Processing:    (a) Computer Fundamentals.    (b) Information Processing Fundamentals.      2. Computer Networks and Web Technologies.      3. Social and Economic Impact of Information and Communications Technology:    (a) Implications of Misuse and Cybersecurity.    (b) Impact on Jobs and Education.      4. Word-Processing and Web Page Design:    (a) Word-Processing.    (b) Web Page Design.      5. Spreadsheet"
  },
  {
    "title": "CSEC Information Technology - Part 21",
    "content": "ssing.    (b) Web Page Design.      5. Spreadsheets.      6. Database Management.      7. Problem-Solving and Program Design.      8. Program Implementation.    CXC 30/G/SYLL 17 3 www.cxc.org   SUGGESTED TIMETABLE ALLOCATION    It is estimated that the syllabus can be covered in approximately 160 hours or four periods per  week during the fourth and fifth years in the secondary school. A suggested time allocation (in  hours) is shown below for each section.  The laboratory hours indicated are c"
  },
  {
    "title": "CSEC Information Technology - Part 22",
    "content": "ach section.  The laboratory hours indicated are calculated on a per  student basis.      Section    Class    Lab    Field    Total    1. Computer Fundamentals and Information Processing    30 4  34  2. Computer Networks and Web Technologies    11 - 2 13  3. Social   and Economic   Impact   of Information   and  Communications Technology    12 - - 12  4. Word-Processing and Web Page Design    5 15 - 20  5. Spreadsheets    5 10 - 15  6. Database Management    5 13 - 18  7. Problem-Solving and Pro"
  },
  {
    "title": "CSEC Information Technology - Part 23",
    "content": "anagement    5 13 - 18  7. Problem-Solving and Program Design  20 - - 20    8.  Program Implementation    15 20 - 35      Allied Subjects    Although no subjects are being specified as either prerequisites or co-requisites to Information  Technology, it is expected that students would have pursued a course in Mathematics up to Grade  9 (Form 3).     FORMAT OF THE EXAMINATIONS    P a p e r 0 1  (1 hour 15 minutes)  Sixty multiple-choice items: 35 items from Sections 1, 2 and 3; 15  items from Se"
  },
  {
    "title": "CSEC Information Technology - Part 24",
    "content": "items from Sections 1, 2 and 3; 15  items from Sections 4, 5 and 6; and 10 from Sections 7 and 8.    P a p e r 0 2  (2 hours)   Four compulsory structured questions drawn from all areas of the  syllabus. Marks will be allocated as follows: 35 marks toward the  Theory  profile, 30 marks  toward  the  Productivity  Tools  profile  and 25 marks  toward  the  Problem-Solving  and  Programming  profile. Knowledge of a specific programming language will not  be tested.    Paper 032   Assessment for P"
  },
  {
    "title": "CSEC Information Technology - Part 25",
    "content": "ll not  be tested.    Paper 032   Assessment for Private  Candidates only  (2 hours)  Alternate to the School-Based Assessment for private candidates.   This paper will examine similar skills as those tested in Paper 031.  The focus, therefore, will be on Productivity Tools and Problem- Solving  and  Programming.  This  paper will  be  a  practical  paper,    CXC 30/G/SYLL 17 4 www.cxc.org    consisting of five questions: four on Productivity Tools, worth 35  marks, and one on Problem-Solving wo"
  },
  {
    "title": "CSEC Information Technology - Part 26",
    "content": "ls, worth 35  marks, and one on Problem-Solving worth 15 marks.    School-Based Assessment      Paper 031 The SBA component will comprise a practical project testing  Section 4, Word-Processing and  Web Page Design; Section 5,  Spreadsheets; Section 6, Database Management; Section 7,  Problem-Solving and Program Design; and Section 8, Program  Implementation.      The Project will carry 50 marks which will account for 25 per cent  of the final grade. This 50 marks will be distributed as follows:"
  },
  {
    "title": "CSEC Information Technology - Part 27",
    "content": "ade. This 50 marks will be distributed as follows:  10  for    Word-Processing;    5    for    Web Page    Design;    10    for  Spreadsheets;   10   for   Database   Management;   and   15 for  Problem-Solving.  The  project  will  be marked by  the  teacher  in  accordance  with CXC® guidelines  and  the  marks  should  be  submitted  to CXC®.  The  assignment  should  be administered  as  specified  in  the  instructions  contained  in  the  Guidelines  to  the  Conduct of the SBA, on pages 3"
  },
  {
    "title": "CSEC Information Technology - Part 28",
    "content": "uidelines  to  the  Conduct of the SBA, on pages 31–42.       CERTIFICATION    The subject will be examined for certification at the General Proficiency. The School-Based Assessment  component  for  this  syllabus  is  aligned  to  selected  units  within  the  regional  qualification  of  the  Caribbean Vocational Qualification (CVQ).  Through this integration, once all requirements for issuing  the  CVQ  are  met,  every  student  with  acceptable  grades  will  receive  a  Statement  of  Com"
  },
  {
    "title": "CSEC Information Technology - Part 29",
    "content": "able  grades  will  receive  a  Statement  of  Competence  to  recognize their  competencies  in  selected  units  from  the  Level  1  Caribbean  Vocational  Qualification  (CVQ) in Data Operations – Level 1 (CCITI10106).  The decisions to award competencies will be based  on the quality and relevance of the pieces of evidence presented for the occupational area.    In addition to an overall grade, there will be a profile report that reflects the performance of each  candidate under the followi"
  },
  {
    "title": "CSEC Information Technology - Part 30",
    "content": "e performance of each  candidate under the following headings.      DEFINITION OF PROFILE DIMENSIONS    Profile Dimensions    Theory The ability to apply fundamental concepts and skills to Information  Technology.    Productivity Tools The ability to apply standard features in the following areas:    (a) word processor in the preparation of documents, as well as  the candidate’s ability to use web page design applications;    (b) spreadsheet program in solving problems and presenting data;  and"
  },
  {
    "title": "CSEC Information Technology - Part 31",
    "content": "gram in solving problems and presenting data;  and,    (c) database management program in storing and retrieving  data.    CXC 30/G/SYLL 17 5 www.cxc.org  Problem-Solving and  Programming    The ability to use analytical skills in the development of algorithms,  expressed as flowcharts or pseudo code, that can then be implemented  as applications or computer programs.        MARK AND WEIGHT ALLOCATION FOR PROFILE DIMENSIONS    P a p e r / Profiles Theory Productivity  Tools  Problem-Solving  a n"
  },
  {
    "title": "CSEC Information Technology - Part 32",
    "content": "s Theory Productivity  Tools  Problem-Solving  a n d  Programming  Paper  Total  % Weighting  Of Papers  Paper 01 35 15 10 60 30  Paper 02 35 30 25 90 45  Paper 03 - 35 15 50 25  Profile Totals 70 85 50 200   % Weighting  Profiles  35 40 25  100           HARDWARE AND SOFTWARE REQUIREMENTS    For Schools:    1. It is the responsibility of schools presenting candidates for the examinations to ensure that  the required hardware and software are in place to achieve the syllabus objectives.    2. C"
  },
  {
    "title": "CSEC Information Technology - Part 33",
    "content": "place to achieve the syllabus objectives.    2. Candidates are advised to try out solutions to a variety of different problems on a computer  using  a  programming  language  of  their  choice;  no  particular  programming  language  will  be  assumed in this syllabus.    3. From  the  list  provided  below,  teachers  may  select  appropriate  software  for  the Word- Processing, Spreadsheets, Database Management, and Web Page Design components of the  syllabus.         CXC 30/G/SYLL 17 6 www."
  },
  {
    "title": "CSEC Information Technology - Part 34",
    "content": "of the  syllabus.         CXC 30/G/SYLL 17 6 www.cxc.org  RECOMMENDED SOFTWARE     NOTES TO TEACHERS  1. Students should be aware of the input/process/storage/output cycle as it pertains to  hardware and software components in Section 1.    2. Section 7 should be taught before Section 8. Students should learn how to develop  algorithms before they are introduced to writing code in a programming language.    3. In Section 7, the focus should be on the development of solutions in the form of alg"
  },
  {
    "title": "CSEC Information Technology - Part 35",
    "content": "on the development of solutions in the form of algorithms  (pseudocode/flowchart). The problem-solving skills acquired in this section serve as a  foundation for programming in Section 8.    4. In Section 8, students are required to translate  a  suitable selection of the algorithms  developed in Section 7 into an end-user application using one  of the programming tools  recommended by the centre.  Use simple problems, for example, finding the average of a set  of integers, or calculating tax pa"
  },
  {
    "title": "CSEC Information Technology - Part 36",
    "content": "erage of a set  of integers, or calculating tax payable, to illustrate how to develop simple programs.    5. In Section 8, laboratory sessions should be used to:  (a) familiarise the student with the features of the recommended translator;  (b) identify and correct syntax errors;  (c) identify and correct logic errors; and,  (d) execute program and display results.     It is recommended that students develop the algorithms on  paper  before converting into  source code. This allows for more effi"
  },
  {
    "title": "CSEC Information Technology - Part 37",
    "content": "rting into  source code. This allows for more efficient utilization of computer time.    6. While it is expected that students will gain skills in the use of productivity tools through  practice on specific packages, teachers should ensure that students have an appreciation of  the generic operations of each of the productivity tools so that skills are transferable to  other packages.    7. Although not a requirement of the course, it may be useful to apprise students of the  history of computer"
  },
  {
    "title": "CSEC Information Technology - Part 38",
    "content": "ul to apprise students of the  history of computers.    8. A glossary has been provided to facilitate a uniformed interpretation of the terminology  used in the syllabus. Teachers are advised to make use of this glossary and also the list  of recommended texts. However, the reading list provided is not exhaustive and additional  references should be consulted.  Word-Processing Spreadsheets Database  Management Web Page Design  1. Microsoft  Word    2. Google  Docs    3. Google  Forms    4. OpenO"
  },
  {
    "title": "CSEC Information Technology - Part 39",
    "content": "2. Google  Docs    3. Google  Forms    4. OpenOffice  Writer  1. Microsoft  Excel    2. Google  Sheets    3.   3.   OpenOffice           Calc        1.  Microsoft Access    2.  OpenOffice Base            1. Microsoft Word    2. Free   online      web  services such as  www.wix.com,  www.webnode.com   or www.weebly.com     3. Google Sites    CXC 30/G/SYLL 17 7 www.cxc.org   REGULATIONS FOR RESIT CANDIDATES    For CSEC® candidates,  SBA  scores  can  be  carried  forward  only  ONCE  and  only"
  },
  {
    "title": "CSEC Information Technology - Part 40",
    "content": "can  be  carried  forward  only  ONCE  and  only  during  the  year  immediately following the first sitting.  In order to assist candidates in making decisions about whether  or not to reuse a moderated SBA score, the Council will continue to indicate on the preliminary results  if a candidate’s moderated SBA score is less than 50 per cent in a particular subject.  Candidates reusing  SBA scores should register as “Resit candidates” and must provide the previous candidate number  when registe"
  },
  {
    "title": "CSEC Information Technology - Part 41",
    "content": "rovide the previous candidate number  when registering. These candidates must rewrite Papers 01 and 02 of the examination for the year in  which they re-register.      Resit  candidates  may  enter  through  schools, recognized educational  institutions   or  the  Local  Registrar’s Office.       REGULATIONS FOR PRIVATE CANDIDATES    1. Private candidates must be entered for examination through the Local Registrar or approved  private institutions in their respective territories and will be req"
  },
  {
    "title": "CSEC Information Technology - Part 42",
    "content": "ns in their respective territories and will be required to sit Papers 01, 02, and  EITHER Paper 031 OR Paper 032.    2. Paper 032 is a practical examination designed for candidates whose work cannot be monitored  by tutors in recognized educational and approved private institutions. The Paper will be of 2  hours’ duration and will consist of five questions. Questions will test the Productivity Tools and  Problem-Solving and Programming profiles.      3. Candidates entered for the examination thr"
  },
  {
    "title": "CSEC Information Technology - Part 43",
    "content": "3. Candidates entered for the examination through private institutions and who opt to complete  the SBA project must note the following:    (a) Candidates’ work must be monitored by tutors in the institution and feedback given  before the final assessment of that component. Tutors must also monitor candidates’  project to determine the veracity of work submitted. Tutors should not accept projects  which  were  not  monitored  during  development.  The  marks  recorded  in  the  four  compon"
  },
  {
    "title": "CSEC Information Technology - Part 44",
    "content": "ment.  The  marks  recorded  in  the  four  components will be collated to form the final SBA mark for submission by 30 April, in  the year of the examination.    (b) Marks must be submitted to the Caribbean Examinations Council on the School-Based  Assessment  forms  provided  online.  The  forms  should  be submitted  electronically  via  the SBA data capture module on the Online Registration System (ORS) on the Council’s  website. Candidates   who   do   not   fulfil   the   requirements   fo"
  },
  {
    "title": "CSEC Information Technology - Part 45",
    "content": "who   do   not   fulfil   the   requirements   for   the   School-Based  Assessment will be reported as “ungraded”.    (c) Candidates as well as tutors must retain a copy of the completed component as part  of their portfolio.           CXC 30/G/SYLL 17 8 www.cxc.org   SECTION 1: COMPUTER FUNDAMENTALS AND INFORMATION    PROCESSING      GENERAL OBJECTIVES    On completion of this Section, students should:    1. develop an understanding of the fundamental hardware and software components and the"
  },
  {
    "title": "CSEC Information Technology - Part 46",
    "content": "ndamental hardware and software components and the  interrelationship among them;    2. develop expertise in evaluating computer systems; and,    3. develop an understanding of basic information processing principles.        SPECIFIC OBJECTIVES    CONTENT  COMPUTER FUNDAMENTALS      Students should be able to:      1. explain    the    concept    of    Information  Technology;  Definition and scope of Information  Technology.      2. distinguish  among  the  major  types  of  computer systems in"
  },
  {
    "title": "CSEC Information Technology - Part 47",
    "content": "among  the  major  types  of  computer systems in terms of processing  speed, storage and portability;            Major types:     (a) Super Computers (for example, Cray).    (b) Mainframes (for example, IBM  zEnterprise System).     (c) Desktop systems.      (d) Mobile  devices (for  example, laptops,  notebooks,     netbooks,     smartphones,  tablets and game consoles).     (e) Embedded devices (for example,  special-purpose systems such as  controllers  in  microwaves,  car  ignition  syste"
  },
  {
    "title": "CSEC Information Technology - Part 48",
    "content": "controllers  in  microwaves,  car  ignition  systems, answering machines).     3. explain    the    functions    of    the    major  hardware   components   of   a   computer  system;     Major  components:  input,  central  processing  unit, primary memory   (RAM   and   ROM),  secondary storage, output.    (a) Secondary  storage  devices:  hard  disk,  magnetic   tape,   flash   drive, memory  card, and optical disks (CD, DVD and Blu- Ray).    (b) Units  of  storage:  bits,  bytes,  kilobytes,"
  },
  {
    "title": "CSEC Information Technology - Part 49",
    "content": "(b) Units  of  storage:  bits,  bytes,  kilobytes,  megabytes, gigabytes, terabytes.    CXC 30/G/SYLL 17 9 www.cxc.org  SECTION 1: COMPUTER FUNDAMENTALS AND INFORMATION PROCESSING (cont’d)            SPECIFIC OBJECTIVES    CONTENT  COMPUTER FUNDAMENTALS (cont’d)      Students should be able to:      4. explain     how     the     major     hardware  components    of    a    computer    system  interrelate;   Input processing output storage (IPOS) cycle.          5. evaluate   the   relative   me"
  },
  {
    "title": "CSEC Information Technology - Part 50",
    "content": "cycle.          5. evaluate   the   relative   merits   of   cloud  storage and local storage;   Definition    of cloud    and    local    storage.  Assessment criteria: capacity, cost,  accessibility; security issues.     6. select  appropriate  input/output  devices  to     meet     the     needs     of     specified  applications;    Associate  the  following  devices  with  suitable  applications:    (a) Input: Optical mark reader (OMR),  character readers (OCR, MICR), mouse,  joystick, bar"
  },
  {
    "title": "CSEC Information Technology - Part 51",
    "content": "aracter readers (OCR, MICR), mouse,  joystick, bar code reader, document  scanner, light-pen, touch terminals,  voice response unit, Touch   Screens  (tablets,  point  of  sale,  ATM), keyboard,  digital camera, biometric systems,  sensors, remote control, sound capture,  pointing devices, webcam.    (b) Visual output: Monitors, Printers (laser,  inkjet, dot matrix, thermal, plotters, 3D  Printers), microfilm.     (c) Audible  output: speakers, headphones,  earphones.     7. explain  the  role"
  },
  {
    "title": "CSEC Information Technology - Part 52",
    "content": "eadphones,  earphones.     7. explain  the  role  of  the  different types  of  software in computer operation;  System Software: Operating System, Utilities.    Application   software:   general-purpose   and  special-purpose; integrated  package; source:  off the shelf, custom-written, and customized.     8. discuss the relative merits of the various  types of user interface;  Hardware: touch screens, specialized  keyboards.    Software:        command    line,    menu-driven,  graphical user,"
  },
  {
    "title": "CSEC Information Technology - Part 53",
    "content": "command    line,    menu-driven,  graphical user, touch.      CXC 30/G/SYLL 17 10 www.cxc.org  SECTION 1: COMPUTER FUNDAMENTALS AND INFORMATION PROCESSING (cont’d)        INFORMATION PROCESSING FUNDAMENTALS      Students should be able to:      11. distinguish between data and  information;  Data as raw unprocessed facts; information as  processed data.    Sources   of   data   and   information   (people,  places and things).    Document     types: turnaround     document,  human-readable and"
  },
  {
    "title": "CSEC Information Technology - Part 54",
    "content": "pes: turnaround     document,  human-readable and machine-readable  forms; hard copy, and soft copy.    SPECIFIC OBJECTIVES    CONTENT  COMPUTER FUNDAMENTALS (cont’d)      Students should be able to:      9. evaluate    the    suitability    of    a    given  computer system for a specific purpose;   Basic    knowledge    of    system    specification  needed  for  purposes  such  as:  to  run  a  video  game,  web  browsing,  graphic  design,  video  editing, and desktop publishing.     Criteri"
  },
  {
    "title": "CSEC Information Technology - Part 55",
    "content": "ideo  editing, and desktop publishing.     Criteria:    (a) Processing speed (CPU type and speed);     (b) Memory (RAM);    (c) Secondary storage (capacity and  speed);    (d) Types of software; and,    (e) Input/Output devices.       10. troubleshoot  basic  computer  hardware  problems;  Cable problems (for example, loose cables).    Monitor  problems  (for  example,  improperly  adjusted monitor controls).    Printer    problems   (for example,    changing  printer cartridges).    Battery pro"
  },
  {
    "title": "CSEC Information Technology - Part 56",
    "content": ",    changing  printer cartridges).    Battery problems (for example, loose or dead  battery).     CXC 30/G/SYLL 17 11 www.cxc.org  SECTION 1: COMPUTER FUNDAMENTALS AND INFORMATION PROCESSING (cont’d)           Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers/facilitators are encouraged  to engage students in the teaching and learning activities below.    1. Organize students  in groups  to conduct a research on the majo"
  },
  {
    "title": "CSEC Information Technology - Part 57",
    "content": "ents  in groups  to conduct a research on the major hardware components  of a  computer system.  They should use a “show and tell” approach to present findings.      2. Arrange visits to local Computer Technology businesses to expose students to different system  specifications  needed, for  example,  running a video  game,  web  browsing,  graphic  design,  video editing, and desktop publishing.     3. Teachers should arrange for practical sessions in a computer laboratory. After demonstrations"
  },
  {
    "title": "CSEC Information Technology - Part 58",
    "content": "ons in a computer laboratory. After demonstrations  by the teacher and/or professional, students should be arranged in pairs to carry out activities  such as attaching a monitor, keyboard, and mouse to the computer’s system unit, fixing loose  cables, and changing printer cartridges.    4. Use a video tutorial to illustrate the various types of user interfaces. Allow students to identify  merits of using each interface.  SPECIFIC OBJECTIVES    CONTENT  INFORMATION   PROCESSING   FUNDAMENTALS  (c"
  },
  {
    "title": "CSEC Information Technology - Part 59",
    "content": "NTENT  INFORMATION   PROCESSING   FUNDAMENTALS  (cont’d)      Students should be able to:      12. evaluate the   reliability   of   information  obtained from online sources;  Evaluation of information retrieved  electronically    for    authenticity,    currency,  relevance, and bias.     13. differentiate    between validation and  verification of data;  Difference between validation and  verification.      14. identify appropriate validation and  verification checks   given   a   particular"
  },
  {
    "title": "CSEC Information Technology - Part 60",
    "content": "and  verification checks   given   a   particular  scenario; and,    Methods     of     validation: range check,  reasonableness checks, data type checks,  consistency checks,   presence,   format   and  length.    Methods  of  verification:  double  entry  and  proofreading (to identify and correct  typographical and transpositional errors).     15. select  appropriate  file organization for  particular application.     File access methods: sequential, serial, direct  and random.    Application"
  },
  {
    "title": "CSEC Information Technology - Part 61",
    "content": "ential, serial, direct  and random.    Application areas: archiving, payroll file, real  time systems.    CXC 30/G/SYLL 17 12 www.cxc.org  SECTION 1: COMPUTER FUNDAMENTALS AND INFORMATION PROCESSING (cont’d)      5. Organize students  in  groups  and  assign  the  task  of  collecting  samples  of  the  different  categories  of  input  and  output  devices.  They  should  then  set up  an  exhibition  area  and  be  encouraged to invite the school population to visit booths.     6. Invite  loca"
  },
  {
    "title": "CSEC Information Technology - Part 62",
    "content": "ol population to visit booths.     6. Invite  local  software  developers/software  engineers/programmers  to  do  guest  lectures  in  which they explain the types of software and their role in computer operation.    7. Allow students  to  mount  a  display  on  the  major  types  of  computers  systems,  using  pictures  and other relevant information.    8. Encourage students to create a scrapbook with samples of information, data, sources of data  and information, as well as different docume"
  },
  {
    "title": "CSEC Information Technology - Part 63",
    "content": "data  and information, as well as different document types.    9. Arrange visits to local archives, libraries and media houses to expose the students to the work  of appropriate file organization and access.    10. Engage students  in activities  during a class session to write scenarios  for their colleagues  to  identify the appropriate data verification and validation checks that should be applied.      CXC 30/G/SYLL 17 13 www.cxc.org   SECTION 2: COMPUTER NETWORKS AND WEB TECHNOLOGIES"
  },
  {
    "title": "CSEC Information Technology - Part 64",
    "content": "ON 2: COMPUTER NETWORKS AND WEB TECHNOLOGIES       GENERAL OBJECTIVES     On completion of this Section, students should develop an awareness of:    1. basic networking concepts, including mobile networks; and,    2. Internet and Web Technology concepts.      SPECIFIC OBJECTIVES CONTENT    Students should be able to:      1. distinguish among types of networks;    Types   of   networks (local   area   network,  metropolitan    area    network,    wide    area  network, mobile network).     (a) C"
  },
  {
    "title": "CSEC Information Technology - Part 65",
    "content": "wide    area  network, mobile network).     (a) Concept  of  mobile  network  as  radio- based common carrier.    (b) Overview  of  mobile  networks:  from  2G  to   current. (Knowledge   of   the   inner  workings   of mobile   systems   is   NOT  required)    Wireless  network  technologies  (for  example,  Bluetooth, Wi-Fi, hotspot).    Level of privacy (intranet, extranet, Internet).     2. explain   the   functions   of the   basic  components of a network;      Basic components and functi"
  },
  {
    "title": "CSEC Information Technology - Part 66",
    "content": "nts of a network;      Basic components and functions:    (a) Transmission media:     (i) Wired: twisted    pair, coaxial,  fibre; and,    (ii) Wireless: infrared,   microwave,  satellite.    (b) Switch, router, modem.    (c) Network interface card/network  adapter.           CXC 30/G/SYLL 17 14 www.cxc.org  SECTION 2: COMPUTER NETWORKS AND WEB TECHNOLOGIES (cont’d)      SPECIFIC OBJECTIVES CONTENT    Students should be able to:      3. assess    the    importance    of    mobile  communication"
  },
  {
    "title": "CSEC Information Technology - Part 67",
    "content": "the    importance    of    mobile  communication     technologies     as     a  component of modern communication  networks; and,  Suitability   of   mobile   networks   to   various  applications (for example, education,  commerce, and journalism).     4. explain the interrelationship among key  Web technology concepts.  World Wide Web.    Hypertext Markup Language.    Hypertext Transfer Protocol.    Hyperlinks.    Web Server.    Web Page.    File Transfer Protocol.    Web Browser.    Uniform"
  },
  {
    "title": "CSEC Information Technology - Part 68",
    "content": "ile Transfer Protocol.    Web Browser.    Uniform Resource Locator.    Upload and download.    Email.    Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers/facilitators are encouraged  to engage students in the teaching and learning activities below.    1. Engage students in a debate on the importance of mobile communication technologies to our  daily  lives,  for  example,  the  pros  and  cons of  mobile  technology  in"
  },
  {
    "title": "CSEC Information Technology - Part 69",
    "content": "the  pros  and  cons of  mobile  technology  in  the  fields  of  education,  commerce, and journalism.     2. Engage  students  in  a  matching  activity  where  they  match  the  functions  of  the  basic  components of a network.     3. Engage  students  in  role  play  activities  where  they  illustrate  how  the different  networks  operate.    4. Invite someone with expertise in computer networks and web technologies to address the  class and explain some of the concepts.    CXC 30/G/SY"
  },
  {
    "title": "CSEC Information Technology - Part 70",
    "content": "s and explain some of the concepts.    CXC 30/G/SYLL 17 15 www.cxc.org   SECTION 3: SOCIAL AND ECONOMIC IMPACT OF INFORMATION AND   COMMUNICATIONS TECHNOLOGY (ICT)      GENERAL OBJECTIVES    On completion of this Section, students should be able to:    1. develop an understanding of the various elements of computer security, and data misuse and  the impact on individuals and organizations;    2. maintain safe and secure computing environments; and,    3. assess the impact of technological advan"
  },
  {
    "title": "CSEC Information Technology - Part 71",
    "content": "nd,    3. assess the impact of technological advancements on different fields, disciplines and jobs.       SPECIFIC OBJECTIVES    CONTENT  IMPLICATIONS OF MISUSE AND  CYBERSECURITY      Students should be able to:    1. outline    the    concepts    of computer  security, cybersecurity and   computer  misuse;    Computer   security   and cybersecurity   as  related to the assessment and minimization  of risk.     – Elements: vulnerability, threat, attack,  countermeasure.    Computer    misuse"
  },
  {
    "title": "CSEC Information Technology - Part 72",
    "content": ", attack,  countermeasure.    Computer    misuse    by    individuals    and  groups/organizations.     2. assess the potential impact of computer  systems   misuse   based   on   the   main  entities impacted;         Misuse:    (a) Cyberbullying, copyright  infringement,  data  theft,  denial  of  service    attacks,    transmission    of  viruses and  malware,  identity  theft,  online publication of obscene  materials, phishing attacks, software  and  music  piracy,  financial  abuses,  viol"
  },
  {
    "title": "CSEC Information Technology - Part 73",
    "content": "are  and  music  piracy,  financial  abuses,  violation of privacy, propaganda,  electronic eavesdropping, industrial  espionage; and,    (b) Entity impacted: individual,  organization, government.        CXC 30/G/SYLL 17 16 www.cxc.org  SECTION  3:  SOCIAL  AND  ECONOMIC  IMPACT  OF  INFORMATION AND COMMUNICATIONS  TECHNOLOGY (ICT) (cont’d)      SPECIFIC OBJECTIVES CONTENT    IMPLICATIONS OF MISUSE AND  CYBERSECURITY (cont’d)      Students should be able to:      3. describe suitable countermea"
  },
  {
    "title": "CSEC Information Technology - Part 74",
    "content": "d be able to:      3. describe suitable countermeasures to  mitigate effects of identified threats;  Physical   measures:   backup   and   recovery  procedures;    hardware    firewall,    intrusion  detection systems, biometrics.     Software  measures:  effective  passwords  and  authentication  systems,  encryption  of data,  firewall, biometrics,  antivirus and  malware  detection.    Personal Security practices.    Some practices include:    - verifying   authenticity   of   email   from  c"
  },
  {
    "title": "CSEC Information Technology - Part 75",
    "content": "- verifying   authenticity   of   email   from  companies    or    individuals,    assessing  website  URLs  for  authenticity,  limiting  access to open Wi-Fi networks, securing  mobile  devices, protection in an online  environment (for     example, social  media).     IMPACT ON JOB SKILLS AND CAREERS      Students should be able to:      4. assess the effect of automation on job  security;   Job loss vs productivity gains in skilled and  unskilled job categories.     5. describe the roles of"
  },
  {
    "title": "CSEC Information Technology - Part 76",
    "content": "illed job categories.     5. describe the roles of various personnel  in computer-related professions; and,  Network Engineer, Computer  Programmer, Computer Support  Specialist,    Computer    Systems    Analyst,  Administrators   (Network,   Systems   and  Database),    Software    Developer,    Web  Developer, Social Media Specialist.                    CXC 30/G/SYLL 17 17 www.cxc.org  SECTION  3:  SOCIAL  AND  ECONOMIC  IMPACT  OF  INFORMATION AND COMMUNICATIONS  TECHNOLOGY (ICT) (cont’d)"
  },
  {
    "title": "CSEC Information Technology - Part 77",
    "content": "N AND COMMUNICATIONS  TECHNOLOGY (ICT) (cont’d)      SPECIFIC OBJECTIVES CONTENT    IMPACT ON JOB SKILLS AND CAREERS  (cont’d)      Students should be able to:      6. assess  the  impact  of  information  and  communications  technology on select  fields.  Economic  implications  of  ICT  on  Education,  Medicine,   Business,   Law   Enforcement   and  Recreation.    For example:    (a) Impact on Education in terms of:  access  to  information,  reach  (distance  teaching),   collaborative   te"
  },
  {
    "title": "CSEC Information Technology - Part 78",
    "content": "reach  (distance  teaching),   collaborative   teaching   and  learning, plagiarism; online tutoring.    (b) Impact on Medicine in terms of:  access  to  information  (for  both  medical  personnel  and  patients),  telemedicine,  eHealth     (online     access     to     health  services),  implications  for  the  quality  of  healthcare, increase   in   self-diagnosis,  easy   access   to   medical   expertise   in  distant location (for example,  teleradiology).      (c) Impact on Business i"
  },
  {
    "title": "CSEC Information Technology - Part 79",
    "content": "le,  teleradiology).      (c) Impact on Business in terms of:  E-commerce, Electronic   Point   of   Sale  (EPOS), telecommuting Email.    (d) Impact on Law Enforcement in terms of:  E-surveillance, finger printing,  Biometrics.    (e) Impact on Recreation in terms of:  Music and gaming.                CXC 30/G/SYLL 17 18 www.cxc.org  SECTION  3:  SOCIAL  AND  ECONOMIC  IMPACT  OF  INFORMATION  AND  COMMUNICATIONS  TECHNOLOGY (ICT) (cont’d)      Suggested Teaching and Learning Activities    To f"
  },
  {
    "title": "CSEC Information Technology - Part 80",
    "content": "Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers/facilitators are encouraged  to engage students in the teaching and learning activities below.    1. Using a screenshot of a student’s offensive comment about a teacher/peer on social media as  stimulus, engage students in a discussion on cyberbullying.    2. Allow  students  to  observe  short  clips  about  various  forms  of  computer  systems  misuse  (for  example, ha"
  },
  {
    "title": "CSEC Information Technology - Part 81",
    "content": "of  computer  systems  misuse  (for  example, hacking and identity theft) then engage in discussions on cybersecurity.    3. Encourage students to write a report to be placed on the school’s notice board to describe the  threats associated with each specific vulnerability discussed in class.    4. Have  students  classify  countermeasures into  appropriate  categories:  physical  or  software  related. Have students derive definitions of physical and software counter measures, based on  classi"
  },
  {
    "title": "CSEC Information Technology - Part 82",
    "content": "al and software counter measures, based on  classifications.    5. Engage students in a poster-making competition in which they illustrate good personal security  practices.    6. Engage students in a web quest where they explore different scenarios that will culminate in  obtaining authentic and reliable online sources.    7. Engage  students  in  a  debate  where  they  explore  the  implications  of  companies utilizing  automated  kiosks  to  transact  business.  Have  students  discuss  the"
  },
  {
    "title": "CSEC Information Technology - Part 83",
    "content": "transact  business.  Have  students  discuss  the  effects  of  job  loss  versus  productivity gained in skilled and unskilled categories.     8. Engage  students  in  a  project  where  they  visit/research  various  businesses  to  determine  the  extent to which technology is being used in different positions.    9. Have students conduct research on cybersecurity and then present their information in a panel  discussion  format.  (Students  should  be  able  to  pose  questions  to  the  pa"
  },
  {
    "title": "CSEC Information Technology - Part 84",
    "content": "should  be  able  to  pose  questions  to  the  panel  members).                                  CXC 30/G/SYLL 17 19 www.cxc.org   SECTION 4: WORD-PROCESSING AND WEB PAGE DESIGN      GENERAL OBJECTIVES    On completion of this Section, students should:     1. have  hands-on  experience  in  the  use  of  Word-Processing and  Web  Page  Design  in  the  development of computer-generated documents; and,     2. be able to express their aptitude and creativity in design.      SPECIFIC OBJECTIVES C"
  },
  {
    "title": "CSEC Information Technology - Part 85",
    "content": "d creativity in design.      SPECIFIC OBJECTIVES CONTENT    WORD-PROCESSING      Students should be able to:      1. create a document using content from  a range of sources;  Importing text (combining documents).    Typewritten text, images and other objects.     2. use appropriate document formatting  features;   Formatting   features: font   types   and   sizes,  colour, underline, bold, italics, superscript and  subscript, tab  stops,  bullets  and  numbering,  line  spacing,  justification"
  },
  {
    "title": "CSEC Information Technology - Part 86",
    "content": "s  and  numbering,  line  spacing,  justification  (left,  right,  centre,  full),  highlight,  uppercase,  word  wrap,  page  size,  margins,  page  and  section  breaks,  page  numbers, headers,   footers,   footnotes   and  endnotes.     3. use  appropriate  editing  features  to  structure and organize a document;  Drag    and    drop    editing:    perform    block  operations  on  selected  areas  of  text  within  a  document.    Use search and replace functions appropriately  to edit a d"
  },
  {
    "title": "CSEC Information Technology - Part 87",
    "content": "h and replace functions appropriately  to edit a document.    Use  of  tables,  table  styles,  shading,  borders,  row   and   column   insertion,   split   cells,   split  tables, text direction and cell margins, cell size.    Use of columns (one, two, three, left and right  columns, column breaks).              CXC 30/G/SYLL 17 20 www.cxc.org  SECTION 4: WORD-PROCESSING AND WEB PAGE DESIGN (cont’d)      SPECIFIC OBJECTIVES CONTENT    WORD-PROCESSING (cont’d)      Students should be able to:"
  },
  {
    "title": "CSEC Information Technology - Part 88",
    "content": "ESSING (cont’d)      Students should be able to:      4. use   the   review feature   of   a   word  processor     to     enhance     document  readiness;    Spell and grammar  check,  thesaurus,  word  count, language setting, comments, and track  changes.   5. appropriately  use features  that  allow  the protection of a document;  Automatic    save    and    backup copy,    edit  restrictions – password protection.     6. generate table   of   contents for   a  document;   Auto table of conte"
  },
  {
    "title": "CSEC Information Technology - Part 89",
    "content": "contents for   a  document;   Auto table of content.     7. use    mail merge    feature in    the  preparation   of   a   document   for   a  variety of situations;  Creation  of  primary documents  and  data  files  in mail merge application.    Field names.     8. create a  fillable  electronic  form  for  online use;  Use  of  content  controls,  such  as  check  boxes,  text  boxes,  date  picker,  drop-down  lists,  and  command buttons.     WEB PAGE DESIGN    This section provides studen"
  },
  {
    "title": "CSEC Information Technology - Part 90",
    "content": "WEB PAGE DESIGN    This section provides students with hands-on experience in the use of web design tools to create a  simple website.     Students should be able to:      9. plan a website structure and  organization of page;  Reasons for the website.     The intended audience.     Number of web pages desired (no more than 3  pages).    Content of each page.     Layout of the web page.     10. create   simple web pages using   a  variety of design features;    (The   use   of   HTML   coding"
  },
  {
    "title": "CSEC Information Technology - Part 91",
    "content": "esign features;    (The   use   of   HTML   coding   is   not  required.)    Choosing an appropriate design for a page.    Inserting and deleting text and graphics.    Wrap text with image.    Create home page with hyperlinks.    CXC 30/G/SYLL 17 21 www.cxc.org  SECTION 4: WORD-PROCESSING AND WEB PAGE DESIGN (cont’d)      SPECIFIC OBJECTIVES CONTENT    WEB PAGE DESIGN (cont’d)      Students should be able to:      11. insert hyperlinks within    different  locations of a typical web page; and,"
  },
  {
    "title": "CSEC Information Technology - Part 92",
    "content": "different  locations of a typical web page; and,  Link to another web page.    Link to a location within the web  page.    Link to an email address.    Link to user-created files.     12. evaluate a  website for  accuracy,  user  friendliness and effective display.  Considerations for publishing a website:    Verify that all the hyperlinks work correctly.    Use a test audience.    Verify that all content is up-to-date.        Suggested Teaching and Learning Activities    To  facilitate  student"
  },
  {
    "title": "CSEC Information Technology - Part 93",
    "content": "and Learning Activities    To  facilitate  students’  attainment  of the   objectives   of   this   Section,   teachers/facilitators   are  encouraged to engage students in the teaching and learning activities below.    1. Have students compare and contrast different types of word processors.    2. Encourage students to create newsletters/brochures/business cards/advertisements for Clubs  and Departments within their school.      3. Arrange for students to perform the duties of the School Secret"
  },
  {
    "title": "CSEC Information Technology - Part 94",
    "content": "tudents to perform the duties of the School Secretary for the Week, for example,  students  should  prepare: notices  for  parent  conferences,  gate/corridor passes,  and  letters  seeking sponsorship for a school activity.    4. Organize students in small groups to develop and create club or school web pages using a word  processor  or  free  online  web  services.    Investors  and/or  Stakeholders  should  be  invited  to  critique as students give their presentations.    5. Demonstrate how"
  },
  {
    "title": "CSEC Information Technology - Part 95",
    "content": "s give their presentations.    5. Demonstrate how to add the Developer tab in different productivity tools to access Visual Basic  for Applications (VBA) (for example, Microsoft Excel or Word).    6. Share examples of fillable forms where users order items online.      CXC 30/G/SYLL 17 22 www.cxc.org   SECTION 5: SPREADSHEETS      GENERAL OBJECTIVE    On completion of this Section, students should develop expertise in the use of a spreadsheet package  in the development of computer applications"
  },
  {
    "title": "CSEC Information Technology - Part 96",
    "content": "ckage  in the development of computer applications.    SPECIFIC OBJECTIVES CONTENT    Students should be able to:      1. explain the purpose of a spreadsheet; Purpose  of  a  spreadsheet:  a  spreadsheet  is  a  table    consisting    of    cells    (columns,    row  locations)  that  hold  accounting  or  financial  data and simulates the traditional  spreadsheet. It captures displays and  manipulates data.     2. use appropriate terminologies and  notions commonly associated with  spreadsheet"
  },
  {
    "title": "CSEC Information Technology - Part 97",
    "content": "and  notions commonly associated with  spreadsheets;  Common    features:    workbook,    worksheet,  column,  row, cell  (cell  address,  range,  label,  value), formula, function.     3. use basic pre-defined systems  functions;  Including sum, average, date, max, min, count,  counta, countif, vlookup, pmt, if.     4. create advanced arithmetic formulae; Formulae    including    addition,    subtraction,  multiplication, division, and use of brackets.     5. replicate (copy) formulae into othe"
  },
  {
    "title": "CSEC Information Technology - Part 98",
    "content": "ackets.     5. replicate (copy) formulae into other  cells;  Relative    addressing,    absolute    addressing,  naming of ranges.    Effect  of  move,  copy,  delete  operations  on  formulae.     6. manipulate columns and rows; Insert, delete and modify columns and rows.      7. manipulate data in a spreadsheet; Numeric Data formatting (currency,  accounting,    percentage,    comma,    decimal  places).    Sorting  data  (primary field, secondary field,  ascending vs descending order).    Fil"
  },
  {
    "title": "CSEC Information Technology - Part 99",
    "content": "ary field,  ascending vs descending order).    Filtering    data    (multiple criteria,    complex  criterion).    Pivot  Table (create  one  and  two  dimensional  pivot tables, create frequency distribution from  data and create pivot chart)      CXC 30/G/SYLL 17 23 www.cxc.org  SECTION 5: SPREADSHEETS (cont’d)      SPECIFIC OBJECTIVES CONTENT    Students should be able to:      8. perform charting operations; and, Select appropriate chart types: Column charts,  Bar charts, line graphs, pie ch"
  },
  {
    "title": "CSEC Information Technology - Part 100",
    "content": "s: Column charts,  Bar charts, line graphs, pie charts.    Labelling  charts:  graph  titles,  labels  on  axes,  data labels.     9. Manipulate one or more worksheets. Use   of one   or more worksheets   to   solve  problems   involving   some   of or all   of   the  functions and operations listed above.     Linking  of  two  or  more  worksheets  to  solve  problems.      Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teache"
  },
  {
    "title": "CSEC Information Technology - Part 101",
    "content": "tainment of the objectives of this Section, teachers/facilitators are encouraged  to engage students in the teaching and learning activities below.    1. Teachers should engage students in using feedback on class activities towards completing their  SBA.     2. Encourage  students  to  complete exercises  that  use  functions  and  formulas  to  effect  a  more  efficient and effective solution.    3. Demonstrate examples  of locating text and data on a spreadsheet so that data is  not lost if"
  },
  {
    "title": "CSEC Information Technology - Part 102",
    "content": "ta on a spreadsheet so that data is  not lost if  rows or columns are inserted or deleted.    4. Encourage students to practise pasting versus moving various types of charts to a new sheet;  inserting  titles  and  axes  labels.  Students  should  also  practise  pasting  charts  to  a  word- processed document and adjusting the chart on the page.    5. Encourage  students  to  practise  entering  test data  for  their  programs  to  see  the  results  and  reinforce these concepts from Sections"
  },
  {
    "title": "CSEC Information Technology - Part 103",
    "content": "sults  and  reinforce these concepts from Sections 7 and 8.               CXC 30/G/SYLL 17 24 www.cxc.org   SECTION 6: DATABASE MANAGEMENT      GENERAL OBJECTIVES     On completion of this Section, students should develop expertise in the design of a database  management system in the development of computer applications.    SPECIFIC OBJECTIVES CONTENT    Students should be able to:      1. explain the concept of a database;  Definition of database:     (a) repository of information; and,     ("
  },
  {
    "title": "CSEC Information Technology - Part 104",
    "content": "ase:     (a) repository of information; and,     (b) collection  of  tables  that  are  related  to  each other.    Purpose of database.     2. use terminology commonly  associated with a database;    Database   terminology:   table, row   (record),  column  (field),  primary  key,  secondary key,  candidate key, foreign key.    Data  types: numeric;  text; logical; date  /time;  currency.     3. create a database; and, Table   structure   with   at   least   three   data    types   and populate"
  },
  {
    "title": "CSEC Information Technology - Part 105",
    "content": "at   least   three   data    types   and populated with at least 25 records.      Modify  a  table  structure:  adding  new  fields,  deleting fields, changing field definitions.    Establish primary keys.    Establish relationships: show the joins between  tables (one-to-one and one-to-many).     4. manipulate data in a database. (a) Forms:    (i) Use of form wizard only;  (ii) select suitable fields; and,  (iii) use of sub-form.    (b) Queries:     (i) more than one criterion;   (ii) use of s"
  },
  {
    "title": "CSEC Information Technology - Part 106",
    "content": ":     (i) more than one criterion;   (ii) use of select;   (iii) use of calculated field; and,  (iv) two  or  more  fields  involving  the  use    of    relational    and    logical  operators.    CXC 30/G/SYLL 17 25 www.cxc.org  SECTION 6: DATABASE MANAGEMENT (cont’d)      SPECIFIC OBJECTIVES CONTENT    Students should be able to:       (c) Reports:    (i) use of report wizard;  (ii) use  of sorting,  grouping,  statistical  and summary features, for  example, count, sum, and average;  (iii) re"
  },
  {
    "title": "CSEC Information Technology - Part 107",
    "content": ", for  example, count, sum, and average;  (iii) report generated to screen, printer  and file; and,  (iv) renaming of report title.      Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers/facilitators are encouraged  to engage students in the teaching and learning activities below.    1. Highlight  various  paper-based  databases  of  which  students  may  be  aware  and  discuss  advantages  of digitizing these  paper-bas"
  },
  {
    "title": "CSEC Information Technology - Part 108",
    "content": "iscuss  advantages  of digitizing these  paper-based  records.  From  the  discussion,  have  students  generate definitions of a database and terminologies associated with a database.    2. Engage  students  in  exercises  where  they  create  database  tables  and  practise  changing  the  general properties of database tables.    3. Engage students in activities where they practise manipulating table-editing features such as  sorting, inserting and deleting records and fields.    4. Engage st"
  },
  {
    "title": "CSEC Information Technology - Part 109",
    "content": "g and deleting records and fields.    4. Engage students  in activities  where they use given criteria to create simple queries that  will  pull specific records from a table or tables.    5. Engage  students  in  activities  where  they  create  presentable  reports  based  on  tables  and/or  queries  that  can  be  distributed.  Students  should  also  practise  generating  additional  report  details such as summary options.                            CXC 30/G/SYLL 17 26 www.cxc.org   SECTI"
  },
  {
    "title": "CSEC Information Technology - Part 110",
    "content": "CXC 30/G/SYLL 17 26 www.cxc.org   SECTION 7: PROBLEM-SOLVING AND PROGRAM DESIGN      GENERAL OBJECTIVES    On completion of this Section, students should:     1. develop the cognitive skills to solve problems; and,     2. develop  competence  in applying  a  structured  approach  to solving  problems on  the  computer.    SPECIFIC OBJECTIVES CONTENT     Students should be able to:      1. outline the steps in problem-solving; Steps in problem-solving:    (a) define the problem;     (b"
  },
  {
    "title": "CSEC Information Technology - Part 111",
    "content": "problem-solving:    (a) define the problem;     (b) propose and evaluate solutions;     (c) determine the most efficient solution;    (d) develop the algorithm; and,    (e) test and validate the solution.     2. use  the  divide-and-conquer  approach  to decompose large everyday  problems into smaller tasks;    Basic  treatment  of  the  structured  approach  for solving complex problems.     Note: It  is  not  necessary  to  give  a  detailed  treatment of the approach. Simple illustrations  ca"
  },
  {
    "title": "CSEC Information Technology - Part 112",
    "content": "reatment of the approach. Simple illustrations  can be provided to help students recognize that  most problems involve multiple tasks and that  they should understand how to approach such  problems in a structured manner.     3. define  a  problem  by  decomposing  it  into its significant components;    The components are: input; process;  and  output. A defining diagram (IPO Chart) may be  used to delineate the components.      4. distinguish    between    variables    and  constants;  Variabl"
  },
  {
    "title": "CSEC Information Technology - Part 113",
    "content": "between    variables    and  constants;  Variables as an area of storage whose value  can change during processing; the value of a  constant never changes.    Data  types: integers, floating point (real),  characters, Boolean, string.           CXC 30/G/SYLL 17 27 www.cxc.org  SECTION 7: PROBLEM-SOLVING AND PROGRAM DESIGN (cont’d)      SPECIFIC OBJECTIVES CONTENT    Students should be able to:      5. explain the concept of algorithms; Definition of algorithms.     Characteristics: finite numb"
  },
  {
    "title": "CSEC Information Technology - Part 114",
    "content": "on of algorithms.     Characteristics: finite number of steps,  precise, unambiguous, flow of control from  one process to another, terminate.     6. represent  algorithms  in  the  form  of  flowchart and pseudocode; and,  Use of flowchart symbols: input/output,  process, decision, directional arrows,  start/stop.     Pseudocode – Use of read, input, store,  write, print, output, display, conditional  branching (if-then, if-then-else, nested  conditions); loops (for, while, repeat).    Use of r"
  },
  {
    "title": "CSEC Information Technology - Part 115",
    "content": "nditions); loops (for, while, repeat).    Use of relational operators: <, >, =, <=, >  =,< >.   Logical operators: AND, OR, NOT; use of  truth tables.    Arithmetic operators: +‚ –‚ *, /, MOD, DIV.     7. test algorithms for correctness.  Desk checks/dry run: construction and use of  trace tables to verify results. Trace tables  consist of variable names (identifiers) as  column headings and values in the cells, one  row for each pass.      Suggested Teaching and Learning Activities    To facili"
  },
  {
    "title": "CSEC Information Technology - Part 116",
    "content": "sted Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers/facilitators are encouraged  to engage students in the teaching and learning activities below.    1. Provide students with simple everyday scenarios which would allow them to practise the steps  in  problem-solving  and  logical  thinking. Examples  of scenarios  include  giving  directions  to  a  particular  location;  or  determining  which  mode  of  transportation  (for  e"
  },
  {
    "title": "CSEC Information Technology - Part 117",
    "content": "ermining  which  mode  of  transportation  (for  example,  airplane,  bicycle, vehicle, walking)  is best suited for travelling to a specific location based on weather  conditions; or determining which of three groups of CSEC® subjects (for example, languages,  sciences, arts) should be chosen given that a favourite subject is included in two of the groups.            CXC 30/G/SYLL 17 28 www.cxc.org  SECTION 7: PROBLEM-SOLVING AND PROGRAM DESIGN (cont’d)      2. Illustrate using everyday problem"
  },
  {
    "title": "CSEC Information Technology - Part 118",
    "content": "(cont’d)      2. Illustrate using everyday problems, such as finding the exit within a hotel or preparing a three- course meal.    (a) divide the problem into a number of sub-problems;    (b) solve the sub-problems individually; and,    (c) combine  the solutions  to  the  sub-problems  to  generate  the  solution  for  the  original  problem.    3. Present simple  scenarios  to  help  students  appreciate  the  difference  between  variables  and  constants by using everyday values such as the"
  },
  {
    "title": "CSEC Information Technology - Part 119",
    "content": "d  constants by using everyday values such as the percentage of road tax, amount of school fees,  cost of bus tickets, cost of today’s lunch, or time taken to walk from one class to another.    4. Present students with visuals to encourage them to identify flowchart symbols (for example,  rectangular  symbol  to  represent  a  process).  Teachers  can  also  use  exercises  to  match  pseudocode  statements  with  select  symbols  (for  example,  start  of  algorithm  (start/stop  symbol), input"
  },
  {
    "title": "CSEC Information Technology - Part 120",
    "content": "start  of  algorithm  (start/stop  symbol), input (read/write symbol), and a condition (decision symbol).    5. Engage students in an activity to help them identify relational, logical and arithmetic operators  and how a decision is transformed into a flowchart symbol or a pseudocode statement using  suitable operators.    6. Encourage students to practise drawing flowcharts and producing accompanying pseudocode.  They  should then  use  pseudocode  to  draw  the  flowchart  as  practice  towar"
  },
  {
    "title": "CSEC Information Technology - Part 121",
    "content": "ode  to  draw  the  flowchart  as  practice  towards  their  SBA  assignment.                                                              CXC 30/G/SYLL 17 29 www.cxc.org   SECTION 8: PROGRAM IMPLEMENTATION      GENERAL OBJECTIVES    On completion of this Section, students should:    1. know how to translate an algorithm into a high-level program; and,    2. understand how to employ techniques to successfully execute a program.    SPECIFIC OBJECTIVES    CONTENT  Students should be able to:"
  },
  {
    "title": "CSEC Information Technology - Part 122",
    "content": "TIVES    CONTENT  Students should be able to:      1. distinguish between low-level and high- level programming languages;  Low-level language (Machine or Assembly).    High-level   language   (For   example, Visual  Basic, Pascal, C).     2. describe   the   sequence   of   steps      in  implementing a program;  Steps in implementing a program:    (a) create source code;    (b) translate and/or link (on some systems  this step is transparent to users);    (c) execute/run program; and,    (d) m"
  },
  {
    "title": "CSEC Information Technology - Part 123",
    "content": "users);    (c) execute/run program; and,    (d) maintain program.     3. perform  checks  and  tests  on  programs  to verify correctness;  Errors: syntax, logic, runtime.    Testing (test data).     Debugging techniques.      4. declare variables  and  constants  using  elementary data types;  Data     types:     integer,     real/double/float,  character, string and Boolean/logical.     5. translate   algorithmic   statements   into  high-level language syntax; and,  Assignment statements; in"
  },
  {
    "title": "CSEC Information Technology - Part 124",
    "content": "l language syntax; and,  Assignment statements; input/output  operations    using    standard    input/output  (reading     data     entered     via     keyboard,  displaying data on monitor).    Syntax  for  arithmetic,  logic  and  relational  operators.    Syntax    for conditional branching    (for  example, if-then, if-then-else, nested if-then- else or case).     Syntax for   Iteration   (Loops):   for,   while,  repeat.    CXC 30/G/SYLL 17 30 www.cxc.org  SECTION 8: PROGRAM IMPLEMENTATION"
  },
  {
    "title": "CSEC Information Technology - Part 125",
    "content": "30 www.cxc.org  SECTION 8: PROGRAM IMPLEMENTATION (cont’d)      SPECIFIC OBJECTIVES    CONTENT  Students should be able to:      6. effectively document programs. Importance of documentation.    Features  of  internal  documentation  (use  of  mnemonic, variable names, use of  comments,   indentation,   effective   use   of  white space).    Features  of  external  documentation (user  manual).      Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectiv"
  },
  {
    "title": "CSEC Information Technology - Part 126",
    "content": "To facilitate students’ attainment of the objectives of this Section, teachers/facilitators are encouraged  to engage students in the teaching and learning activities below.    1. Provide  students  with  various  examples  of  codes  that  represent  high-level  and  low-level  programming languages.     2. Use programming examples to demonstrate to students the effect of not declaring variables,  constants,  or  arrays,  and  the  advantage  of initializing them  to  avoid  processing  erroneo"
  },
  {
    "title": "CSEC Information Technology - Part 127",
    "content": "initializing them  to  avoid  processing  erroneous  data.    3. Provide  opportunities  for  students  to  practise  identifying  test  data  for  sample  programs  to  understand  the  use  of  appropriate  data  (for  example,  negative,  positive,  or  decimal  values,  text) for declared variables and the types of errors produced as a result of incorrect input.    4. Encourage  students  to use the  selected  programming  language to  practise  writing  code  for  simple  applications  bas"
  },
  {
    "title": "CSEC Information Technology - Part 128",
    "content": "ise  writing  code  for  simple  applications  based  on  flowcharts  and  pseudocode  as  practice  towards  their  SBA  assignment.     5. Engage students in activities where programming language code of declarations, input/output  and  assignment  statements,  conditional  branching  and  loops  are  used  to  produce  working  programs.   CXC 30/G/SYLL 17 31 www.cxc.org   GUIDELINES FOR THE CONDUCT OF THE SCHOOL-BASED  ASSESSMENT    School-Based  Assessment  is  an  integral  part  of  stud"
  },
  {
    "title": "CSEC Information Technology - Part 129",
    "content": "ased  Assessment  is  an  integral  part  of  student  assessment  in  the  course  covered  by this  syllabus. It is intended to assist students in acquiring and using certain knowledge, skills and attitudes  that are associated with the subject. The activities for the SBA are linked to the syllabus and are part  of the learning activities to enable the student to achieve the objectives of the syllabus. Students are  encouraged to work in groups.     School-Based Assessment provides an opportun"
  },
  {
    "title": "CSEC Information Technology - Part 130",
    "content": ".     School-Based Assessment provides an opportunity to individualize a part of the curriculum to meet  the needs of students.  It facilitates feedback to the student at various stages of the experience.  This  helps to build their self-confidence as students proceed with their studies.  School-Based Assessment  also facilitates the development of the critical skills and abilities that are emphasized by this CSEC®  subject and enhances the validity of the examination on which the candidate’s pe"
  },
  {
    "title": "CSEC Information Technology - Part 131",
    "content": "ity of the examination on which the candidate’s performance is  reported. SBA,  therefore,  makes  a  significant  and  unique  contribution  to both  the  development  of  relevant skills and the testing and rewarding of students for the acquisitions of those skills.    During  the  course  of  study  for  the  subject,  students  shall  obtain  marks  for  the  competence  they  develop and demonstrate in undertaking their SBA assignments.  These marks contribute to the final  marks and grades"
  },
  {
    "title": "CSEC Information Technology - Part 132",
    "content": "se marks contribute to the final  marks and grades that are awarded to students for their performance in the examination.     The guidelines provided in this syllabus for selecting appropriate tasks are intended to assist teachers  and  students  in  designing  assignments  that  are  valid  for  the  purpose  of SBA.  These  guidelines  are  intended also to assist teachers in awarding marks that are reliable estimates of the achievement of  students in the School-Based Assessment component of"
  },
  {
    "title": "CSEC Information Technology - Part 133",
    "content": "dents in the School-Based Assessment component of the course. In order to ensure that the scores  awarded by teachers are in line with the CXC® standards, the Council undertakes the moderation of a  sample of the School-Based Assessment assignments.    The  Caribbean  Examinations  Council  seeks  to  ensure  that  the  SBA  scores  are  valid  and  reliable  estimates  of  accomplishment. Candidates  are  provided  with  the  guidelines  below  in  order  to  successfully complete the SBA.    T"
  },
  {
    "title": "CSEC Information Technology - Part 134",
    "content": "in  order  to  successfully complete the SBA.    The School-Based Assessment seeks to provide students with the opportunity to demonstrate their  problem-solving and programming skills as well as their ability to use productivity tools effectively  in:    1. entering, manipulating and presenting text data;  2. simulating a worksheet;  3. entering data, performing simple analysis on data and presenting data using a database  management tool; and,  4. applying programming language code to automate"
  },
  {
    "title": "CSEC Information Technology - Part 135",
    "content": "4. applying programming language code to automate a segment of the project.       ASSIGNMENT  The School-Based Assessment consists of one practical project consisting of five related components,  prepared and marked by the teacher in accordance with CXC® guidelines.    The components will test Problem-Solving and Programming as well as the application of processes  involved in the use of Database Management, Spreadsheets and Word-Processing and Web Page  Design. The five components will therefo"
  },
  {
    "title": "CSEC Information Technology - Part 136",
    "content": "Web Page  Design. The five components will therefore cover the Specific Objectives in Sections 4, 5, 6, 7 and  8.    CXC 30/G/SYLL 17 32 www.cxc.org  Types of Projects    Teachers should develop assignments that expose the students to realistic applications which  involve, but are not limited to the following areas:    (a) business (for example, storing and managing employee, customer and sales records,  marketing);    (b) banking (for example, creation of different types of accounts, loans, int"
  },
  {
    "title": "CSEC Information Technology - Part 137",
    "content": "reation of different types of accounts, loans, interest, payments  on loans, fixed deposits, investments);    (c) education (for example, enrollment in schools, academic record-keeping);    (d) entertainment (for example, analysis of data on distribution and sales of movies, music,  electronic games);    (e) environment (for example, records of storms and hurricanes over specific periods and  in named territories, calculation of cost of  damage to infrastructure,  housing, livestock,  farms);"
  },
  {
    "title": "CSEC Information Technology - Part 138",
    "content": "o infrastructure,  housing, livestock,  farms);    (f) law enforcement (collection and management of crime statistics collection and analysis  of data on offenders, cost of maintaining prison populations);    (g) medicine (for example, managing patient records collection and analysis of data on diseases  over a period of time and in various locations);    (h) monitoring (for  example,  analysis of data on accidents at intersections, counting and  categorising visitor arrivals in Caribbean territ"
  },
  {
    "title": "CSEC Information Technology - Part 139",
    "content": "categorising visitor arrivals in Caribbean territories); and,    (i) sports (for example, collection and processing of data on athletes’ sport meetings).        Word-Processing    This assignment should consist of the formatting, importing and/or documentation of information.  The assignment must be chosen from TWO of the following:    (a) a document containing a table of contents and/or prepared for mass mailing;    (b) use  of templates  (such  as memos,  reports,  faxes,  simple  brochures,"
  },
  {
    "title": "CSEC Information Technology - Part 140",
    "content": "as memos,  reports,  faxes,  simple  brochures,  flyers)  or  newspaper  articles; and,      (c) a fillable form using the Developer. It should comprise no more than four controls (for example,  text box, drop-down list, check box or date picker). The controls can be used more than once  when designing the form. Manipulation of the controls should be limited to renaming labels  and prompts (tags), and adding drop-down list properties.            CXC 30/G/SYLL 17 33 www.cxc.org  Web Page Design"
  },
  {
    "title": "CSEC Information Technology - Part 141",
    "content": "CXC 30/G/SYLL 17 33 www.cxc.org  Web Page Design    This assignment should be limited to one web page that is designed using a word processor or a free  online web service. Students can insert screenshots or create the design of the web page at the end of  the  word-processed  document.  Alternatively,  they  can use  the  last  page  in  their  word-processed  document to paste the link to the online web page. Only the candidate number placed near the top of  the page should be used as a form"
  },
  {
    "title": "CSEC Information Technology - Part 142",
    "content": "near the top of  the page should be used as a form of identification for the web page.     The web page should contain at minimum:    (a) a logo depicting the concept of the project;      (b) defined areas on the page for navigational links and content; and,    (c) at minimum two hyperlinks of the following:     link to a location within the web page;     link to an email address;     link to another web page (which may or may not exist); and,      link to user-created files.      Spreadshee"
  },
  {
    "title": "CSEC Information Technology - Part 143",
    "content": " link to user-created files.      Spreadsheet    This assignment  should  be  saved  as  one workbook (comprising two  or more worksheets). The  tasks  should be limited to:    (a) a maximum of TWO major tasks (for example, create the spreadsheet; modify the spreadsheet)  consisting  of  no  more  than  THREE  requirements (for  example, sorting  of  data  and use  of  functions and formulas on data); and,     (b) the creation of no more than TWO types of charts.      Database Management"
  },
  {
    "title": "CSEC Information Technology - Part 144",
    "content": "an TWO types of charts.      Database Management    This assignment should be saved as one database file. The tasks should be limited to no more than:    (a) THREE tables or files.    (b) TWO queries (using criteria from one table, and more than one table).    (c) ONE calculation within queries.    (d) ONE form, showing a main and sub-form (for example, to search for a record, or to move to  the next or previous record).    (e) ONE report, with grouping and sorting involving TWO or THREE tables."
  },
  {
    "title": "CSEC Information Technology - Part 145",
    "content": "rouping and sorting involving TWO or THREE tables.    CXC 30/G/SYLL 17 34 www.cxc.org  Problem-Solving and Programming    This assignment should use programming language selected by the centre. Examples include but are  not limited to:    (a) prompting for data entry with appropriate validation with suitable messages output to the  user; and,    (b) input of data to variables and required calculations.    The code should be limited to:    (a) Input of values or sets of text.    (b) Output of res"
  },
  {
    "title": "CSEC Information Technology - Part 146",
    "content": "ut of values or sets of text.    (b) Output of results or messages.    (c) Conditional branching (if-then; if-then-else, or case).    (d) Iterations/Looping (for, repeat, or while).     The problem-solving section must be submitted as a PDF document.    Requirements Guidelines  Cover sheet The information supplied here is essential since it is used  to associate the submission with a particular candidate.    Problem definition Students should provide the statement of the problem,  that  part  of"
  },
  {
    "title": "CSEC Information Technology - Part 147",
    "content": "vide the statement of the problem,  that  part  of  the  problem  that was  chosen  for  coding  in  the  spreadsheet.    Algorithm Students are expected to i n c l u d e  flowcharts or pseudocode  for the segment of code that will be written.     Source code A copy of the programming language code.     Trace Table using test data  Students are required to supply the test data that produced  the output. This information would be necessary to  determine whether the tasks have been performed corre"
  },
  {
    "title": "CSEC Information Technology - Part 148",
    "content": "ermine whether the tasks have been performed correctly.    Program execution Students  are  required  to  submit  screenshots  of  working  program showing data entry and results produced.     ROLE OF THE TEACHER    The role of teacher is to:    (a) Assign the project for the School-Based Assessment.    (b) Provide guidance throughout the life of the projects. The teacher should work with candidates  to develop a project management chart with definite timelines for achieving clearly  identified"
  },
  {
    "title": "CSEC Information Technology - Part 149",
    "content": "inite timelines for achieving clearly  identified objectives, from project inception to project completion.    CXC 30/G/SYLL 17 35 www.cxc.org  (c) Guide students through the SBA by helping to clarify the problem or by discussing  possible approaches to solving the problem. Teachers, while giving guidance, should guard  against providing a complete solution to the problem for the candidate or prescribing a specific  format that should be followed.    (d) Assess student’s skills in problem-solvin"
  },
  {
    "title": "CSEC Information Technology - Part 150",
    "content": ".    (d) Assess student’s skills in problem-solving and algorithm development using flowcharts or  pseudocode, coding an algorithm using the  selected  programming  language and the  effective use of productivity tools to perform prescribed activities. The development of  the project is a continuous exercise that occurs during scheduled class hours as well as  outside class times. At a time to be determined by the teacher the relevant component  will be assessed and the marks recorded. Copies of"
  },
  {
    "title": "CSEC Information Technology - Part 151",
    "content": "will be assessed and the marks recorded. Copies of the completed documents should be  kept by both the teacher and students. The teacher should use the mark scheme provided  by CXC® and include any comments pertinent to the conduct of the assessment.    (e) Guide students through the SBA by helping to clarify the problem or by discussing  possible formats.    (f) Ensure that students are allowed sufficient access to equipment to allow successful  completion of their projects.      SCOPE AND SIZE"
  },
  {
    "title": "CSEC Information Technology - Part 152",
    "content": "completion of their projects.      SCOPE AND SIZE    The project should be the size and complexity for candidates to satisfactorily complete during  the second year of the two-year course.    The WP and WBD, SS and DB sections of the project should each have approximately the same  number of tasks and degree of complexity such that each project requires the  same amount of  preparation. The project should encompass some advanced processes in Sections 4, 5 and 6. Problem- Solving and Program  Im"
  },
  {
    "title": "CSEC Information Technology - Part 153",
    "content": "tions 4, 5 and 6. Problem- Solving and Program  Implementation should be based on the project and not attempted in  isolation. It must, therefore, be an actual implementation of a simple aspect of the project.    Teachers are encouraged to design their School-Based Assessment at the commencement of the  academic year. This would allow for the completion of sections of the project as topics are addressed.   It is suggested that the Problem-Solving component be attempted when the teacher has compl"
  },
  {
    "title": "CSEC Information Technology - Part 154",
    "content": "component be attempted when the teacher has completed  Section 7 of the syllabus, and the Program Implementation component at the completion of Section  8.      ASSESSMENT CRITERIA    The  following is the mark scheme for assessing SBA assignments. Teachers must clearly indicate the  breakdown of the marks allocated for each question on the candidates’ SBA paper.    Note to Teachers: The marks for the WP and WPD, SS and DB are to be summed and divided by 2 in  order to provide the Productivity"
  },
  {
    "title": "CSEC Information Technology - Part 155",
    "content": "ivided by 2 in  order to provide the Productivity Tools mark out of 35.                CXC 30/G/SYLL 17 36 www.cxc.org  WORD-PROCESSING – Maximum of 20 marks    Since teachers may vary the focus of their SBA from year to year, the Word-Processing component  offers some choice. To obtain the 20 marks for Word-Processing, teachers may:     Choose TWO of the three features: tables, columns, and inserting/importing files. (2 marks  each)   Choose TWO of  the  three  advanced  features:  Mail  merg"
  },
  {
    "title": "CSEC Information Technology - Part 156",
    "content": "WO of  the  three  advanced  features:  Mail  merge,  table  of  contents  and  fillable  forms. (5 marks each)    All other objectives are compulsory    Specific  Objective  Key Skills  The effectiveness with which the candidate(s) has/have  confidently used and/or manipulated:   Mark  Allocation  Maximum  marks per  sub-section     The following are compulsory (SO3).    S4: SO3 Document Formatting features  (4)   No more than FOUR features to be tested:       Any TWO: bold, underline, italics"
  },
  {
    "title": "CSEC Information Technology - Part 157",
    "content": "e tested:       Any TWO: bold, underline, italics        Justification (centre, right, full)        Changes in line spacing        Superscript and/or subscript        Changes in font or font size        Page numbering       S4: SO3 Page Layout  (2)     Any change in margins, page orientation, paper sizes  or text orientation  1      Correct use of header OR footer OR footnotes OR  endnotes  1           Select any two of the following (SO1 and SO2).    S4: SO1 Inserting/importing files  ("
  },
  {
    "title": "CSEC Information Technology - Part 158",
    "content": "and SO2).    S4: SO1 Inserting/importing files  (2)     Graphic / chart in document  1      Graphic/chart/table sized appropriately to fit in  desired location/margins    1   S4: SO2 Columns  (2)   Correct use in entire document or selected text 2    Mostly correct in document or selected text    1   S4: SO2 Tables  (2)   Correct number of rows and columns 1    Correct formatting of table (e.g. border, shading of cells,  colour)  1   Specific  Objective  Key Skills  The effectiveness with whi"
  },
  {
    "title": "CSEC Information Technology - Part 159",
    "content": "Objective  Key Skills  The effectiveness with which the candidate(s) has/have  confidently used and/or manipulated:   Mark  Allocation  Maximum  marks per  sub-section     Select any TWO of the following (SO6, SO7 or SO8).         CXC 30/G/SYLL 17 37 www.cxc.org  S4: SO6 Table of Contents  (5)     Auto-generation of table of contents  1      In suitable location   1      At least TWO levels of headings   1      Suitable headings chosen (1 mark EACH)  2        S4: SO7 Mail Merge Facility  (5"
  },
  {
    "title": "CSEC Information Technology - Part 160",
    "content": "rk EACH)  2        S4: SO7 Mail Merge Facility  (5)   Selection or creation of required merge fields in:       Data source  1      Primary document (final document consistent with  merged document)    1    Insertion of correct merge field in:       Appropriate section  1      Correct merge  2        S4: SO8 Fillable Forms  (5)   Appropriate use of at least THREE of:   Option boxes, check boxes, text boxes, date picker,  drop-down lists, and command buttons      3     Layout of form for ease"
  },
  {
    "title": "CSEC Information Technology - Part 161",
    "content": "command buttons      3     Layout of form for ease of use       Layout clear and easy to follow  2      Some aspects of layout not clear or easy to follow  1         CXC 30/G/SYLL 17 38 www.cxc.org  WEB-BASED DESIGN (10 marks)    Specific  Objective  Key Skills  The effectiveness with which the candidate(s) has/have  used or applied  Mark  Allocation  Maximum  marks per  sub-section  S4: SO9  Appropriate design features to create a simple web page  (3)     Inclusion of graphics and text  1"
  },
  {
    "title": "CSEC Information Technology - Part 162",
    "content": "age  (3)     Inclusion of graphics and text  1      Appropriate use of text   1      Appropriate use of graphics    1   S4: SO9  Web page for intended audience   (2)     Layout suitable for intended audience  1      Mostly suitable for intended audience    1   S4: SO12 Consistent Information on the page specific with  requirements   (3)     Majority of information consistent with requirements  3      Somewhat consistent with requirements   2      A few aspects are consistent with require"
  },
  {
    "title": "CSEC Information Technology - Part 163",
    "content": "2      A few aspects are consistent with requirements    1   S4: SO11 Hyperlinks  (2)   The presence of a link for any TWO of the following:   link to another web page;   link to a location within the web page;   link to an email address; and,   link to user-created files.            SPREADSHEET – 20 marks    Specific  Objective  The effectiveness with which candidate(s) use(s) or  manipulate  Mark  Allocation  Maximum  marks per  sub-section  S5: SO3 Pre-defined systems functions  – 1 mar"
  },
  {
    "title": "CSEC Information Technology - Part 164",
    "content": "on  S5: SO3 Pre-defined systems functions  – 1 mark each for correct use  of any THREE functions    (3)     Correct use of any THREE different functions    3   S5: SO4 Arithmetic formulas – 1 mark each for any THREE formulas  (3)     Correct use of any THREE different formulas    3   S5: SO5 Replicate formulas into other cells  (2)     Use of absolute addressing or range names (two  different examples)    2   S5: SO6 Spreadsheet formatting  (4)     Any TWO: Decimal place, currency, comma,  p"
  },
  {
    "title": "CSEC Information Technology - Part 165",
    "content": ")     Any TWO: Decimal place, currency, comma,  percentage features  2      Justified, left, right, centre, font or font size  1      Advanced use such as merging cells, wrap text    1     CXC 30/G/SYLL 17 39 www.cxc.org  Specific  Objective  The effectiveness with which candidate(s) use(s) or  manipulate  Mark  Allocation  Maximum  marks per  sub-section  S5: SO7 Sorting data in the spreadsheet  (1)     Data sorted in ascending/descending order as  required    1   S5: SO7 Extracting data  ("
  },
  {
    "title": "CSEC Information Technology - Part 166",
    "content": "der as  required    1   S5: SO7 Extracting data  (2)     Simple filter in place  1      Evidence of criteria (for example, B3<20)    1   S5:SO7 Pivot Tables  (1)     Use of pivot tables to summarise a large group of  data    1   S5: SO8 Charting operations  (3)     Ability to select required range of adjacent/non- adjacent cell for use in a chart  1      Appropriate chart such as bar/column chart, line  graph, pie chart  1      Appropriate labelling of chart title, chart axes and/or  data"
  },
  {
    "title": "CSEC Information Technology - Part 167",
    "content": "labelling of chart title, chart axes and/or  data labels    1   S5: SO9 Use of two or more sheets  (1)     Linking of cells in different sheets     1       CXC 30/G/SYLL 17 40 www.cxc.org  DATABASE MANAGEMENT – 20 marks    Specific  Objective  The effectiveness with which candidate(s) use(s) or  manipulate features to  Mark  Allocation  Maximum  marks per  sub-section  S6: SO3 Create a database  (5)     Appropriate fieldnames  1      Appropriate data types  1      Populating table  1      C"
  },
  {
    "title": "CSEC Information Technology - Part 168",
    "content": "te data types  1      Populating table  1      Create minimum of two database tables/files   1      Selecting a suitable primary key    1   S6: SO3 Simultaneous use of two or more tables/files  (2)     Joining between pairs of database tables/files    Evidence of relationship (1:1 or 1:M)    1  1    S6: SO4 Create queries   (5)     Simple query (1 criteria)  1      Complex query: >1 criteria (1) using more than  one table (1)   2      Correct use of and result from calculated field  in q"
  },
  {
    "title": "CSEC Information Technology - Part 169",
    "content": "rect use of and result from calculated field  in query    2    Create forms  (2)     Form with sub-form created   Appropriate fields for sub-form    1  1    S6: SO4 Sort a database table/file/Report  (1)     Evidence of sort    1   S6: SO5 Generate reports       Selection of appropriate fields for report  1 (5)     Statistical and/or summary features (for  example, count, sum, average)  1      Grouping required fields  1      Correct specific report title (2)   – Generic report title only"
  },
  {
    "title": "CSEC Information Technology - Part 170",
    "content": "fic report title (2)   – Generic report title only (1)    2            CXC 30/G/SYLL 17 41 www.cxc.org  PROBLEM-SOLVING AND PROGRAMMING (15 marks)    Specific  Objective  The effectiveness with which candidate(s) employed  techniques to create or design  Mark  Allocation  Maximum  marks per  sub-section  S7: SO5 Flowchart or pseudocode  (6)     Start of Algorithm  1      Identifying user-friendly variable names  1      Initialising variables    1    Processing       Request for data (prompt)"
  },
  {
    "title": "CSEC Information Technology - Part 171",
    "content": "1    Processing       Request for data (prompt)  1      Storing data (reading data)        Appropriate and logical use of structures        – Selection   1     – Looping  1   S7: SO7 Trace table  (4)     Variables identified in trace table  1      Appropriate test data  1      Changes in values correctly demonstrated  2     – Some errors in manipulating the trace  table  1   S8: SO2 Program Execution  (1)     Working program    1    Program  language features / working solution  (3)   V"
  },
  {
    "title": "CSEC Information Technology - Part 172",
    "content": "ram  language features / working solution  (3)   Variable initialization  1   S8: SO5 Control structures:       Appropriate use of selection statements (if- then, if-then-else, or case statement)  1      Looping – (while, repeat or for)     1   S8: SO7 Documentation  (1)   Program documentation (such as author, date  created, statement of problem, and suitable inline  comments)  1                                 CXC 30/G/SYLL 17 42 www.cxc.org  PROCEDURES FOR REPORTING AND SUBMITTING SCHOOL-BA"
  },
  {
    "title": "CSEC Information Technology - Part 173",
    "content": "PROCEDURES FOR REPORTING AND SUBMITTING SCHOOL-BASED ASSESSMENT    (a) Teachers are required to record the mark awarded to each candidate under the  appropriate profile dimension on the mark sheet provided by CXC®. The completed mark  sheets should be submitted to CXC® no later than 30 April of the year of the examination.    Note: The school is advised to keep a copy of all projects as well as copies of the mark  sheets.    (b) Teachers will be required to submit to CXC® electronic copies of t"
  },
  {
    "title": "CSEC Information Technology - Part 174",
    "content": "required to submit to CXC® electronic copies of the projects of a sample of  candidates as indicated by CXC®. This sample  will be re-marked by CXC® for moderation  purposes.    Note: The SBA Data Capture Module of the Online Registration System (ORS) must be used  for the submission of ALL SBA marks.      MODERATION OF SCHOOL-BASED ASSESSMENT    The candidate’s performance on the project will be moderated. The standard and range of marks  awarded by the teacher will be adjusted where appropria"
  },
  {
    "title": "CSEC Information Technology - Part 175",
    "content": "ed by the teacher will be adjusted where appropriate. However, the rank order assigned  by the teacher will be adjusted only in special circumstances and then only after consideration  of the data provided by the sample of marked projects submitted by the teacher and re-marked by  CXC®.      EQUIPMENT    The equipment should include an IBM-compatible computer with software that is capable of  integration among word-processing, spreadsheet and database management applications. CXC® will  not be r"
  },
  {
    "title": "CSEC Information Technology - Part 176",
    "content": "abase management applications. CXC® will  not be responsible for partial assignments submitted due to software incompatibility and/or  integration problems.      CXC 30/G/SYLL 17 43 www.cxc.org   RECOMMENDED TEXTS    Birbal, R. and Taylor, M.  Log  On  to  IT  for  CSEC. Essex:  Pearson/Longman,  2005.      Gay, G. and Blades, R.  Information   Technology   for   CXC   CSEC.   Oxford:   University Press, 2005.      Holligan, J. and Doyle, S.  IT FOR CSEC. Cheltenham: Nelson Thornes, 2006."
  },
  {
    "title": "CSEC Information Technology - Part 177",
    "content": "FOR CSEC. Cheltenham: Nelson Thornes, 2006.      Jamrich, P.   and Oja, D.    New   Perspectives   on   Computer   Concepts, 10th  edition. Course    Technology.    Washington    D.C.   Thomson Publishing, 2007.      Robertson, L.  Simple Program Design – A Step by Step Approach.  Course Technology, Washington D.C., 2006      Skeete, K.  CXC Information Technology. Cambridge:   University Press, 2004      WEBSITES    http://www.gcflearnfree.org/subjects/technology/    http://www.excel-easy.com/"
  },
  {
    "title": "CSEC Information Technology - Part 178",
    "content": "subjects/technology/    http://www.excel-easy.com/vba.html     https://support.office.com/en-us/article/Create-a-fillable-form-39a58412-107e-426b-a10b- ac44937e3a9f    http://bigdata-madesimple.com/5-advantages-and-disadvantages-of-cloud-storage/    https://www.saylor.org/site/textbooks/Information%20Systems%20for%20Business%20and%20Bey ond.pdf                                      CXC 30/G/SYLL 17 44 www.cxc.org   GLOSSARY OF INFORMATION TECHNOLOGY CONCEPTS    WORD  DEFINITION      Address  The"
  },
  {
    "title": "CSEC Information Technology - Part 179",
    "content": "OGY CONCEPTS    WORD  DEFINITION      Address  The identification of a particular location in memory where a data  item or instruction is stored.      Algorithm  A  sequence  of  instructions  which  rigorously  defines  a  solution   to  a problem.      Assembler  A program which converts ASSEMBLY LANGUAGE into MACHINE  CODE to be used by a computer.      Automation  Computer control of machines and processes.      Bandwidth  A characteristic of a communication channel that determines the  spee"
  },
  {
    "title": "CSEC Information Technology - Part 180",
    "content": "a communication channel that determines the  speed at which data can be transmitted over the channel.      Bar code  A  series  of  thick  and  thin  black  bars  separated  by  spaces  of   varying widths representing data.      Bistable device  A device which can exist in two discrete stable states.      Bit  An acronym for binary digit.  It can have a value of 1 or 0.      Blog  Short for \"Web log\". A blog is an online journal or diary of an  individual’s opinions and latest news. It is upda"
  },
  {
    "title": "CSEC Information Technology - Part 181",
    "content": "individual’s opinions and latest news. It is updated regularly, in  chronological order. Many blogs allow visitors to make comments,  or “postings” in response to the blogger, or to ask questions.      Broadband  A term used to describe a technology that provides bandwidth that  is  greater  than  that  provided  by  ordinary  telephone  lines,  that  is,  greater than 64 kilobits per second.  The greater the bandwidth, the  greater the data-carrying capacity.      Broadcast      The transmissi"
  },
  {
    "title": "CSEC Information Technology - Part 182",
    "content": "rying capacity.      Broadcast      The transmission of data to all connected stations simultaneously.      Byte  A group of eight bits, usually representing a single character.      CADD  Acronym for computer-aided design/drafting. The use of computers  and graphics in design and drafting process.      CAM  Acronym for computer-aided manufacturing.   The use of computers  to control machines in the manufacturing process.      Character  One of the set of symbols that may be represented in a com"
  },
  {
    "title": "CSEC Information Technology - Part 183",
    "content": "he set of symbols that may be represented in a computer.  Characters may be letters, digits, symbols.      Character codes    Binary patterns used to represent characters in a computer system.          CXC 30/G/SYLL 17 45 www.cxc.org  WORD  DEFINITION      Cloud Computing  The  use  of  a  network  of  remote  servers  hosted  on  the  Internet  to  store,  manage,  and  process  data,  rather  than  a  local  server  or  a  personal computer.      Cloud Storage  A cloud computing model in which"
  },
  {
    "title": "CSEC Information Technology - Part 184",
    "content": "Cloud Storage  A cloud computing model in which data is stored on remote servers  and can   only   be   accessed   via   the   Internet,   or   \"cloud.\"   It   is  maintained, operated  and  managed  by  a  cloud  storage  service  provider.      Compiler    A  program  that translates  the  source  program  into  executable  machine code, and saves the code to a file (the object program) for  later execution.      CPU  Central Processing Unit      Data corruption  The introduction of errors"
  },
  {
    "title": "CSEC Information Technology - Part 185",
    "content": "Data corruption  The introduction of errors into data stored in a computer system.      Database    A  collection  of  data  files  that  may   be   used  by  a  number  of  applications with storage and access to the data controlled by a set  of programs known as Database Management System (DBMS).      Database  management  system      Programs  and  database files  that  allow  timely  and  easy  controlled  access to data by a number of users.      Download    Process     whereby progra"
  },
  {
    "title": "CSEC Information Technology - Part 186",
    "content": "users.      Download    Process     whereby programs or     data are transferred     via   communications channels from a computer and stored on media  located at the user’s computer.      Dry-run  A manual traversal of the logic of a program.    DVD         Digital Video Disk or Digital Versatile Disk. A  high-density  compact   disk  for storing large amounts of data, especially high-resolution  audio-visual material.      Electronic mail     Mail   or    messages    transmitted    electronica"
  },
  {
    "title": "CSEC Information Technology - Part 187",
    "content": "ail   or    messages    transmitted    electronically    by    computers     via communication channels. It is usual for such messages to be  held in a central store for retrieval at the user’s convenience.      Ergonomics     A field of study dealing with the comfort and safety of the human  body   by   adjusting   different   designs   in   equipment,   furniture,  workstations and routines to fit the worker. (Ergonomics is used in  the workplace to help prevent repetitive injuries.)    Expert"
  },
  {
    "title": "CSEC Information Technology - Part 188",
    "content": "ce to help prevent repetitive injuries.)    Expert system                A software package that acts as a consultant or expert to the  user.    It is an “expert” in a specialised application or area and  provides assistance to the user in solving problems in that area.        Field  A  component  of  a  record  designed  to  hold  a  single  data  item of  a  specified type.     CXC 30/G/SYLL 17 46 www.cxc.org  WORD  DEFINITION      Flowchart         A  graphical  representation  of  an  algori"
  },
  {
    "title": "CSEC Information Technology - Part 189",
    "content": "A  graphical  representation  of  an  algorithm,  comprising  various  symbols connected by arrows to show the step-by-step flow of data  through a process.     Font  A family or collection of characters (letters, punctuation marks,  numbers and special characters) of a particular size and style.      Gigabyte  The equivalent of approximately one billion bytes.      Hard disk                        A rigid disk used for storing data magnetically. Its rigid construction  allows for higher s"
  },
  {
    "title": "CSEC Information Technology - Part 190",
    "content": "cally. Its rigid construction  allows for higher storage densities. Access times for a hard disk are  much faster than for floppy disks.      Hardware  The  physical  components  of  a  computer    system    such    as    the   Central Processing Unit (CPU), memory, input, output,  and storage  devices.      Home page  The  file  available  for  access  at  a  website  intended  chiefly  to  greet  visitors, provide information about the site, and direct them to other  sites with related informa"
  },
  {
    "title": "CSEC Information Technology - Part 191",
    "content": "d direct them to other  sites with related information.      HTML        Hypertext Markup Language.   A markup language used to structure  text and multimedia documents used extensively on the World Wide  Web.      HTTP            Hypertext Transfer Protocol. A protocol used to request and transmit  files,  especially  Web  pages  and  Web  page  components,  over  the  Internet or other computer network.      Information  Meaningful knowledge produced from raw data files.      Information  retr"
  },
  {
    "title": "CSEC Information Technology - Part 192",
    "content": "oduced from raw data files.      Information  retrieval   The process of retrieving specific information from data files.        Information  Technology     Information   technology   (IT)   is   the   use   of   computers, storage,  communication and other physical devices to create, process, store  and exchange all forms of electronic data.      Integrated package         This package combines  several applications in a suite of programs.    Most of these packages combine a word processor; spr"
  },
  {
    "title": "CSEC Information Technology - Part 193",
    "content": "st of these packages combine a word processor; spreadsheet and  database program.  Data are shared easily between these integrated  programs.      Internet     The Internet is the largest computer network system in the world.   It  consists of many smaller networks connected together by a global  public network. The Internet is often called the information  superhighway or cyberspace.        CXC 30/G/SYLL 17 47 www.cxc.org  WORD  DEFINITION      Intranet      An intranet is a private network tha"
  },
  {
    "title": "CSEC Information Technology - Part 194",
    "content": "Intranet      An intranet is a private network that belongs to an organization, and  is  designed  to  be  accessible  only  by  the organization’s members,  employees, or others with authorization. When part of an intranet is  made accessible to customers, partners, suppliers, or others outside  the company, that part is called an extranet.      Interpreter    A computer program which interactively translates and executes a  source program without permanently storing any executable code.      J"
  },
  {
    "title": "CSEC Information Technology - Part 195",
    "content": "ut permanently storing any executable code.      Joystick     An input device that uses a lever to control movement of the cursor  or graphic images.      Justification  This is the adjustment of alignment of one or more lines of text with  a particular margin, for example, alignment with the left margin, the  right margin or both. The term justification often is used to refer to  full justification of the alignment of text along both margins.      Keyboarding  The process of rapidly and accurat"
  },
  {
    "title": "CSEC Information Technology - Part 196",
    "content": "Keyboarding  The process of rapidly and accurately entering data into a computer  via the keyboard as an input device.      Kilobyte  One thousand and twenty-four bytes.      LAN     Acronym for Local Area Network. A type of computer network  where two or more computers are directly linked within a small  area such as a room or building site. A common characteristic of  this system is that computers are linked by direct cables rather  than by telecommunication lines.      Light pen  A  light-"
  },
  {
    "title": "CSEC Information Technology - Part 197",
    "content": "telecommunication lines.      Light pen  A  light-sensitive  input  device  which  when  it touches  the  screen  detects the presence or absence of light. It is used to select an entry  or indicate a position.      Magnetic disk  A mylar (floppy disk) or metallic (hard disk) circular plate on which  electronic  data  can  be  stored  magnetically. Suitable  for  direct  or  random access data storage and retrieval.      Mail-merge           A facility found in full-fledged word-processing progr"
  },
  {
    "title": "CSEC Information Technology - Part 198",
    "content": "cility found in full-fledged word-processing programs that draws  information from  a database, usually a mailing list, to print  multiple copies of a document. Each copy contains some common  text but each bearing different addresses.      Mainframe  A large-scale computer with a variety of peripheral devices, a large  amount  of backing store and a fast CPU. The term is often used in  comparison  with  a  smaller  or subordinate  computer.  It  should  be  noted that there  is no clear dividin"
  },
  {
    "title": "CSEC Information Technology - Part 199",
    "content": "should  be  noted that there  is no clear dividing line  between mainframes and  minicomputers.      Margins  Space provided to the left, right, top and/or bottom of a page of text  or data.    CXC 30/G/SYLL 17 48 www.cxc.org  WORD  DEFINITION      Menu    A screen listing commands of action or alternatives to lead the user  through an interactive program.    Menu-driven  Interface   A  Program  interface  where  the  user  is  provided  with  a  list  of  operations.      Merge  The combinatio"
  },
  {
    "title": "CSEC Information Technology - Part 200",
    "content": "list  of  operations.      Merge  The combination of two or more files on the basis of common field  (key field).      MICR  Magnetic Ink Character Recognition.      MIDI        Musical  Instrument Digital  Interface.  A  standard  for  representing  musical information in a digital format.      Microcomputer    A   computer   based   on   a   microprocessor.   See   definition   of  microprocessor below.      Microfiche  An output medium consisting of microfilm sheets.  Very high density  sto"
  },
  {
    "title": "CSEC Information Technology - Part 201",
    "content": "sting of microfilm sheets.  Very high density  storage can be attained using this method of storage.      Microprocessor  A single  chip  which  contains  the  arithmetic/logic  unit  (ALU)  and   the control unit (CU).      Modem  Acronym for modulator-demodulator.   A device that converts  signals from analogue to digital and vice versa. A modem allows  computers  to exchange information through telephones lines.      Monitor  A television-like device used to display data.      Mouse  An input"
  },
  {
    "title": "CSEC Information Technology - Part 202",
    "content": "device used to display data.      Mouse  An input device that controls the movement of the cursor.                             The cursor moves in response to the movement of the mouse on a  flat surface.    Multiprocessing  The   ability   of   a   computer   to   execute   programs   on   two or    more   processors simultaneously. The program is distributed over  several processors.      Multitasking  The concurrent execution (at the same time) of two or more related  tasks.  A  group  of  c"
  },
  {
    "title": "CSEC Information Technology - Part 203",
    "content": "e) of two or more related  tasks.  A  group  of  cooperating  tasks  is  executed simultaneously  to  achieve a common goal.      Narrowband  A term used to describe a technology that provides bandwidth that  is  less  than  or  equal  to  that  provided  by  ordinary  telephone  lines.  That is, 64 kilobits per second or less.      Online  The term is used to describe peripheral devices under the control of  the processor.      Off-line  Describes peripheral devices that operate independently a"
  },
  {
    "title": "CSEC Information Technology - Part 204",
    "content": "es peripheral devices that operate independently and are  not under the control of the processor.    CXC 30/G/SYLL 17 49 www.cxc.org  WORD  DEFINITION      Operating system        A set of programs that control and supervise the resources of a  computer system.  It also acts as an interface between the user and  the computer.      Peripheral  Any   hardware   device   connected   to   and   controlled   by   the    central processing unit.      Plotter  An output device specially designed to pro"
  },
  {
    "title": "CSEC Information Technology - Part 205",
    "content": "lotter  An output device specially designed to produce a hard copy of  graphical data.      Point of sale  terminal   A device that reads data at the source of a transaction (for  example. a supermarket checkout) and stores it for subsequent  transmission directly to the computer system for processing.      Primary Memory  Random Access Memory and Read Only Memory.    Printer  A device specially designed to produce a hard copy of computer  output.      Protocol          A set of rules and proced"
  },
  {
    "title": "CSEC Information Technology - Part 206",
    "content": ".      Protocol          A set of rules and procedures controlling the transmitting and  receiving of data so that different devices can communicate with  each other.      Pseudocode  A      language      consisting     of      English-like      statements      used      to    define algorithm.    Real-time  A processing  mode  in  which  the  passage  of  real-time  is  critical   to  the application.      Record  A collection of fields on data related to one entity.      Resolution  A characte"
  },
  {
    "title": "CSEC Information Technology - Part 207",
    "content": "related to one entity.      Resolution  A characteristic of a monitor’s screen, determined by the number  of  pixels that can be displayed by it.      Software      A collection of programs, procedures and routines which direct the  operations of a computer.      Software package         A   fully   documented   program   or   set   of   programs   generalized    and designed to be used with little or no modification.      Sort    Redistribution of data into an order on the basis of the contents"
  },
  {
    "title": "CSEC Information Technology - Part 208",
    "content": "of data into an order on the basis of the contents of a  key item (sort-key).      Source code  Program written in high level language or assembly level language.      Source document  A document used for the initial recording of data relating to business  transactions.  Very  often  source  data  needs  to  be  converted  into  machine-readable form for example, punched cards or paper tape,  before it can be processed by a computer.         CXC 30/G/SYLL 17 50 www.cxc.org  WORD  DEFINITION"
  },
  {
    "title": "CSEC Information Technology - Part 209",
    "content": "30/G/SYLL 17 50 www.cxc.org  WORD  DEFINITION      Spell-check                          A dictionary feature associated with a word processor which  allows the user to easily detect and correct errors in spelling. One   can  add  new words to the dictionary so that the latter may grow  with usage, for example, in WordPerfect, WordStar and Microsoft  Word.      Syntax  A   set   of   rules   defining   the   structure   of   statements      in      a   programming language.       Telecommunicatio"
  },
  {
    "title": "CSEC Information Technology - Part 210",
    "content": "a   programming language.       Telecommunication     The    process    of    transmitting    data    between    devices    using  transmission facilities such as telephone lines or microwave links.    TCP/IP        (Transmission Control Protocol/Internet Protocol)   These are a set of  rules  and  regulations  followed  by  computers  on  the  Internet  to  communicate.    Telecommuting     A method of working where an offsite employee uses computer and  a communication channel to communicate"
  },
  {
    "title": "CSEC Information Technology - Part 211",
    "content": "mputer and  a communication channel to communicate with the office computer.      Telemarketing  The employment of telephone lines and computers to market  products and manage accounts.      Touch terminal           Also called a touch screen.  A device that allows data to be input by  touching a screen with the finger or other object. The  surface  of   the screen consists of a number of programmed touch points each  of which may trigger a different action when selected by the user.      Turnar"
  },
  {
    "title": "CSEC Information Technology - Part 212",
    "content": "rent action when selected by the user.      Turnaround  document   A document which, after being output by the computer, can be  used to record data.      Upload  Process of reading data from a user’s computer storage and sending  it to another computer via communication channels.      URL  Each page on the World Wide Web has a unique address called the  Uniform Resource Locator (URL).      Validation  A checking process in a program which is aimed at finding out if data  is  genuine.  Validatio"
  },
  {
    "title": "CSEC Information Technology - Part 213",
    "content": "ed at finding out if data  is  genuine.  Validation  should  be  carried  out  on  any  data  that  is  entered  from  the  keyboard,  even  when  this  is  simply  a  Y  or  N  response.      Variable     An area of storage whose value can change during processing.  Verification       Specific  checks  that  ensure  that  the  data  entered  matches  (or  is  identical to) the data at the original source.  VoIP  Acronym  for  Voice  over  Internet  Protocol.  It  is a  protocol  which  governs"
  },
  {
    "title": "CSEC Information Technology - Part 214",
    "content": "et  Protocol.  It  is a  protocol  which  governs  the  transmission  of  voice  over  the  Internet.  VoIP  is  often  used  abstractly  to  refer  to  the  actual  transmission  of  voice  (rather  than  the  protocol  implementing  it).  VoIP   is  also  known  as   IP  Telephony.    CXC 30/G/SYLL 17 51 www.cxc.org  WORD  DEFINITION      Web browser                        A programme that allows users to view and explore information on  the  World  Wide Web.  Examples  of  popular  browsers"
  },
  {
    "title": "CSEC Information Technology - Part 215",
    "content": "orld  Wide Web.  Examples  of  popular  browsers  are Microsoft  Internet Explorer and Mozilla Firefox.    Web page                A document on the World Wide Web, consisting of an HTML  file and any related files for scripts and graphics.  It  is often  hyperlinked to other Web pages.      Web server     A computer that delivers (serves up) Web pages.  When a request is  made to access a website, the request is sent to the web server. The  server then fetches the page and sends it to your brow"
  },
  {
    "title": "CSEC Information Technology - Part 216",
    "content": "er then fetches the page and sends it to your browser.      Website  A set of interconnected Web pages, usually including a home page,  generally located on the same server, and prepared and maintained  as a collection of information by a person, group, or organization.      World   Wide   Web  (WWW)   The World Wide Web commonly referred to as the ‘Web’, is a  graphical easy-to-use system of inter-linked files on the Internet.   Vast amounts of information can be obtained through the use of the"
  },
  {
    "title": "CSEC Information Technology - Part 217",
    "content": "information can be obtained through the use of the  www.                           CXC 30/G/SYLL 17 52 www.cxc.org   GLOSSARY OF BEHAVIOURAL VERBS USED IN THE INFORMATION  TECHNOLOGY EXAMINATIONS    Analyse Examine key factors and constituent parts critically and in detail and  suggest possible results/outcomes.    Assess Present  possible  explanations  or  reasons  for  the importance  of  a  particular  structure,  relationship  or  process  and  say  what  would  be  the appropriate explana"
  },
  {
    "title": "CSEC Information Technology - Part 218",
    "content": "and  say  what  would  be  the appropriate explanation.    Classify Place into groups according to observable characteristics, attributes,  features or qualities.    Compare/Contrast Identify  and  describe/examine  similarities  and  differences  between  two elements/concepts/entities of the same or different kinds.      Define Provide a brief statement giving the precise meaning of or outlining  the nature,  properties or essential qualities of a term, concept, and  principle.    Describe Pro"
  },
  {
    "title": "CSEC Information Technology - Part 219",
    "content": "f a term, concept, and  principle.    Describe Provide statements of the features or characteristics of an object or  process.    Differentiate/Distinguish Provide  an  explanation  of  the  differences  between  entities  which  allow them to be placed in distinct groups.     Discuss Give a careful explanation of a concept or statement by providing a  definition and explaining the arguments for or against it.     Evaluate Explain the evidence for or against a given topic or concept and come  to"
  },
  {
    "title": "CSEC Information Technology - Part 220",
    "content": "r or against a given topic or concept and come  to a conclusion.      Explain Provide   detailed,   logical   statements   which   make   clear   what  happened, how it happened and why it happened.    Identify Point   out   or   describe   distinguishing   features   (without   giving  explanation).     Illustrate Show clearly by using appropriate examples, diagrams or sketches.    Label   Identify structures or parts with the use of pointers.     List   Itemize answers concisely and in order i"
  },
  {
    "title": "CSEC Information Technology - Part 221",
    "content": "List   Itemize answers concisely and in order if specified.    Manipulate    To use, modify or update original data, values or items.    Name   Provide accurate labels, words or statements.           CXC 30/G/SYLL 17 53 www.cxc.org  Outline Give  basic  steps, organize information  concisely  to  provide  main  points or features only.    Plan Provide   an  outline   of   steps   to   be   followed   or  the   scheme   of  arrangements.    State   Provide a short concise answer without explan"
  },
  {
    "title": "CSEC Information Technology - Part 222",
    "content": "te   Provide a short concise answer without explanation.                                 CXC 30/G/SYLL 17 54 www.cxc.org  APPENDIX    SAMPLE SCHOOL-BASED ASSESSMENT    Description of the Project  National  general  elections  have  been  a  recurring  feature  among  the  democratic  territories  of  the  Caribbean. Every year, in one territory or another, citizens exercise their right to elect a government  of their choice. However, the  exercise  is not without its attendant challenges of data"
  },
  {
    "title": "CSEC Information Technology - Part 223",
    "content": "e  is not without its attendant challenges of data management.  Thousands of votes are cast on the day of the elections and an anxious, waiting public demands speed,  efficiency and accuracy in the determination of results.    In preparation for the actual exercise, the Trinbarjam Elections Commission has hired you to simulate  the elections exercise as a test run, prior to the actual elections which are to take place shortly in your  country. You are required to utilize suitable word-processing"
  },
  {
    "title": "CSEC Information Technology - Part 224",
    "content": "u are required to utilize suitable word-processing, web page design, spreadsheet, database  management  as  well  as  a  programming  application  to  design  and  implement  computer-based  solutions to the tasks involved in the simulation of the election process.    Spreadsheet  The Elections Commission has mandated that you design a spreadsheet that will accept pertinent data  on constituencies and candidates’ votes and generate information that would enable the outcome of  the elections to b"
  },
  {
    "title": "CSEC Information Technology - Part 225",
    "content": "at would enable the outcome of  the elections to be divulged to the population in the shortest possible time. Four parties contest the  elections:  The  Democratic  Action  Party  (DAP),  the  Workers  National  Alliance  (WNA),  the  United  Progressive Movement (UPM),  and the People’s Democratic Revolution (PDR). The spreadsheet is  design to accept data from seven constituencies.    You are required to:     Task 1    1.  (a)  Design a spreadsheet with the below table in sheet 1.  Constituenc"
  },
  {
    "title": "CSEC Information Technology - Part 226",
    "content": "heet with the below table in sheet 1.  Constituency Percentage Voter Turnout  North 0.75  South 0.85  East 0.90  West 0.80  North West  0.75  South West 0.88  East Central 0.82    (b)  Using another worksheet design a table to record the:   Constituency   Number of voters (The number of voters in a constituency ranges from 6,250 to  10,795.)   Votes Cast   Candidate’s name    Candidate rating (The rating assigned to candidates are 15, 20, 30 and 35. These  ratings  were  determined  by  the"
  },
  {
    "title": "CSEC Information Technology - Part 227",
    "content": "and 35. These  ratings  were  determined  by  the  results  of  a  recent  poll  conducted  in  each    CXC 30/G/SYLL 17 55 www.cxc.org  constituency by a noted pollster.  Each candidate in a given constituency has a  unique rating.)   Party name    You must enter data for each candidate in each of the seven constituencies. Use the Percentage Voter  Turnout data to determine the number of votes cast (number of voters * percentage voter turnout).     Rename the worksheet as Elections Data  Save"
  },
  {
    "title": "CSEC Information Technology - Part 228",
    "content": ".     Rename the worksheet as Elections Data  Save your spreadsheet as Elections    Task 2    Duplicate the Elections Data worksheet. Rename the duplicate as Elections Data Backup.    Modify the Elections Data worksheet as follows:    1. (Insert  a  column  before  the  one  which  displays  the  name  of  the  political  party.  Using  an  appropriate  column  title,  determine  the  votes  received  by  each  candidate  in  a  given  constituency. The candidate’s rating represents the percenta"
  },
  {
    "title": "CSEC Information Technology - Part 229",
    "content": "cy. The candidate’s rating represents the percentage of votes received by the  candidate  in  a  given  constituency.  For  example,  given  that  6400  votes  were  cast  and  a  candidate has a rating of 20, the votes received by the candidate would be 20/100*6400.    Format the votes received by each candidate to zero decimal places.     2. Sort  the  data  first  on  party  (ascending  order)  and  secondly  on  votes  received  (descending  order).     3. The Trinbarjam Elections Commission"
  },
  {
    "title": "CSEC Information Technology - Part 230",
    "content": "order).     3. The Trinbarjam Elections Commission needs to determine the following:   Whether or not a refund is due to a candidate.  Use an appropriately labelled column to  state “Refund Due” or “No Refund” for each candidate. A refund is due if the candidate’s  votes received equals or exceeds 20 per cent of the votes cast in the constituency.   A list of all candidates who should receive a refund.  Extract the data to the bottom of the  worksheet.   A table with summary data for the elec"
  },
  {
    "title": "CSEC Information Technology - Part 231",
    "content": "rksheet.   A table with summary data for the elections      Elections Data     Party Total Votes Received Percentage of Votes  Cast                       Total Votes Cast     Constituency No. of Voters Votes Cast Abstention                  CXC 30/G/SYLL 17 56 www.cxc.org  Note the following:   Format the Percentage of Votes Cast to one decimal place with the percent symbol.    Centre the data in the worksheet.   Merge and centre the cells in the row with the label “Elections Data”    Charti"
  },
  {
    "title": "CSEC Information Technology - Part 232",
    "content": "the row with the label “Elections Data”    Charting and Summary Operations  Generate a column graph that compares the votes cast and abstention data by constituency. Provide  an appropriate title, label the axes and display the data labels.    Create a pivot table showing the constituencies, the candidates’ names and the total number of votes  the candidates received.     Save your spreadsheet as Elections    Database Management  You are asked to use a suitable application to manage data on can"
  },
  {
    "title": "CSEC Information Technology - Part 233",
    "content": "o use a suitable application to manage data on candidates nominated to contest seats  in the general elections. Three tables must be used to store the data.  The table with relevant personal  data on each candidate should include: name, address, date of birth, gender, profession, constituency,  constituency  number,  party  and  votes  received.    The  constituency  data  table  should  include:  the  constituency name, constituency number and the number of voters in each constituency.  An elec"
  },
  {
    "title": "CSEC Information Technology - Part 234",
    "content": "he number of voters in each constituency.  An elections  data  table  should  include:  the  constituency  number  and  the  percentage  voter  turnout  for  each  constituency.     The data to populate the tables must be sourced from the spreadsheet section of your project.    You should test your database by generating queries, reports and control forms:     Queries:    1. List the name, sex, age and profession of all candidates from the People’s Democratic  Revolution (PDR).    2. List  the"
  },
  {
    "title": "CSEC Information Technology - Part 235",
    "content": "’s Democratic  Revolution (PDR).    2. List  the  candidate  name,  party,  number  of  voters  and  number  of  votes  received  for  candidates in constituencies with more than 6500 voters and where the candidates received  less than 1000 of the votes. Sort the data in descending order on the number of votes received  by the candidate.      3. Using a calculated field determine the total votes cast in each constituency.    Report  4. Generate a report which lists the constituency, number of vo"
  },
  {
    "title": "CSEC Information Technology - Part 236",
    "content": "report which lists the constituency, number of voters in the constituency, name of  candidates,  gender,  party  and  number  of  votes  received.  The  report  should  be  grouped  by  constituency. Within  each constituency  the  report  should be  sorted  in  descending  order  by  number of votes received by each candidate. It should also give the total and average number  of votes in each constituency. The report should have a two-line title as follows:    “Official Results  Trinbarjam Nat"
  },
  {
    "title": "CSEC Information Technology - Part 237",
    "content": "e as follows:    “Official Results  Trinbarjam National Elections”      CXC 30/G/SYLL 17 57 www.cxc.org  Control Forms  5. Create a form to display information about the candidates.        Word-processing    Document 1  1. Each  candidate  must  complete  and  submit  a  nomination  form  to  the  Trinbarjam  Elections  Commission. You are required to:     (a) Design a fillable nomination form. It must allow for the entry of relevant data on the  candidate, including the constituency which he/sh"
  },
  {
    "title": "CSEC Information Technology - Part 238",
    "content": "candidate, including the constituency which he/she intends to contest.     (i) The letter head (with company Logo) of the Trinbarjam Elections Commission  should be placed at the top.    Document 2  2. The  results  of  the  national  elections  must  be  delivered  to  each  candidate.  Using  a  suitable  feature of your word processing application:     (a) Create a document which should be mailed to the candidates. The requirements for  the letter are:    (i) It must be design on letter size"
  },
  {
    "title": "CSEC Information Technology - Part 239",
    "content": "etter are:    (i) It must be design on letter sized paper and must have a 0.7” margin on the  left and right sides.    (ii) The commission’s letterhead (with company Logo) should be placed as the  header  in  the  letter.  The  font  in  the  letterhead  should  be  appropriately  formatted for emphasis.   (iii) Candidate’s address.  (iv) Salutation.  (v) The  first  paragraph  should  congratulate  and  thank  the  candidates  (insert  candidate’s name in the letter) for the manner in which he/"
  },
  {
    "title": "CSEC Information Technology - Part 240",
    "content": "’s name in the letter) for the manner in which he/she conducts his  or her campaign.  (vi) A summary table of results should be included with at least seven rows and  three columns, with appropriate formats.   (vii) The  third  paragraph  inviting  him/her  to  view  the  complete  listing  of  the  results on the commission’s website and conclude the letter.   (viii) Close with your name, your position is Chief Electoral Officer.    Web Page Design  The Trinbarjam Elections Commission has reque"
  },
  {
    "title": "CSEC Information Technology - Part 241",
    "content": "ign  The Trinbarjam Elections Commission has requested that you design a web page to provide the public  with general information about the election. The web page should include the following:   The commission’s logo   Display information about the elections (for example the total votes received by each party  and the number of votes cast in each constituency).    Links to the commission’s email address and a web page  which  displays  past  election  data  results (this web page may or may n"
  },
  {
    "title": "CSEC Information Technology - Part 242",
    "content": "lection  data  results (this web page may or may not exist).    CXC 30/G/SYLL 17 58 www.cxc.org  Data used in the web page should be sourced from the spreadsheet section of the project.    Problem-Solving    1. Develop an algorithm to print the names of the candidates who should receive a refund.  A  refund is due if the candidate’s votes received equals or exceeds 20 per cent of the votes cast  in the constituency. The algorithm should also determine and print the number of candidates  who rece"
  },
  {
    "title": "CSEC Information Technology - Part 243",
    "content": "rmine and print the number of candidates  who received a refund. Test the algorithm with data from ten candidates. The algorithm must  accept  as  input  the  names  of  the  candidates,  votes  received  and  the  votes  cast  in  the  constituency.  The algorithm should print the name of the candidate and the words “Refund  Due” or “No Refund” and the number of candidates who received a refund.  Data to test the  algorithm must be sourced from the spreadsheet section of the project.    2. Desi"
  },
  {
    "title": "CSEC Information Technology - Part 244",
    "content": "the spreadsheet section of the project.    2. Design and execute a trace table to test the algorithm developed in question (1) above. The  table should have a maximum of ten iterations.    Program Implementation    1. (a)   Develop a problem statement for the algorithm developed in question (1) above.    (b)    Using the programming language Pascal or VBA, write code to implement/automate     the algorithm in question (1) above.                                  Western Zone Office  9 August 2018"
  },
  {
    "title": "CSEC Information Technology - Part 245",
    "content": "Western Zone Office  9 August 2018                          CARIBBEAN EXAMINATIONS COUNCIL        Caribbean Secondary Education Certificate ®  CSEC ®             INFORMATION TECHNOLOGY          Specimen Papers and  Mark Schemes/Keys             Specimen Paper: - Paper 01     Paper 02     Paper 032                   Mark Scheme and Key: - Paper 01     Paper 02     Paper 032                  C A R I B B E A N      E X A M I N A T I O N S      C O U N C I L    CARIBBEAN SECONDARY ED"
  },
  {
    "title": "CSEC Information Technology - Part 246",
    "content": "O N S      C O U N C I L    CARIBBEAN SECONDARY EDUCATION CERTIFICATE ®   EXAMINATION        INFORMATION TECHNOLOGY  TABLE OF SPECIFICATIONS    SPECIMEN PAPER 2017                 PAPER SECTION PROFILE COGNITIVE  LEVEL  NUMBER  OF  ITEMS  TOTAL  ITEMS PER  SECTION  Paper  01  (30%)    1. Theory       Theory     Productivity  Tools      Problem  Solving and  Programming      Knowledge and  Comprehension    Use of  Knowledge          40      20      35    2. Productivity  Tools      15    3. Probl"
  },
  {
    "title": "CSEC Information Technology - Part 247",
    "content": "35    2. Productivity  Tools      15    3. Problem  Solving   and  Programming      10        TOTAL no.  of ITEMS  60 60            PAPER QUESTION PROFILE COGNITIVE LEVEL NUMBER  OF  MARKS  TOTAL  MARKS PER  SECTION  Paper  02  (45%)    1.   Theory     Productivity Tools      Knowledge and  Comprehension    Use of Knowledge  8      12    20    2.   Theory    Productivity Tools      Knowledge and  Comprehension    Use of Knowledge  8      12    20  3.  Theory     Productivity Tools     Problem"
  },
  {
    "title": "CSEC Information Technology - Part 248",
    "content": "20  3.  Theory     Productivity Tools     Problem Solving and  Programming     Knowledge and  Comprehension        Use of Knowledge  10          15          25  4.   Theory         Problem Solving and  Programming   Knowledge and  Comprehension      Use of Knowledge  10        15          25        TOTAL no. of  Marks  90 90  PAPER       QUESTION  PROFILE  COGNITIVE  LEVEL  NUMBER  OF  MARKS  TOTAL  MARKS PER  SECTION  Paper  032  (25%)    1. Word Processing    Productivity  Tools   (Practical"
  },
  {
    "title": "CSEC Information Technology - Part 249",
    "content": "d Processing    Productivity  Tools   (Practical  skills)  10  10    2. Spreadsheet    Productivity  Tools  (Practical  skills)  10 10  3. Database  Management  Productivity  Tools   (Practical  skills)  10 10  4. Web page Design Productivity  Tools  (Practical  skills)  5 5  5. Problem solving  and programming  Problem   solving  and programming   Use of  Knowledge      15 15        TOTAL no.  of MARKS  50 50          TEST  CODE 01229010 SPEC 2017/01229010"
  },
  {
    "title": "CSEC Information Technology - Part 250",
    "content": "17/01229010                                                                          C A R I B B E A N   E X A M I N A T I O N S   C O U N C I L CARIBBEAN  SECONDARY  EDUCATION  CERTIFICATE ® EXAMINATION INFORMATION TECHNOLOGY  Paper 01 – General Proficiency 1 hour 15 minutes"
  },
  {
    "title": "CSEC Information Technology - Part 251",
    "content": "READ THE FOLLOWING INSTRUCTIONS CAREFULLY. CANDIDATE – PLEASE NOTE! PRINT your name on the line below and return  this booklet with the answer sheet.  Failure to do  so may result in dis"
  },
  {
    "title": "CSEC Information Technology - Part 252",
    "content": "answer sheet.  Failure to do  so may result in disqualification. 1. This test consists of 60 items.  You will have 1 hour and 15 minutes to answer them. 2. In addition to this test booklet, you should have an answer sheet. 3. Each item in this test has four suggested answers lettered (A), (B), (C), (D).  Read each item  you are about to answer and decide which choice is best. 4.\t    On\tyour\t   answer\tsheet,\tfind\t   the\t  number\twhich\tcorresponds\tto\t your\t   item\t   and\t   shade\tthe\t  space\t havi"
  },
  {
    "title": "CSEC Information Technology - Part 253",
    "content": "to\t your\t   item\t   and\t   shade\tthe\t  space\t having\tthe\tsame\tletter\tas\tthe\tanswer\tyou\thave\tchosen.\t\tLook\tat\tthe\tsample\titem\tbelow.  Sample\tItem  Which\tof\tthe\tfollowing\tpairs\trepresents\tgeneral-purpose\tsoftware\ttools?  (A)\t   Spreadsheet\tand\tdatabase\tsoftware\t\tSample\tAnswer \t(B)\t   Word\tprocessor\tand\taccounting\tsoftware  (C) Student record system and database software    A     B     C     D \t(D)\t   Insurance\tprocessing\tand\tspreadsheet\tsoftware  The\tbest\tanswer\tto\tthis\titem\tis\t“Spreadsheet\tand\tda"
  },
  {
    "title": "CSEC Information Technology - Part 254",
    "content": "he\tbest\tanswer\tto\tthis\titem\tis\t“Spreadsheet\tand\tdatabase\tsoftware”,\tso\t(A)\thas\tbeen\tshaded. 5.\t    If\tyou\twant\tto\tchange\tyour\tanswer,\terase\tit\tcompletely\tbefore\tyou\tfill\tin\tyour\tnew\tchoice. 6.\t    When\tyou\tare\ttold\tto\tbegin,\tturn\tthe\tpage\tand\twork\tas\tquickly\tand\tas\tcarefully\tas\tyou\tcan.\t\tIf\t you cannot answer an item, go on to the next one.  You may return to that item later. DO  NOT  TURN  THIS  PAGE  UNTIL  YOU  ARE  TOLD  TO  DO  SO. Copyright\t\t©\t2017\tCaribbean\tExaminations\tCouncil All rights"
  },
  {
    "title": "CSEC Information Technology - Part 255",
    "content": "©\t2017\tCaribbean\tExaminations\tCouncil All rights reserved. 01229010/CSEC/SPEC2017 GO  ON  TO  THE  NEXT  PAGE 01229010/CSEC/SPEC\t2017 -\t\t2\t\t-                                                                                                    1.\tWhen\tthe\tcomputer\tis\tworking\ton\tgiven\t\t  instructions, it is called (A)\t   output (B)       storage (C)\t   processing (D)\t   input\t 2. Which\tof\tthe\tfollowing\ttypes\tof\t computers\twould\tprocess\tinformation\tat\t the\tfastest\trate?\t        (A)       Embedded"
  },
  {
    "title": "CSEC Information Technology - Part 256",
    "content": "at\t the\tfastest\trate?\t        (A)       Embedded        \t(B)\t   Super\tcomputer  (C) Main Frames    (D) Mobile devices  3. Which of the following are functions of  the\tcontrol\tunit?      I.  Read instruction \t\tII.\t\tDirect\toperations  III.  Execute instruction (A) I and II only (B) I and III only (C) II and III only (D) I, II and III  4. Which of the following is a disadvantage  of\tcloud\tstorage? \t  (A)\t   Accessibility\t(offline/without\t internet)  (B) Reduction of storage cost to  organization"
  },
  {
    "title": "CSEC Information Technology - Part 257",
    "content": "(B) Reduction of storage cost to  organization \t  (C)\t   Increased\tpossibility\tfor\tdisaster\t recovery \t  (D)\t   Efficient\tmanagement\tof\tstored\t data  5. Which of the following storage media  uses\tlaser\ttechnology\tto\tstore\tdata? (A) Flash Drive (B)\t   Magnetic\ttape (C)       CDROM (D) Hard disk    6.\t    Which\tof\tthe\tfollowing\tis\tan\texample\tof\t an\tembedded\tcomputer\tsystem? (A)\t   Desktop\t (B) IBM z system (C) Smart television (D)\t   Laptop"
  },
  {
    "title": "CSEC Information Technology - Part 258",
    "content": "7.\tWhich\tof\tthe\tfollowing\tinput\tdevices\tis \tused\tto\tread\tpencil\tor\tpen\tmarks\ton\ta\t \tmultiple\tchoice\tanswer\tsheet?                                                                                      (A)       OCR (B)       OMR (C)       POS        (D)       MICR"
  },
  {
    "title": "CSEC Information Technology - Part 259",
    "content": "8. The MOST suitable device for the output    of architectural drawings is a   \t(A)\t   plotter \t(B)\t   laser\tprinter \t(C)\t   graphics\ttablet \t(D)\t   light\tpen\t 9.\t    Which\tof\tthe\tfollowing\toutput\tis\tan\t example\tof\ta\thard\tcopy?   \t(A)\t   An\toral\tspeech\tdelivered\tby\ta\t\t\t \t\t\t\tspeaker\t \t(B)\t   A\tbill\tproduced\tfrom\ta\tprinter \t(C)\t   The\tdisplay\ton\ta\tmonitor \t(D)\t   A\tpicture\ton\ta\twall\tproduced\t\t \t \t\t\t\tfrom\ta\tmu"
  },
  {
    "title": "CSEC Information Technology - Part 260",
    "content": "A\tpicture\ton\ta\twall\tproduced\t\t \t \t\t\t\tfrom\ta\tmultimedia\tprojector\t                                                                                      GO  ON  TO  THE  NEXT  PAGE 01229010/CSEC/SPEC/2017 -\t\t3\t\t-   10. Which of the following tasks would MOST  \tlikely\trequire\tan\tadvance\tgraphics\tcard?                                                                                             \t(A)\t   Program\tdevelopment  (B) Web browsing \t(C)\t   SBA\tdevelopment  (D) Video editing 11.\t   In\tmoder"
  },
  {
    "title": "CSEC Information Technology - Part 261",
    "content": "SBA\tdevelopment  (D) Video editing 11.\t   In\tmodern\tcomputers,\tthe\tCPU\tspeed\tis\t\t\t              measured             in                                                               (A)        kilohertz         (B)        gigabytes                 (C)        kilobytes         (D)        gigahertz         12.\t   Quality\tDevelopers\tis\ta\tcompany\tthat\t writes\tprograms\tto\tdo\tspecific\tjobs\tfor\t other\tcompanies.\t\tThese\tprograms\tare\t called"
  },
  {
    "title": "CSEC Information Technology - Part 262",
    "content": "(A)\t   general-purpose\tsoftware \t(B)\t   special-purpose\tsoftware \t(C)\t   custom-purpose\tsoftware \t(D)\t   off-the-shelf\tsoftware 13. Which of the following are software  interfaces?   \t\t\tI.\t\t    Graphical\tuser\tinterface\t(GUI)   II.  Touchscreen \tIII.\t\t  Menu-driven\t \t\t\t    (A) I and II only  (B) I and III only  (C) II and III only  (D) I, II and III"
  },
  {
    "title": "CSEC Information Technology - Part 263",
    "content": "14.\t   Desreen\thas\ta\tdesktop\tcomputer\tsystem. \tShe\tturns\ton\tthe\tsystem\tand\twaits\tfive\t \tminutes\tbut\tn"
  },
  {
    "title": "CSEC Information Technology - Part 264",
    "content": "turns\ton\tthe\tsystem\tand\twaits\tfive\t \tminutes\tbut\tno\timage\tis\tdisplayed.\tDuring\t  troubleshooting, which of the following is \tMOST\tlikely\tto\tbe\tidentified\tas\tthe\t \tproblem?    (A) Keyboard is disconnected \t(B)\t   The\tpower\tcable\tto\tthe\tmonitor\tis\t\t          loose \t(C)\t   The\tbattery\tpower\tconnected\tto\t the\t        system is loose  (D) Touchscreen is disabled 15.  Which of the following is the name of  the\tinterface\tused\tby\tblind\tpersons\tto\t perform\toperations\ton\ta\tcomputer?\t    (A)  Icon  (B)  Se"
  },
  {
    "title": "CSEC Information Technology - Part 265",
    "content": "m\toperations\ton\ta\tcomputer?\t    (A)  Icon  (B)  Sensor   (C)  Braille  (D)  Touchscreen  16.\t   John\tis\trequired\tto\temail\ta\tcopy\tof\this\t SBA\tto\this\tteacher.\tThis\temailed\tcopy\tis\t referred to as \t(A)\t\t  soft\tcopy \t(B)\t\t  hard\tcopy\t \t(C)\t\t  tangible\tcopy \t(D)\t\t  machine\treadable\tcopy 17. Vera is taking an online class and is  required\tto\tenter\ther\tpassword\ttwice.\t This\tprocess\tis\tcalled\tthe\t\t   \t   \t(A)\t\t  storing\tprocess\t \t(B)\t\t  validation\tprocess \t(C)\t\t  verification\tprocess \t(D)\t\t  authenticit"
  },
  {
    "title": "CSEC Information Technology - Part 266",
    "content": "s \t(C)\t\t  verification\tprocess \t(D)\t\t  authenticity\tprocess GO  ON  TO  THE  NEXT  PAGE 01229010/CSEC/SPEC\t2017 -\t\t4\t\t- 18. Which of the following would be the BEST   \toption\tto\texpand\tyour\tlaptop’s\tstorage\t\t \t \tcapacity?  (A)  DVD \t(B)\t\t  CD-ROM\t  (C)  Memory card \t(D)\t\t  Magnetic\ttape 19.\t   James\tCafé\tkeeps\tpayroll\tinformation\t stored\tin\tfiles\ton\ta\tcloud\taccount.\tWhich\t of the following BEST describes how  these\tfiles\tcan\tbe\taccessed?          (A)       Serial        (B)       Random \t(C)"
  },
  {
    "title": "CSEC Information Technology - Part 267",
    "content": "(A)       Serial        (B)       Random \t(C)\t   Sequential \t(D)\t   Indexed\tsequential\t 20. Which of the following statements BEST  describes\tthe\tterm\t'information'?    (A)  It is raw facts.  (B)  It is meaningful.  (C)  It does not have any value. \t(D)\t\t  It\tis\tnot\tthe\tresult\tof\tprocessing. 21.  Which  of  the  following  technologies   is  MOST  suitable  for  transferring  data   between\ttwo\tmobile\tphones?    (A)  Bluetooth \t(B)\t\t  Fibre\toptics  (C)  Microwave \t(D)\t\t  Twisted\tpair 22.\t   Upl"
  },
  {
    "title": "CSEC Information Technology - Part 268",
    "content": "cs  (C)  Microwave \t(D)\t\t  Twisted\tpair 22.\t   Uploading\tor\t downloading\tdata\t   to\t or\t from\t a\tremote\tcomputer\tis\tdone\tusing    (A)  blogging  (B)  instant messaging  (C)  Internet relay chat \t(D)\t\t  file\ttransfer\tprotocol 23. Each website on the Internet can be accessed  by\t  entering\ta\t unique\taddress.\t\tThis\t   address\t is referred to as the    (A)  HTTP  (B)  HTML  (C)  FTP \t(D)\t\t  URL 24.\t   Which\tof\t the\t  following\tnetwork\tcomponents\t is BEST suited for connecting LANS in a  metropolitan"
  },
  {
    "title": "CSEC Information Technology - Part 269",
    "content": "BEST suited for connecting LANS in a  metropolitan\tarea\tnetwork?    (A)  Hub  (B)  Switch  (C)  Router  (D)  Modem   25. Teachers are able to mark class registers  online\tand\tprovide\tinstant\tfeedback\ton\t assessment through the use of    (A)  social media tools \t(B)\t\t  m-learning\tdevices  (C)  simulation software \t(D)\t\t  computer\tassisted\tlearning 26. Which\tof\t  the\t   following\tBEST\t defines\t 'cyberbullying'?    (A)  Connecting to a network \t(B)\t\t  Using\tan\telectronic\tdevice"
  },
  {
    "title": "CSEC Information Technology - Part 270",
    "content": "Using\tan\telectronic\tdevice\t                              to harass someone \t(C)\t\t  Using\telectronic\tdevices\t                              to connect to WiFi \t\t(D)\t\t  Using\tmobile\tdevices\tto\t                              send a message to someone                                                                                      GO  ON  TO  THE  NEXT  PAGE 01229010/CSEC/SPEC/2017 -\t\t5\t\t- 27. You received an email from someone who   \tclaims\tto\tbe\ta\trepresentative\tfrom\tyour\t\t \t  school. The ema"
  },
  {
    "title": "CSEC Information Technology - Part 271",
    "content": "be\ta\trepresentative\tfrom\tyour\t\t \t  school. The email asked you to click on a   \tlink\tto\treset\tyour\tpassword.\tYou\tshould\t\t\t \tproceed\twith\tcaution\tbecause\tthe\temail\t \t  may be a   \t(A)\t\t  spam\tthreat  (B)  malware attack \t(C)\t\t  phishing\tattack \t(D)\t\t  legitimate\trequest 28.\t   Using\telectronic\tdevices\tto\t  view\ta\t chat\t conversation between two friends, in real  time, without their knowledge is   \t(A)\t\t  propaganda \t(B)\t\t  a\tviolation\tof\tprivacy  (C)  a denial of service attack \t(D)\t\t  an\telectro"
  },
  {
    "title": "CSEC Information Technology - Part 272",
    "content": "(C)  a denial of service attack \t(D)\t\t  an\telectronic\teavesdropping 29.\t   The\tuse\t  of\t “*********”\tto\t hide\t   a\t password\t being\tentered\tinto\t   a\t computer\tsystem\tis\t termed    (A)  antivirus \t(B)\t\t  phishing  (C)  biometrics \t(D)\t\t  encryption 30. In an effort to secure data on a system, users  are\t  required\tto\t set\t  a\t password\tin\t a\t specific\t format.\tWhich\tof\t  the\t  following\ttypes\tof\t measures\tis\tthis\tan\texample\tof?    (A)  Physical   (B)  Software  (C)  Hardware  (D)  Personal    31"
  },
  {
    "title": "CSEC Information Technology - Part 273",
    "content": "(B)  Software  (C)  Hardware  (D)  Personal    31.\t   Which\tof\t  the\t  following\tis\t a\t job\t  task\t   of\t  a\t social\tmedia\tspecialist?    (A)  Maintaining a website \t(B)\t\t  Developing\tsoftware\tfor\tsocial                             use \t(C)\t\t  Installing\tor\tupgrading\tsocial \t\t\t\t\tmedia\tsoftware\ton\ta\tcomputer       system   (D)    Generating  and  sharing  content                        daily over a social media network 32.\t   Which\tof\t  the\t   following\tare\t   physical\t restrictions\twith\trespect"
  },
  {
    "title": "CSEC Information Technology - Part 274",
    "content": "llowing\tare\t   physical\t restrictions\twith\trespect\tto\tdata\tsecurity?      I.   Firewall \t\tII.\t\t   Locking\tup\tthe\thardware  III.   Biometric systems    (A)  I and II only  (B)  I and III only  (C)  II and III only  (D)  I, II and III  33.  Which  of  the  following  actions  is  NOT   considered\ta\tcomputer\tcrime?    (A)  Piracy  (B)  Hacking \t(C)\t\t  Encryption \t(D)\t\t  Industrial\tespionage   34.  Including  material  obtained  from  online   sources  in  an  assignment  and  then   submitting the"
  },
  {
    "title": "CSEC Information Technology - Part 275",
    "content": "s  in  an  assignment  and  then   submitting the assignment without giving  credit to the online sources is referred to as   \t(A)\t\t  plagiarism \t(B)\t\t  e-learning  (C)  fraternization  (D)  collaboration GO  ON  TO  THE  NEXT  PAGE 01229010/CSEC/SPEC/2017 -\t\t6\t\t- 35. Telecommuting can BEST be described as  (A)  communicating between two  \t\t\t\t\tcompanies  (B)  working from home by \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tconnecting\thome\tand\toffice  (C)  working from home by  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thaving"
  },
  {
    "title": "CSEC Information Technology - Part 276",
    "content": "g from home by  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thaving\temployees\tat\thome  (D)  communicating  between home and  \t\t\t\t\toffice 36.\t   In\tword\tprocessing,\tan\t  efficient\tway\t   to\t move\tthe\t  third\t   paragraph\tin\t order\tto\t place\t it\tafter\tthe\tfifth\tparagraph\tis \t(A)\t\t  cut\tand\tpaste \t(B)\t\t  copy\tand\tpaste \t(C)\t\t  copy,\tcut\tand\tpaste \t(D)\t\t  cut,\tcopy\tand\tpaste 37.\t   The\ttwo\t  files\t   used\t   to\t produce\tmerged\tletters\t during a mail merge are the   \t(A)\t\t  primary\tdocument\tand\tdata"
  },
  {
    "title": "CSEC Information Technology - Part 277",
    "content": "(A)\t\t  primary\tdocument\tand\tdata\t                             source \t(B)\t\t  primary\tdocument\tand\t                             merged letters  (C)  data source and merged                               letters \t(D)\t\t  primary\tdocument\tand\t                              current letter 38. Which of the following should be  \tconsidered\twhen\tcreating\ta\twebsite?\t   \t(A)\t\t  Cost\tof\teach\twebpage \t(B)\t\t  Position\tof\tthe\thomepage\tin\t                             the website  \t(C)\t\t  Compiler\tneeded\tto\tdevel"
  },
  {
    "title": "CSEC Information Technology - Part 278",
    "content": "the website  \t(C)\t\t  Compiler\tneeded\tto\tdevelop\t                             the website  (D)  Intended audience for the                               website                                                                                       39. Which of the following should be done   \tbefore\tpublishing\ta\twebsite?   \t(A)\t\t  Compile\tthe\tsource\tcode.  (B)  Create the algorithm for the         website. \t(C)\t\t  Ensure\tthat\tall\thyperlinks\tare\t       working correctly.  (D)  Purchase the softw"
  },
  {
    "title": "CSEC Information Technology - Part 279",
    "content": "working correctly.  (D)  Purchase the software needed  \t\t\t\t\t\t\t\t\tto\tdevelop\tthe\twebsite. 40. What is the name of the highlighted word  or\t picture\tin\t a\t webpage\tthat\t  a\t user\t   can\t  click\t on\tto\tgo\tto\tanother\twebpage? \t(A)\t\t  Hypertext  (B)  Bookmark \t(C)\t\t  Hyperlink  (D)  Connection 41. Text\t   entered\tinto\t   a\t spreadsheet\tis\t aligned\t towards  the  left  by  default.  These  entries   are called  (A)  labels  (B)  values  (C)  formulae  (D)  functions  42. Which of the following f"
  },
  {
    "title": "CSEC Information Technology - Part 280",
    "content": "ulae  (D)  functions  42. Which of the following formatting features  is\tunique\tto\tnumbers\tin\tspreadsheets?    (A)  Bold   (B)  Italics   (C)  Custom  (D)  Indent  43.\t   To\tcentre\tthe\t  title\t   rows\tof\t  a\t spreadsheet\t across the columns    (A)  centre align the title rows  (B)  centre align the title columns  (C)  merge and centre the title rows  (D)  merge and centre the title columns GO  ON  TO  THE  NEXT  PAGE 01229010/CSEC/SPEC\t2017 -\t\t7\t\t- 44.\t   Which\tof\tthe\tfollowing\tis\tan\texample\tof"
  },
  {
    "title": "CSEC Information Technology - Part 281",
    "content": "- 44.\t   Which\tof\tthe\tfollowing\tis\tan\texample\tof\t a\tspreadsheet\tfunction?    (A)  function sum(A1, A2, A3)  (B)  sum = A1 + A2 + A3  (C)  = sum(A1:A3)  (D)  = A1 + A2 + A3 45.\t   Which\ttype\t   of\t  application\tis\t BEST\tsuited\t to\tprepare\ta\tbudget?    (A)  Database \t(B)\t\t  Spreadsheet \t(C)\t\t  Word\tprocessor \t(D)\t\t  Desktop\tpublishing 46. Which of the following statements is NOT  true\tof\tprimary\tkeys?   \t(A)\t\t  They\tare\tunique\tidentifiers.  (B)  They are always in text form.  (C)  They do not con"
  },
  {
    "title": "CSEC Information Technology - Part 282",
    "content": "hey are always in text form.  (C)  They do not contain blank        values. \t(D)\t\t  They\tmay\tbe\tcomposed\tof\tone       or more attributes. 47.\t   A\tfield\tin\ta\ttable\tthat\tappears\tas\ta\tmatch \tof\tthe\tprimary\tkey\tin\tanother\ttable\tis\t called a    (A)  foreign key  (B)  candidate key  (C)  secondary key \t(D)\t\t  composite\tkey"
  },
  {
    "title": "CSEC Information Technology - Part 283",
    "content": "48. Which database feature can be used to     list the names of the male students from  \t\ta\tparticular\tclass?  (A)  Table   (B)  Form  (C)  Query  \t(D)\t\t  Report 49.\t   What\tis\tthe\tMOST\tappropriate\tdatabase\t\t \tdata\ttype\tfor\ta\tfield\tholding\tthe\tmarks\tfrom\t\t \ta\tclass\ttest?          (A)       Text        (B)       Numeric        (C)       Currency        (D)       Date/Time 50. What is t"
  },
  {
    "title": "CSEC Information Technology - Part 284",
    "content": "Currency        (D)       Date/Time 50. What is the name given to a collection of  related\tfields\tin\ta\tdatabase?        (A)       Table        (B)       Field        (C)       Record        (D)       Column 51.  The  following  variables  s,  t  and  u,  have   been assigned the values shown.   s = 5    t = 6   u = 3     Which  of  the  following  statements  does   NOT\tevaluate\tto\ttrue?   \t(A)\t   u\t>\t7\tand\tt\t<\t=\t7 \t(B)\t   s\t<\tt\tor\tu\t<\t=\ts\t−\t2 \t(C)\t   t\t<>\t4\tor\ts\t=\t5  (D) u – 2 >= 1"
  },
  {
    "title": "CSEC Information Technology - Part 285",
    "content": "(C)\t   t\t<>\t4\tor\ts\t=\t5  (D) u – 2 >= 1                                                                                                                                                                                                                                                                                            GO  ON  TO  THE  NEXT  PAGE 01229010/CSEC/SPEC\t2017 -\t\t8\t\t- 52. Based on the following algorithm, what \twould\tbe\tdisplayed\tfor\tk? \t\tj\t=\t5 \t\tk\t=\tj \t\tj\t=\tj\t+\tk \t\tk\t=\tj\t+\t3 \t\tdispla"
  },
  {
    "title": "CSEC Information Technology - Part 286",
    "content": "? \t\tj\t=\t5 \t\tk\t=\tj \t\tj\t=\tj\t+\tk \t\tk\t=\tj\t+\t3 \t\tdisplay\tk          (A)       10        (B)       11        (C)       13        (D)       14 53.  Which  of  the  following  algorithms  does   NOT\tdisplay\tfour\tconsecutive\tnumbers?  (A) for v = 2 to 5 \t\tdisplay\tv  (B) h = 1 \t\twhile\th\t<\t5 \t\tdisplay\th   h = h + 1                         end            while \t(C)\t   for\tk\t=\t7\tdown\tto\t4\tstep\t−1 \t\tdisplay\tk  (D) f = 6 \t\twhile\tf\t<\t3 \t\tdisplay\tf   f = f – 1"
  },
  {
    "title": "CSEC Information Technology - Part 287",
    "content": "54.\t   The\trepresentation\tof\tthe\tpseudocode\t\t  \t \tstatement\t“Read\tnumber”\tin\ta\tflowchart              symbol             is                                                                                                   55. Th"
  },
  {
    "title": "CSEC Information Technology - Part 288",
    "content": "55. The term used to describe a memory location  whose\tvalue\tchanges\tduring\tprogram\t execution is          (A)       variable        (B)       volatile        (C)       constant        (D)       dynamic 56. Which\tof\t  the \t following\tare \t high-level\t languages?  I.  Pascal  II.  COBOL  III.  ASSEMBLY  (A)  I and II only  (B)  I and III only  (C)  II and III only  (D)  I, II and III"
  },
  {
    "title": "CSEC Information Technology - Part 289",
    "content": "01229010/CSEC/SPEC/2017 -\t\t9\t\t- END OF TEST IF YOU FINISH BEFORE TIM"
  },
  {
    "title": "CSEC Information Technology - Part 290",
    "content": "/2017 -\t\t9\t\t- END OF TEST IF YOU FINISH BEFORE TIME IS CALLED, CHECK YOUR WORK ON THIS TEST. 57. Program\timplementation\tinvolves\ta\t\t   \t \tnumber\tof\tsteps.\tWhich\tof\tthe\tfollowing\t\t \tsteps\tis\tNOT\tlegitimate?  (A)  Linking  (B)  Bonding  (C)  Executing \t(D)\t\t  Compiling 58.  Which of the following languages is only  understood\tby\tcomputers?    (A)  4 GLs  (B)  Machine language  (C)  Natural language  (D)  Procedural language"
  },
  {
    "title": "CSEC Information Technology - Part 291",
    "content": "59.\t   Errors\tthat\toccur\tin\ta\tprogram\twhen\tthe\t\t \trules\tof\tthe\tprogramming\tlanguages\tare\t\t\t  NOT obeyed are called    (A)  syntax errors  (B)  logical errors \t(C)\t\t  run-time\terrors  (D)  execution errors 60.\t   Which\tof\t the\t  following\tis\t an\t  exa"
  },
  {
    "title": "CSEC Information Technology - Part 292",
    "content": "rors 60.\t   Which\tof\t the\t  following\tis\t an\t  example\tof\t a\t conditional\tconstruct?  (A)  For – Next  (B)  For – endfor  (C)  If – then– else  (D)  While – endwhile DO  NOT WRITE  ON THIS  PAGE DO  NOT WRITE  ON THIS  PAGE CANDIDATE’S   RECEIPT INSTRUCTIONS TO CANDIDATE: 1.    Fill in all the information requested clearly in capital letters.  TEST CODE:   01229010   \t    SUBJECT:\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tINFORMATION\tTECHNOLOGY\t−\tPaper\t01  PROFICIENCY:                    GENERAL \t    REGISTRATION\tNUMBER:"
  },
  {
    "title": "CSEC Information Technology - Part 293",
    "content": "GENERAL \t    REGISTRATION\tNUMBER:\t\t\t \t    FULL\tNAME:\t\t________________________________________________________________  (BLOCK LETTERS) \t    Signature:\t\t____________________________________________________________________ \t    Date:\t\t________________________________________________________________________ 2.    Ensure that this slip is detached by the Supervisor or Invigilator and given to you when you  hand in this booklet. 3.    Keep it in a safe place until you have received yo"
  },
  {
    "title": "CSEC Information Technology - Part 294",
    "content": "Keep it in a safe place until you have received your results. INSTRUCTION TO SUPERVISOR/INVIGILATOR: Sign\tthe\tdeclaration\tbelow,\tdetach\tthis\tslip\tand\thand\tit\tto\tthe\tcandidate\tas\this/her\treceipt\tfor\tthis\tbooklet\t collected by you. I\thereby\tacknowledge\treceipt\tof\tthe\tcandidate’s\tbooklet\tfor\tthe\texamination\tstated\tabove. \t    Signature:\t\t_____________________________ \t    \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSupervisor/Invigilator \t    Date:\t\t_________________________________   Question Key  Syllabus  Objective  Profil"
  },
  {
    "title": "CSEC Information Technology - Part 295",
    "content": "______   Question Key  Syllabus  Objective  Profile    Question Key  Syllabus  Objective  Profile  1  C 1.4  P1    31  D 3.5 P1  2  B 1.2 P1   32  D 3.5 P1  3  C 1.3 P1   33  A 3.2 P1  4  A 1.5 P1   34  A 3.6 P1  5  C 1.3 P1   35  B 3.6 P1  6  C 1.2 P1   36  A 4.3 P2  7  B 1.6 P1   37  A 4.7 P2  8  A 1.6 P1   38  D 4.9 P2  9  B 1.6 P1   39  C 4.12 P2  10  D 1.9 P1   40  C 4.11 P2  11  D 1.9 P1   41  A 5.2 P2  12  B 1.7 P1   42  D 5.7 P2  13  D 1.8 P1   43  D 5.6 P2  14  B 1.10 P1   44  C 5.2 P2"
  },
  {
    "title": "CSEC Information Technology - Part 296",
    "content": "8 P1   43  D 5.6 P2  14  B 1.10 P1   44  C 5.2 P2  15  C 1.8 P1   45  C 5.1 P2  16  A 1.11 P1   46  B 6.2 P2  17  C 1.13 P1   47  D 6.2 P2  18  B 1.4 P1   48  C 6.4 P2  19  C 1.14 P1   49  B 6.2 P2  20  B 1.11 P1   50  C 6.2 P2  21  A 2.1 P1   51  A 7.1 P3  22  D 2.4 P1   52  C 7.8 P3  23  D 2.4 P1   53  D 7.8 P3  24  C 2.2 P1   54  C 7.6 P3  25  D 2.3 P1   55  A 7.4 P3  26  B 3.2 P1   56  D 8.3 P3  27  C 3.1 P1   57  B 8.2 P3  28  D 3.2 P1   58  B 8.1 P3  29  D 3.3 P1   59  A 8.3 P3  30  B 3.3"
  },
  {
    "title": "CSEC Information Technology - Part 297",
    "content": "B 8.1 P3  29  D 3.3 P1   59  A 8.3 P3  30  B 3.3 P1   60  C 8.5 P3  C A R I B B E A N    E X A M I N A T I O N S    C O U N C I L CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMINATION     FILL IN ALL THE INFORMATION REQUESTED CLEARLY IN CAPITAL LETTERS. TEST CODE    SUBJECT  PROFICIENCY             REGISTRATION NUMBER  SCHOOL/CENTRE NUMBER NAME OF SCHOOL/CENTRE CANDIDATE’S FULL NAME (FIRST, MIDDLE, LAST)  DATE OF BIRTH        DDMMYYYY SIGNATURE  _______________________________________________"
  },
  {
    "title": "CSEC Information Technology - Part 298",
    "content": "E  __________________________________________________       0      1      2      2      9      0      2      0 INFORMATION TECHNOLOGY – Paper 02 ‘‘*’’Barcode Area”*” Sequential Bar Code ‘‘*’’Barcode Area”*” Front Page Bar Code ‘‘*’’Barcode Area”*” Current Bar Code   GENERAL SPECIMEN PAPER DO  NOT WRITE  ON THIS  PAGE TEST CODE 01229020 SPEC/2017 SPEC 2017/01229020 C A R I B B E A N      E X A M I N A T I O N S      C O U N C I L  CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMINATION INFORMATIO"
  },
  {
    "title": "CSEC Information Technology - Part 299",
    "content": "ARY EDUCATION CERTIFICATE ® EXAMINATION INFORMATION TECHNOLOGY Paper 02 – General Proficiency 2 hours READ THE FOLLOWING INSTRUCTIONS CAREFULLY. 1. This paper consists of FOUR questions.  Answer ALL questions. 2. Write your answers in the spaces provided in this booklet.   3. Do NOT write in the margins. 4. If you need to rewrite any answer and there is not enough space to do so on the  original page, you must use the extra lined page(s) provided at the back of this  booklet.  Remember to draw a"
  },
  {
    "title": "CSEC Information Technology - Part 300",
    "content": "at the back of this  booklet.  Remember to draw a line through your original answer. 5. If you use the extra page(s) you MUST write the question number clearly  in the box provided at the top of the extra page(s) and, where relevant,  include the question part beside the answer. DO NOT TURN THIS PAGE UNTIL YOU ARE TOLD TO DO SO. Copyright © 2017 Caribbean Examinations Council  All rights reserved. 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code - 4 - GO ON TO THE NEXT PAGE 01229020"
  },
  {
    "title": "CSEC Information Technology - Part 301",
    "content": "al Bar Code - 4 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          Answer ALL questions. 1. Elaine wants to place her gluten-free recipes on the Internet and access them using a web address.   She wants users to register in order to access her recipes and plans to store their informati"
  },
  {
    "title": "CSEC Information Technology - Part 302",
    "content": "ess her recipes and plans to store their information in an  online database.  She also needs to manage any emails and interact with her online clients when  new recipes are uploaded.             (a)            State the name of the computer-related professional that would be most suitable for   placing her recipes on the Internet                         ............................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 303",
    "content": "...............................................   managing her emails and online clients.                         ............................................................................................................................................. (2 marks)  (b)  Describe TWO tasks of EACH of the professionals in Part (a).                         ............................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 304",
    "content": "................................................                         ..............................................................................................................................................                         ..............................................................................................................................................                                                 (2 marks)    (c) Elaine soon receives hundreds of emails with strange"
  },
  {
    "title": "CSEC Information Technology - Part 305",
    "content": "aine soon receives hundreds of emails with strange email addresses and other requests  to  visit  other  websites.    Explain  two  security  practices  that  she  should  consider  before   responding to these emails.                          .................................................................................................................................                         ......................................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 306",
    "content": "..........................................................................................                         ..............................................................................................................................................                          .................................................................................................................................                         ..............................................................."
  },
  {
    "title": "CSEC Information Technology - Part 307",
    "content": ".................................................................................................................................                         ..............................................................................................................................................             (4 marks) - 5 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN"
  },
  {
    "title": "CSEC Information Technology - Part 308",
    "content": "DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           (d) Describe two measures that can be used to prevent against software attacks on Elaine’s  website.                          .............................................................................................................................................                          ...................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 309",
    "content": "...........................................................................................................................                          .............................................................................................................................................     (2 marks) \t(e)\t   Users’\tdata\t   are\t  stored\tin\t an\t  online\tdatabase.\tApart\tfrom\t   first\t   and\t   last\t  name,\tlist\t  two\t   fields\t that should be used to capture data on users who register for Elaine"
  },
  {
    "title": "CSEC Information Technology - Part 310",
    "content": "d to capture data on users who register for Elaine’s recipes.                          .............................................................................................................................................                          .............................................................................................................................................                          ..............................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 311",
    "content": "................................................................................................................                                      (2 marks)   (f)  Elaine  wants  to  extract  some  information  from  the  database.    Complete  the  table  by   selecting the most suitable database feature from the list below.  Calculated  Field FormQueryReportSort TaskDatabase Feature The  list  of  users  who  have  accessed  her   cupcake recipe How many users have registered An  overview"
  },
  {
    "title": "CSEC Information Technology - Part 312",
    "content": "cipe How many users have registered An  overview  of  the  number  of  users  who   requested each recipe A  list  of  the  users  by  country  but  in   ascending order  (4 marks) - 6 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           (g) A user searches for Elaine’s recipes and loca"
  },
  {
    "title": "CSEC Information Technology - Part 313",
    "content": "(g) A user searches for Elaine’s recipes and locates the following layout:   Use the layout above to state    the general name given to this type of page                         .............................................................................................................................................                          .............................................................................................................................................   a web addr"
  },
  {
    "title": "CSEC Information Technology - Part 314",
    "content": ".....................................   a web address                         .............................................................................................................................................                          .............................................................................................................................................   an email address                         ......................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 315",
    "content": ".........................................................................................................................                          .............................................................................................................................................                         a            hyperlink                         ............................................................................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 316",
    "content": "...................................................                          .............................................................................................................................................  (4 marks)            Total 20 marks - 7 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN"
  },
  {
    "title": "CSEC Information Technology - Part 317",
    "content": "DO    NOT    WRITE    IN    THIS    AREA          2. John Taylor is the systems administrator at St Joseph’s High School.  He has been asked by the  principal to prepare a report that will show the requirements for the computers and other equipment  to be purchased for a new computer lab.             (a)            List ANY FOUR of the major components that each computer system should have.                         ........................................................."
  },
  {
    "title": "CSEC Information Technology - Part 318",
    "content": ".......................................................................................................................................                         ..............................................................................................................................................                         .............................................................................................................................................. (2 marks)  (b)  State the func"
  },
  {
    "title": "CSEC Information Technology - Part 319",
    "content": "................... (2 marks)  (b)  State the function of ANY ONE of the major components of a computer system.                       ..............................................................................................................................................                         .............................................................................................................................................. (1 mark)  (c) John intends to create a network that span"
  },
  {
    "title": "CSEC Information Technology - Part 320",
    "content": "k)  (c) John intends to create a network that spans the computer lab.  State the name of the type  of network that he needs to create.                         ..............................................................................................................................................                         .............................................................................................................................................. (1 mark) - 8 - GO ON TO THE NEX"
  },
  {
    "title": "CSEC Information Technology - Part 321",
    "content": ".................. (1 mark) - 8 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          \t(d)\t   In\tpreparing\this\t  report,\tJohn\t   uses\t   the\t  Internet\tto\t assist\thim\t   in\t finding\tthe\t  specifications\tof\t computers best suited for the computer lab.   Discuss ANY TWO approaches he could"
  },
  {
    "title": "CSEC Information Technology - Part 322",
    "content": "mputer lab.   Discuss ANY TWO approaches he could use to evaluate the reliability of the information  he retrieves.                         ..............................................................................................................................................                         ..............................................................................................................................................                         .........................."
  },
  {
    "title": "CSEC Information Technology - Part 323",
    "content": "..............................................................................................................................................                         ..............................................................................................................................................                         .............................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 324",
    "content": "..................................................                         ..............................................................................................................................................                         ..............................................................................................................................................                         ..........................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 325",
    "content": ".....................................................................................................                         ..............................................................................................................................................                         ..............................................................................................................................................                         ........................................"
  },
  {
    "title": "CSEC Information Technology - Part 326",
    "content": "..............................................................................................................................................                         ..............................................................................................................................................                                     (6 marks) - 9 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA"
  },
  {
    "title": "CSEC Information Technology - Part 327",
    "content": "Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           The required report must include a well-organized spreadsheet outlining all the needs of the lab,  and the expected costs in terms of equipment.  The incomplete spreadsheet is shown below. ABCD 1 Expected Costs for New Computer Lab 2 Description ItemUnitsCost per Unit Total 3Student computer30$  5 , 000.00 4Compu"
  },
  {
    "title": "CSEC Information Technology - Part 328",
    "content": "Unit Total 3Student computer30$  5 , 000.00 4Computer Table30$       800.00 5Teacher Computer1$    5,500.00 6Teacher Table1 $       750.00 7Student Chairs30 $        500.00 8Teacher Chairs1$        650.00 920ft UTP Cabling15$          80.00 10 Projector1$     3,000.00 11 Screen1$     2,400.00 12 White board2$        380.00 13 TOTAL Expected Costs 14 15Average Item Cost  (e) Cell A1 is formatted across the columns for effective presentation.   (i) State the name of the formatting feature used to"
  },
  {
    "title": "CSEC Information Technology - Part 329",
    "content": "State the name of the formatting feature used to achieve this.                   .................................................................................................................................                                                 .................................................................................................................................                                                 .............................................................."
  },
  {
    "title": "CSEC Information Technology - Part 330",
    "content": ".....................................................................................................................               (2 marks)   (ii) Write the text for the formula to be inserted in D3 to calculate the TOTAL cost for  student computers.                   .................................................................................................................................                                                 ..................................................."
  },
  {
    "title": "CSEC Information Technology - Part 331",
    "content": "................................................................................................................................                                                 .................................................................................................................................               (2 marks) - 10 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    W"
  },
  {
    "title": "CSEC Information Technology - Part 332",
    "content": "HIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA            (iii) Write the text for the function to be inserted in D13 to calculate the TOTAL expected  costs.                   .................................................................................................................................                                                 ..................................................."
  },
  {
    "title": "CSEC Information Technology - Part 333",
    "content": "................................................................................................................................                                                 .................................................................................................................................               (2 marks)   (iv) Write a function that would insert the average cost per unit of an item in cell B15.                   ..........................................................."
  },
  {
    "title": "CSEC Information Technology - Part 334",
    "content": "........................................................................................................................                                                 .................................................................................................................................                                                 .................................................................................................................................               (2 marks)"
  },
  {
    "title": "CSEC Information Technology - Part 335",
    "content": "..........................               (2 marks)   (v) John decides that he wants the rows reorganized so that they are in order of the  most expensive to the least expensive.    Explain how he could do this using features of the spreadsheet software.                   .................................................................................................................................                                                 .................................................."
  },
  {
    "title": "CSEC Information Technology - Part 336",
    "content": ".................................................................................................................................                                                 .................................................................................................................................               (2 marks)                           Total 20 marks - 11 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    A"
  },
  {
    "title": "CSEC Information Technology - Part 337",
    "content": "ial Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          3. Kara wants to buy a $350.00 costume for the upcoming carnival.  She decides to sell some cakes  in order to raise the funds for the costume.  (a)  (i)   Kara’s friend ordered some cakes. Write an algorithm using pseudocode to prompt  for the quantity of cakes ordered, then calculate and output the total"
  },
  {
    "title": "CSEC Information Technology - Part 338",
    "content": "cakes ordered, then calculate and output the total, if the price  for each cake is $5.00.                   .................................................................................................................................                                                 .................................................................................................................................                   .................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 339",
    "content": ".................................................................................................................                                                 .................................................................................................................................                   .................................................................................................................................                                                 ............"
  },
  {
    "title": "CSEC Information Technology - Part 340",
    "content": ".................................................................................................................................                   .................................................................................................................................                                                 ................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 341",
    "content": "...........................................                   .................................................................................................................................                                                 .................................................................................................................................                   ................................................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 342",
    "content": "...................................................................                                                 ................................................................................................................................. (6 marks)                (ii) Kara sold 25 cakes at $5.00 each.  Explain how Kara would determine whether  she has raised enough funds to purchase her costume.                                     .........................................................."
  },
  {
    "title": "CSEC Information Technology - Part 343",
    "content": ".........................................................................................................................                                                 .................................................................................................................................                   .................................................................................................................................                                                 ...."
  },
  {
    "title": "CSEC Information Technology - Part 344",
    "content": ".................................................................................................................................                   .................................................................................................................................                                                 ................................................................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 345",
    "content": "...................................................                                                 ................................................................................................................................. (4 marks) - 12 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA"
  },
  {
    "title": "CSEC Information Technology - Part 346",
    "content": "DO    NOT    WRITE    IN    THIS    AREA           (b) Kara wants to create the spreadsheet shown below to track the orders placed for the                              items.               ABCDEF 1 Cost of  Costume 2$350.00 3 DateItemCostQuantity  Ordered Total Due 411 JulyChocolate cake$20.006$120.00 511 JulySponge cake$20.005$100.00 614 JulySwirl cake$20.002$40.00 717 JulyCupcakes cake$20.0012$240.00 8 9 10  (i) Using the spreadsheet above, write the functions and/or formulas in cell"
  },
  {
    "title": "CSEC Information Technology - Part 347",
    "content": "above, write the functions and/or formulas in cell E8 or E9  to illustrate whether Kara has raised enough funds.                                      ......................................................................................................................                                                 ................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 348",
    "content": "(6 marks)  (ii) Write the function that would be entered in cell E10  to output ‘Yes’ if Kara would  be able to purchase the costume, or ‘No’ if she has not raised enough funds.                                                               ......................................................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 349",
    "content": ".................................................                                                 ................................................................................................................................. (3 marks)   (iii)  Kara  wants  to  insert  another  order  for  10  July,  in  row  4.    Explain  what  would   happen to the data in row 4.                                                                .................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 350",
    "content": "......................................................................................................                                                 ................................................................................................................................. (1 mark) - 13 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA"
  },
  {
    "title": "CSEC Information Technology - Part 351",
    "content": "NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           (c) Kara does not want others to see her sales from the cakes.  Explain how she could protect  her spreadsheet.                         ..............................................................................................................................................                                     .........................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 352",
    "content": "...................................................................................................................... (1 mark)  (d) Kara is  now very interested in learning more about spreadsheets.  The courses that she  prefers are offered during the day.  Since she works during the day, she cannot register for  them.   Suggest, with reasons, two other options that Kara could consider in order to take a similar  course.                         .................................................."
  },
  {
    "title": "CSEC Information Technology - Part 353",
    "content": "..............................................................................................................................................                                     ..............................................................................................................................................                         .............................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 354",
    "content": "......................................                                     ..............................................................................................................................................                         ..............................................................................................................................................                                     ..............................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 355",
    "content": "................................................................................................................. (4 marks) Total 25 marks - 14 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          4.         (a)         A local area network may be wired or wireless. Jennifer has a small"
  },
  {
    "title": "CSEC Information Technology - Part 356",
    "content": "rk may be wired or wireless. Jennifer has a small apartment and has  decided to set up a network that will connect all the devices in her home that she uses  frequently.  These devices are \t\t•\t  1\tdesktop\tcomputer \t\t•\t  1\tlaptop\tcomputer \t\t•\t  1\tandroid\tcellphone \t\t•\t  1\tandroid\ttablet \t\t•\t  1\tprinter.   Draw lines that correctly map the devices on the left side of the table to the explanation  on the right side of the table. Router Used to send messages to the right computer on a single  networ"
  },
  {
    "title": "CSEC Information Technology - Part 357",
    "content": "messages to the right computer on a single  network ModemUsed when we two different networks need to be connected Switch Type of wired transmission media which is used on local  area networks Twisted Pair Converts  analogue  signals  to  digital  and  digital  signals   to analogue Network Interface Card Prepares data, sends data, receives data, and controls data  flow\t   between\ta\t computer\tand\t   the\t  network\tto\t which\tit\t is\t connected (5 marks)"
  },
  {
    "title": "CSEC Information Technology - Part 358",
    "content": "ks)                                                                                                                                                                          - 15 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           (b)  Explain ONE advantage and ONE disadvantage of using"
  },
  {
    "title": "CSEC Information Technology - Part 359",
    "content": "xplain ONE advantage and ONE disadvantage of using a wireless network over a wired                             network.                         ..............................................................................................................................................                                     ..............................................................................................................................................                         .........."
  },
  {
    "title": "CSEC Information Technology - Part 360",
    "content": "...............                         ..............................................................................................................................................                                     ..............................................................................................................................................                         .................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 361",
    "content": "..............................................................................                                     .............................................................................................................................................. (4 marks)  (c)  State  the  name  of  the  protocol  (technology)  most  commonly  used  to  provide  wireless   computer\tnetworking\tin\ta\thome\tor\toffice.                         ................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 362",
    "content": "................................................................................................................................                                     .............................................................................................................................................. (1 mark) - 16 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN"
  },
  {
    "title": "CSEC Information Technology - Part 363",
    "content": "DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           (d) Algorithms are used to express the steps required to solve a problem.  Write an algorithm  using simple pseudocode to do the following                         •\t  Prompt\ta\tuser\tby\tdisplaying\tthe\tfollowing\tstatement:    Please enter positive integers one at a time and “–1” to indicate no further input.                         •\t  Accept\tthe\tvalues\tfrom\tthe"
  },
  {
    "title": "CSEC Information Technology - Part 364",
    "content": "•\t  Accept\tthe\tvalues\tfrom\tthe\tuser\tuntil\t–1 is entered                         •\t  Determine\tand\tdisplay    (i) the sum of the numbers    (ii) the average of the numbers.                         ..............................................................................................................................................                                     .........................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 365",
    "content": "......................................................................................                         ..............................................................................................................................................                                     ..............................................................................................................................................                                     ..............................."
  },
  {
    "title": "CSEC Information Technology - Part 366",
    "content": "..............................................................................................................................................                         ..............................................................................................................................................                                     ......................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 367",
    "content": ".........................................................                         ..............................................................................................................................................                                     ..............................................................................................................................................                         ........................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 368",
    "content": "........................................................................................................................                                     ..............................................................................................................................................                         .............................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 369",
    "content": "................                                     ..............................................................................................................................................                         ..............................................................................................................................................                                     ....................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 370",
    "content": "...........................................................................................                         ............................................................................................................................................ (10 marks)"
  },
  {
    "title": "CSEC Information Technology - Part 371",
    "content": "- 17 - GO ON TO THE NEXT PAGE 01229020 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           (e) Study the following pseudocode.                            Begin"
  },
  {
    "title": "CSEC Information Technology - Part 372",
    "content": "pseudocode.                            Begin      Declare selected, number, count      count = 0      print “enter your integers”      read number      selected = number      while (count < 10)          if(number < selected)               selected = number          count = count+1          read number      end while      print selection                         End   State the problem the algorithm solves and explain how it solves it.                         ....................................."
  },
  {
    "title": "CSEC Information Technology - Part 373",
    "content": "..............................................................................................................................................                                     ..............................................................................................................................................                         ............................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 374",
    "content": "...................................................                                     ..............................................................................................................................................                         ..............................................................................................................................................                                     .................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 375",
    "content": "..............................................................................................................................                         .............................................................................................................................................                         ..............................................................................................................................................                                     ...."
  },
  {
    "title": "CSEC Information Technology - Part 376",
    "content": ".........                                     ..............................................................................................................................................                         ..............................................................................................................................................                                     (5 marks)        Total 25 marks END OF TEST IF YOU FINISH BEFORE TIME IS CALLED, CHECK YOUR WORK ON THIS TES"
  },
  {
    "title": "CSEC Information Technology - Part 377",
    "content": "BEFORE TIME IS CALLED, CHECK YOUR WORK ON THIS TEST. - 18 - ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          01229020 SPEC/2017 EXTRA SPACE If you use this extra page, you MUST write the question number clearly in the box provided. Question No.   ................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 378",
    "content": "............................................................................................................................................ ........................................................................................................................................................................... ........................................................................................................................................................................... ..............."
  },
  {
    "title": "CSEC Information Technology - Part 379",
    "content": ".................................. ........................................................................................................................................................................... ........................................................................................................................................................................... ........................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 380",
    "content": ".................................................................................................... ...........................................................................................................................................................................  ........................................................................................................................................................................... ......................................................"
  },
  {
    "title": "CSEC Information Technology - Part 381",
    "content": "....................................................................................................................................................................... ........................................................................................................................................................................... ................................................................................................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 382",
    "content": "............................................................. ........................................................................................................................................................................... ...........................................................................................................................................................................  ............................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 383",
    "content": "................................................................................................................................ ........................................................................................................................................................................... ........................................................................................................................................................................... ..........................."
  },
  {
    "title": "CSEC Information Technology - Part 384",
    "content": "...................... ........................................................................................................................................................................... ........................................................................................................................................................................... ....................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 385",
    "content": "........................................................................................ ........................................................................................................................................................................... ........................................................................................................................................................................... DO  NOT WRITE  ON THIS  PAGE CANDIDATE’S   RECEIPT INSTRUCTIONS TO"
  },
  {
    "title": "CSEC Information Technology - Part 386",
    "content": "THIS  PAGE CANDIDATE’S   RECEIPT INSTRUCTIONS TO CANDIDATE: 1.    Fill in all the information requested clearly in capital letters.  TEST CODE:   01229020    SUBJECT:               INFORMATION TECHNOLOGY – Paper 02  PROFICIENCY:                     GENERAL  REGISTRATION NUMBER:     FULL NAME:  ________________________________________________________________  (BLOCK LETTERS)  Signature:  ____________________________________________________________________  Date:  ________________________________"
  },
  {
    "title": "CSEC Information Technology - Part 387",
    "content": "_________  Date:  ________________________________________________________________________ 2.    Ensure that this slip is detached by the Supervisor or Invigilator and given to you when you  hand in this booklet. 3.    Keep it in a safe place until you have received your results. INSTRUCTION TO SUPERVISOR/INVIGILATOR: Sign the declaration below, detach this slip and hand it to the candidate as his/her receipt for this booklet  collected by you. I hereby acknowledge receipt of the candidate’s boo"
  },
  {
    "title": "CSEC Information Technology - Part 388",
    "content": "hereby acknowledge receipt of the candidate’s booklet for the examination stated above.  Signature:  _____________________________                  Supervisor/Invigilator  Date:  _________________________________   01229020/KMS/MAY/SPEC 2017        C A R I B B E A N   E X A M I N A T I O N S   C O U N C I L    CARIBBEAN SECONDARY EDUCATION CERTIFICATE ®   EXAMINATION                                          INFORMATION TECHNOLOGY    Paper 02 – GENERAL PROFICIENCY     KEY AND MARK SCHEME     SPE"
  },
  {
    "title": "CSEC Information Technology - Part 389",
    "content": "ENERAL PROFICIENCY     KEY AND MARK SCHEME     SPECIMEN PAPER    2017     - 2 -  01229020/KMS/SPEC 2017    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SECTION I     SO Question Key Mark   1.      (3:5)    (a)    Web developer  Social media specialist    2  (3:5)  (b)  (Web developer) any TWO of: (i) Builds/creates  websites; oversees development of/updates to  website    (Social media specialist): any TWO of: Post  information to social media ap"
  },
  {
    "title": "CSEC Information Technology - Part 390",
    "content": ": any TWO of: Post  information to social media apps; responds to  emails; sends mass emails/messages    2  (3:3)  (c)  Any Two explanations: (Similar/suitable responses  are acceptable)     Verify the authenticity of the email,     Verify whether the emails are spam   don’t click on the website links if she is  unsure    4  (3:3)  (d)  Any TWO of:  a firewall or antivirus or malware detection to  prevent viruses or malicious attacks (3:3)    2  6:3  (e)  Any TWO of:     email address   typ"
  },
  {
    "title": "CSEC Information Technology - Part 391",
    "content": "2  6:3  (e)  Any TWO of:     email address   types of recipes user requests   country   username    (Similar/suitable responses are acceptable)    2  6:4  (f)  Query   Calculated field  Report   Sort (ed query)    4  4.11  (g)  Home page or webpage  http://www.bakingwithelaine.com or 4baking.com  Elaine@4baking.com  Back to top, link for each baking item,  email  address, and video (4baking.com)    4      TOTAL 20  - 3 -  01229020/KMS/SPEC 2017    Information Technology  Paper 02 – General P"
  },
  {
    "title": "CSEC Information Technology - Part 392",
    "content": "17    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SO Question Key Mark   2.        (a)     Input Device(s), Central Processing Unit/CPU,  Memory, Secondary Storage, Output Device(s)    ANY 4 correct [2 marks]  ANY 2 or 3 correct [1 mark]  1 or 0 correct [0 marks]    2    (b)    Input Device(s) are computer system components  that feed data into a computer; CPU or Central  Processing Unit - is the hardware device in a  computer that executes al"
  },
  {
    "title": "CSEC Information Technology - Part 393",
    "content": "he hardware device in a  computer that executes all the instructions  from the software; Secondary Storage Devices –  refers to non-volatile storage devices, such as  hard disk drives; Output Devices – refers to  peripheral devices that allow processed  information or result to be converted into a  format that is available outside of the  computer system.    Any one correctly explained [1 mark]    1    (c) Local Area Network [1 mark]    1    (d)    He could check the currency [1] of the  inform"
  },
  {
    "title": "CSEC Information Technology - Part 394",
    "content": " He could check the currency [1] of the  information by looking at the date [1] of the  article/information to ensure that the  information is not so old that it is no longer  useful [1]; he could check for biases [1] – he  may need to look for objective sources [1] to  get information on product quality as a seller  may provide exaggerated views of the product  quality [1]; He could check to ensure that the  information is relevant [1] by checking to see  if information on prices, technical"
  },
  {
    "title": "CSEC Information Technology - Part 395",
    "content": "cking to see  if information on prices, technical  specifications and delivery etc. are applicable  to the region in which the school is located.  [1]    ANY 2 reliability tests and correct discussion   (3 marks each as shown)    6    (e) (i)  Merge [1] and center [1]    2     (ii) =B4*C4      1 mark Correct cells  1 mark for *    2    (iii) =Sum(D4:D13))  [1 for correct function and 1 for correct  parameter in the function]    2     - 4 -  01229020/KMS/SPEC 2017    Information Technology  Paper"
  },
  {
    "title": "CSEC Information Technology - Part 396",
    "content": "020/KMS/SPEC 2017    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SO Question Key Mark   2. cont’d      (iv) =Average(C4:C13)  [1 for correct function and 1 for correct  parameter in the function]    2    (v)  Sort the items by column C – Cost Per Unit [1] in  descending order [1]    2      TOTAL 20       - 5 -  01229020/KMS/SPEC 2017    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SO Question Key"
  },
  {
    "title": "CSEC Information Technology - Part 397",
    "content": "and Mark Scheme  SPECIMEN PAPER    SO Question Key Mark   3.      7.6    (a) (i)        6    Algorithm   Comment   Marks   Price = 5.00    Declarations and  initialisation   1 mark   Prompt “Enter  Quantity”   Prompt   1 mark   Accept Quantity   Input data   1 mark   TotalDue = Quantity  * Price   Correct calculation of  total due           Error in  calculation -1   2 marks   Print TotalDue   Output result   1 mark       7.2  (ii)    4    Algorithm   Comment   Marks   Sum (or total) the amount"
  },
  {
    "title": "CSEC Information Technology - Part 398",
    "content": "thm   Comment   Marks   Sum (or total) the amount of money  for all sales;     Calculation of sales   (1 mark)   Then find the difference: 350 -  total sales   Finding difference   (1 mark)   If the total due is equal to or  greater than 350,   Then she has raised enough funds.   Determine whether  enough funds were  raised   (2 marks)      - 6 -  01229020/KMS/SPEC 2017    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SO Question Key Mark    3. co"
  },
  {
    "title": "CSEC Information Technology - Part 399",
    "content": "e  SPECIMEN PAPER    SO Question Key Mark    3. cont’d        (b) (i)    6        Cell  E8 :    =SUM(E4:E7)   OR   =SUM(E4..E7)   OR    =E4+E5+E6+E7       Correct SUM  function:   Correct  Range:  Correct  brackets  and   equal sign  and  (colon or  two dots):           1 mark   1 mark   1 mark   5.4   Cell  E9   Possible options to  calculate the  difference:   =F2-E8   OR    =$F$2-E8            Both cell  references  correct   Equal sign   Minus sign           1 mark   1 mark   1 mark       5."
  },
  {
    "title": "CSEC Information Technology - Part 400",
    "content": "s sign           1 mark   1 mark   1 mark       5.3 (ii)   3        =IF(E9>F2,”Ye s”,”No”)   OR   =IF(E9>0,”No” ,”Yes”)           =IF   Condition   Y/N Options           1 mark   1 mark   1 mark      - 7 -  01229020/KMS/SPEC 2017    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SO Question Key Mark    3. cont’d      5.6 (iii)   1    5.6   Data in row 4 would move to row 5   Or   is pushed down by one row       Explanation showing  that data is row"
  },
  {
    "title": "CSEC Information Technology - Part 401",
    "content": "ne row       Explanation showing  that data is row 4  becomes data in row  5           1 mark           (c) 3.3   1    She could  encrypt her  file or use a  password to  protect it    Encrypt or  Password   (other  suitable/appropriat e responses can be  accepted)   1 mark       (d) 3.6   4    Any two:   Access to information:   Purchase a book and learn  on her own   Watch you tube videos   Access information on the  Internet   Online learning (class)   Online tutoring   Suitable reasons:   E."
  },
  {
    "title": "CSEC Information Technology - Part 402",
    "content": "(class)   Online tutoring   Suitable reasons:   E.g. Level of  knowledge could  determine if she  wants to learn on  her own (book,  watch videos)   Or   prefer an online  class /tutor   Two options    (1 mark  each)   = 2 marks   Suitable  reason for  each option   (1 mark  each)   = 2 marks         TOTAL 15     - 8 -  01229020/KMS/SPEC 2017    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SO Question Key Mark   4.      1.9    (a)    Switch     U"
  },
  {
    "title": "CSEC Information Technology - Part 403",
    "content": "tion Key Mark   4.      1.9    (a)    Switch     Used to send messages to the  right computer on a single  network    Router     Used when we wish to connect  two different networks  together    Twisted Pair    Type of wired transmission  media which is used on local  area networks    Modem    Converts analogue signals to  digital and digital signals to  analogue    Network Interface Card    Prepares data, sends data,  receives data, and controls  data flow between a computer  and the network to"
  },
  {
    "title": "CSEC Information Technology - Part 404",
    "content": "data flow between a computer  and the network to which it is  connected      5           (b)  Advantage – reducing clutter by reducing wires; allowing  her to print from anywhere in her home rather than  needing to take the device and connect it to her  printer; easier installation of new devices (provided  they are wireless compatible); allowing her to print  from the mobile phone and tablet which would not have  traditional printing ports etc. [2 marks for identifying  and explaining ANY ONE"
  },
  {
    "title": "CSEC Information Technology - Part 405",
    "content": ". [2 marks for identifying  and explaining ANY ONE advantage]    Disadvantages – Can require greater care in relation to  security as the transmission media lends itself more  easily to interception; Some persons have concerns  related to their health and wireless signals in their  homes.[2 marks for identifying and explaining ANY ONE  disadvantage]    4    (c) WiFi    1     - 9 -  01229020/KMS/SPEC 2017    Information Technology  Paper 02 – General Proficiency  Key and Mark Scheme  SPECIMEN PAP"
  },
  {
    "title": "CSEC Information Technology - Part 406",
    "content": "ral Proficiency  Key and Mark Scheme  SPECIMEN PAPER    SO Question Key Mark   4. cont’d      (d) Begin                 Declare number, sum, average, count [1]  count=0  sum=0  print “Please enter....”  read number  while(number!=-1)      sum=sum+number      count=count + 1      read number  end while  count=count+1  read number  end while  print “sum=”, sum  print “average=” sum/count                   End       Declare appropriate variable [1 mark]  Initialise the variable [1 mark]  Read first"
  },
  {
    "title": "CSEC Information Technology - Part 407",
    "content": "ark]  Initialise the variable [1 mark]  Read first value [1 mark]  Loop control condition [2 marks]  Statements in loop [3 marks]  Print Sum [1 mark]  Print Average [1 mark]    10    (e)  The algorithm allows the user to enter 10 numbers [1]  after which it displays the smallest of the numbers  entered [1]  (2 marks)    It does this by checking each number entered to see if  it is smaller that the smallest number received thus  far. [1] If it is, then that number is recorded as the  smallest num"
  },
  {
    "title": "CSEC Information Technology - Part 408",
    "content": "then that number is recorded as the  smallest number by storing it in the variable selected.  [1] When the program exits the loop any value stored in  the variable selected will be the smallest [1] – so it  is displayed using the print statement. (3 marks)    5      TOTAL 25    C A R I B B E A N    E X A M I N A T I O N S    C O U N C I L CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMINATION     FILL IN ALL THE INFORMATION REQUESTED CLEARLY IN CAPITAL LETTERS. TEST CODE    SUBJECT  PROFICIENC"
  },
  {
    "title": "CSEC Information Technology - Part 409",
    "content": "CAPITAL LETTERS. TEST CODE    SUBJECT  PROFICIENCY             REGISTRATION NUMBER  SCHOOL/CENTRE NUMBER NAME OF SCHOOL/CENTRE CANDIDATE’S FULL NAME (FIRST, MIDDLE, LAST)  DATE OF BIRTH        DDMMYYYY SIGNATURE  __________________________________________________       0      1      2      2      9      0      3      2 INFORMATION TECHNOLOGY – Paper 032 ‘‘*’’Barcode Area”*” Sequential Bar Code ‘‘*’’Barcode Area”*” Front Page Bar Code ‘‘*’’Barcode Area”*” Current Bar Code   GENERAL SPECIMEN PAPE"
  },
  {
    "title": "CSEC Information Technology - Part 410",
    "content": "e Area”*” Current Bar Code   GENERAL SPECIMEN PAPER DO  NOT WRITE  ON THIS  PAGE                                                                                                                                                                                                                                                                                                                                                    TEST CODE 01229032  SPEC 2017/01229032 C A R I B B E A N      E X A M I N A T I"
  },
  {
    "title": "CSEC Information Technology - Part 411",
    "content": "01229032 C A R I B B E A N      E X A M I N A T I O N S      C O U N C I L  CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMINATION INFORMATION TECHNOLOGY Paper 032 – General Proficiency ALTERNATIVE TO SCHOOL-BASED ASSESSMENT 2 hours READ THE FOLLOWING INSTRUCTIONS CAREFULLY. 1.   This paper consists of FIVE questions, both Theory and Practical.  Answer ALL  questions. 2. Write your answers in the spaces provided where appropriate.   3. Do NOT write in the margins. 4.  If you need to rewrite any"
  },
  {
    "title": "CSEC Information Technology - Part 412",
    "content": "ite in the margins. 4.  If you need to rewrite any answer and there is not enough space to do so on  the original page, you must use the extra lined page(s) provided at the back of  this booklet.  Remember to draw a line through your original answer. 5. If you use the extra page(s) you MUST write the question number clearly  in the box provided at the top of the extra page(s) and, where relevant,  include the question part beside the answer. 6.   For practical questions, please save your work fr"
  },
  {
    "title": "CSEC Information Technology - Part 413",
    "content": "For practical questions, please save your work frequently. DO NOT TURN THIS PAGE UNTIL YOU ARE TOLD TO DO SO. Copyright © 2017 Caribbean Examinations Council  All rights reserved. 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code - 4 - GO ON TO THE NEXT PAGE 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA"
  },
  {
    "title": "CSEC Information Technology - Part 414",
    "content": "DO    NOT    WRITE    IN    THIS    AREA          Answer ALL questions. 1. WORD PROCESSING    Below is a sample letter which is to be sent to customers of Cars Inc.  As the secretary of the   organization, you are to prepare ten letters for appropriate customers using mail merge.  (a) Type the letter indicated above as your primary document.                         Save as  Cars1"
  },
  {
    "title": "CSEC Information Technology - Part 415",
    "content": "(1 mark)  (b) Insert an appropriate logo into the header and add ONE other feature to the letter.               Save as Cars2                         (2 marks) \t(c)\t   Populate\tthe\tletter\tby\tincluding\tmerge\tfields\tfor\tthe\tten\tcustomers.                         Save as Cars3                         (5 marks)  (d) Merge the documents.                          Save as Cars4  (1 mark)  (e) Protect"
  },
  {
    "title": "CSEC Information Technology - Part 416",
    "content": "Save as Cars4  (1 mark)  (e) Protect the merged document by restricting editing.                         Save as CarsInc (1 mark)                                      Total 10 marks - 5 - GO ON TO THE NEXT PAGE 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          2.         SPREADSHEET  (a) Retrieve"
  },
  {
    "title": "CSEC Information Technology - Part 417",
    "content": "AREA          2.         SPREADSHEET  (a) Retrieve the workbook DEALERSHIP, and perform the following tasks on the STOCK  worksheet.\t\tThe\tdata\tshould\treflect\twhat\tis\tshown\tbelow. ABCDE 1 MANUFACTURER OPENING STOCK CLOSING  STOCK PRICE REVENUE FROM  SALES 2NISSAN5385 000 3TOYOTA54100 000 4MITSUBISHI5190 000 5MAZDA5575 000 6SUZUKI52 55 000 7 8 9   (i) Format the labels in row 1 to Arial font, bold, 12 point, and centre the data in the  cells horizontally and vertically."
  },
  {
    "title": "CSEC Information Technology - Part 418",
    "content": "ntally and vertically.                               (2 marks)   (ii) Insert a formula in cell E2 to calculate the REVENUE FROM SALES for cars  from the Nissan Manufacturer, and replicate your formula in cells E3:E6.                               (2 marks)   (iii)  In the range A8:A9, enter the following text:                           TOTAL      REVENUE                         AVERAGE      REVENUE      Then insert appropriate functions in range B8:B9 which will compute the total and  average re"
  },
  {
    "title": "CSEC Information Technology - Part 419",
    "content": "B8:B9 which will compute the total and  average revenue from the sales of all vehicles.                               (2 marks)   (iv) Apply currency and two decimal places to the data in cells D2:E6.                               (1 mark) - 6 - GO ON TO THE NEXT PAGE 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA"
  },
  {
    "title": "CSEC Information Technology - Part 420",
    "content": "DO    NOT    WRITE    IN    THIS    AREA           (b) Retrieve the worksheet SALES. A copy of the worksheet is provided below. Using this  worksheet, perform the following tasks.                                                                        SALES AB  1 2018 Revenue 2 QUARTERREVENUE ($) 3Quarter 11 155 000.00 4Quarter 2925 000.00 5Quarter 31 290 000.00 6Quarter 4     (i)  Link  the  missing  value  in  cell  B6  with  cell  B8  from  the  STOCK  sheet  in  the   DEALERSHIP work"
  },
  {
    "title": "CSEC Information Technology - Part 421",
    "content": "from  the  STOCK  sheet  in  the   DEALERSHIP workbook to complete the 2018 Revenue.                                     (1 mark)     (ii)  Filter  the  REVENUE  data  for  the  quarters  where  the  revenue  was  less  than     $1 000 000.00.  Set up the extraction range in a blank area of the STOCK sheet in  the DEALERSHIP workbook.                                       Save your workbook with the filename         DEAL(CANDIDATENUMBER)                                     Example: DEAL(02000100"
  },
  {
    "title": "CSEC Information Technology - Part 422",
    "content": "Example: DEAL(0200010002) (2 marks)            Total 10 marks - 7 - GO ON TO THE NEXT PAGE 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          3.         DATABASE  The following questions relate to database management.   The owner of a car dealership uses a stock card system to recor"
  },
  {
    "title": "CSEC Information Technology - Part 423",
    "content": "a car dealership uses a stock card system to record the details of vehicles in his  inventory. Retrieve the database called DEALER and perform the following tasks on the table \tSTOCKCARD.\t\tThe\tdata\tshould\treflect\twhat\tis\tshown\tbelow.                          MakeModelRegistration Number Colour AudiA4PCE 427Silver AudiS4PCS 4White BMWX3PBH 2340Red BMWX5PCY 888Blue MercedesC180PBB 3962Green MercedesE200PBR 4747Black MercedesE200PCT 6531Gold MercedesS500PDM 1Black  (a)\t   Insert\ta\tprimary\tkey\tusing"
  },
  {
    "title": "CSEC Information Technology - Part 424",
    "content": "sS500PDM 1Black  (a)\t   Insert\ta\tprimary\tkey\tusing\tthe\tMOST\tappropriate\tfield.\t\t(2 marks) \t(b)\t   Add\tONE\tappropriate\tfield\tname\tand\tdata\ttype\tto\tthe\ttable.\t(2 marks)    (c) The report below is to be generated from your database. MakeModelRegistration NumberColour AudiA4PCE 427Silver S4PCS 4White BMWX3PBH 2340Red X5PCY 888Blue MercedesC180PBB 3962Green E200PBR 4747Black E200PCT 6531Gold S500PDM 1Black   Generate this report and save your database.                                     (3 marks)"
  },
  {
    "title": "CSEC Information Technology - Part 425",
    "content": ".                                     (3 marks)       Save your database with the filename                                      STOCKCANDIDATENUMBER: STOCK(candidate#) eg. STOCK(12345667). - 8 - GO ON TO THE NEXT PAGE 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA           (d) Suggest ONE database feature that can"
  },
  {
    "title": "CSEC Information Technology - Part 426",
    "content": "(d) Suggest ONE database feature that can be used by the dealer to simplify the entry of new  vehicles and their details into his inventory.                                     ..............................................................................................................................................                                     (1 mark)  (e) Describe ONE validation check that could be used on the Registration Numbers as they  are entered."
  },
  {
    "title": "CSEC Information Technology - Part 427",
    "content": "mbers as they  are entered.                         ..............................................................................................................................................                         ..............................................................................................................................................                                     (1 mark)  (f)  Identify  the  database  feature  that  could  be  used  to  arrange  the  registration"
  },
  {
    "title": "CSEC Information Technology - Part 428",
    "content": "t  could  be  used  to  arrange  the  registration  number  of   vehicles in ASCENDING order.                         ..............................................................................................................................................                                     (1 mark)                  Total 10 marks 4. WEBPAGE DESIGN  Amery created a website for his small photography business and was eager to have it published.  However, he was told that he should consider co"
  },
  {
    "title": "CSEC Information Technology - Part 429",
    "content": ".  However, he was told that he should consider completing some checks before doing so.  (a) Insert 1st, 2nd and 3rd in the following table to indicate the order in which the activities  must be completed. ActivityRank Use a test audience. Maintain a website.  Verify that all the hyperlinks work correctly.                                     (3 marks)    (b) Give ONE example of a hyperlink that could be used on the webpage. Explain its purpose.                           ........................."
  },
  {
    "title": "CSEC Information Technology - Part 430",
    "content": "..............................................................................................................................................                            ..............................................................................................................................................                                     (2 marks)                          Total 5 Marks - 9 - GO ON TO THE NEXT PAGE 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequenti"
  },
  {
    "title": "CSEC Information Technology - Part 431",
    "content": "E 01229032 SPEC/2017 ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          5.  PROBLEM-SOLVING AND PROGRAMMING  Mr Smith is the CEO of Techno Store, which is a local distributor for computers and other \telectronic\tdevices.\t\tHe\thas\tsolicited\tyour\thelp\tto\tmake\this\tbusiness\tefficient.\t    Using pseudocode, write an algorithm to     1."
  },
  {
    "title": "CSEC Information Technology - Part 432",
    "content": "Using pseudocode, write an algorithm to     1. accept the name and cost for EACH type of device   2. prompt to enter ‘1’ if taxable or ‘2’ if non-taxable   3. calculate VAT of 16% using conditional branching   4. calculate the total cost of the item after adding VAT   5. output the name and total cost                          ..............................................................................................................................................                         ."
  },
  {
    "title": "CSEC Information Technology - Part 433",
    "content": "........................                         ..............................................................................................................................................                         ..............................................................................................................................................                         ....................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 434",
    "content": "...........................................................................                         ..............................................................................................................................................                         ..............................................................................................................................................                         .................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 435",
    "content": "..............................................................................................................................                         ..............................................................................................................................................                         ..............................................................................................................................................                         ..............."
  },
  {
    "title": "CSEC Information Technology - Part 436",
    "content": "..........                         ..............................................................................................................................................                         ..............................................................................................................................................                         ..................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 437",
    "content": ".............................................................                         ..............................................................................................................................................                         ..............................................................................................................................................                         ................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 438",
    "content": "................................................................................................................                         ..............................................................................................................................................                                                                                                              Total 15 Marks"
  },
  {
    "title": "CSEC Information Technology - Part 439",
    "content": "END OF TEST  - 10 - ‘‘*’’Barcode Area”*” Sequential Bar Code DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA                         DO    NOT    WRITE    IN    THIS    AREA          EXTRA SPACE If you use this extra page, you MUST write the question number clearly in the box provided. Question No.   ................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 440",
    "content": "............................................................................................................................................................ ........................................................................................................................................................................... ..........................................................................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 441",
    "content": ".................................................. ........................................................................................................................................................................... ........................................................................................................................................................................... ........................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 442",
    "content": ".................................................................................................................... ...........................................................................................................................................................................  ........................................................................................................................................................................... ......................................"
  },
  {
    "title": "CSEC Information Technology - Part 443",
    "content": "........... ........................................................................................................................................................................... ........................................................................................................................................................................... ................................................................................................................................................"
  },
  {
    "title": "CSEC Information Technology - Part 444",
    "content": "............................................................................. ........................................................................................................................................................................... ...........................................................................................................................................................................  ............................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 445",
    "content": "................................................................................................................................................ ........................................................................................................................................................................... ........................................................................................................................................................................... ..........."
  },
  {
    "title": "CSEC Information Technology - Part 446",
    "content": "...................................... ........................................................................................................................................................................... ........................................................................................................................................................................... ....................................................................................................................."
  },
  {
    "title": "CSEC Information Technology - Part 447",
    "content": "........................................................................................................ ........................................................................................................................................................................... ........................................................................................................................................................................... 01229032 SPEC/2017 DO  NOT WRITE  ON THIS  PAGE CAN"
  },
  {
    "title": "CSEC Information Technology - Part 448",
    "content": "1229032 SPEC/2017 DO  NOT WRITE  ON THIS  PAGE CANDIDATE’S   RECEIPT INSTRUCTIONS TO CANDIDATE: 1.    Fill in all the information requested clearly in capital letters.  TEST CODE:   01229032    SUBJECT:               INFORMATION TECHNOLOGY – Paper 032  PROFICIENCY:                  GENERAL  REGISTRATION NUMBER:     FULL NAME:  ________________________________________________________________  (BLOCK LETTERS)  Signature:  ____________________________________________________________________  Date:"
  },
  {
    "title": "CSEC Information Technology - Part 449",
    "content": "__________________________________________  Date:  ________________________________________________________________________ 2.    Ensure that this slip is detached by the Supervisor or Invigilator and given to you when you  hand in this booklet. 3.    Keep it in a safe place until you have received your results. INSTRUCTION TO SUPERVISOR/INVIGILATOR: Sign the declaration below, detach this slip and hand it to the candidate as his/her receipt for this booklet  collected by you. I hereby acknowled"
  },
  {
    "title": "CSEC Information Technology - Part 450",
    "content": "this booklet  collected by you. I hereby acknowledge receipt of the candidate’s booklet for the examination stated above.  Signature:  _____________________________                  Supervisor/Invigilator  Date:  _________________________________ 01229032/CSEC/SPEC/MS/2017      C A R I B B E A N   E X A M I N A T I O N S   C O U N C I L    CARIBBEAN SECONDARY EDUCATION CERTIFICATE ®                         INFORMATION TECHNOLOGY    PAPER 032    MARK SCHEME    SPECIMEN                     0122903"
  },
  {
    "title": "CSEC Information Technology - Part 451",
    "content": "ARK SCHEME    SPECIMEN                     01229032/CSEC/SPEC/MS/2017  - 2 –    INFORMATION TECHNOLOGY  PAPER 032  MARK SCHEME  1. Specific Objectives:     a)  1 mark for typing the letter accurately     1 mark    b)  1 mark for the logo placed in the header  1 mark for use of another formatting feature.  2 marks    c) 1 mark for every two field names entered correctly.  (There are 10 fields to be entered)   5 marks    d)  1 mark for merging the documents.  1 mark    e)  1 mark for use of protec"
  },
  {
    "title": "CSEC Information Technology - Part 452",
    "content": "documents.  1 mark    e)  1 mark for use of protection feature.  1 mark  Total 10 marks   2.    Specific Objectives:     a) (i)  Arial font, Np;d, 12 pt - 1 mark  Centre - 1 mark   2 marks      (ii) = (B2 -C2) * D2      1 mark  Replication - 1 mark               2 marks   (iii) Next to total revenue:      = sum(E2:E6)    Next to Average Revenue:  = avg(E2:E6) or =(A8/5)    2 marks     (iv)  All cells with currency format - 1 mark   1 mark  (b) (i) Links data correctly - 1 mark   1 mark    (ii) F"
  },
  {
    "title": "CSEC Information Technology - Part 453",
    "content": ") Links data correctly - 1 mark   1 mark    (ii) Filter correctly applied - 1 mark   Extraction range setup correctly - 1 mark   2 marks  Total 10 marks    01229032/CSEC/SPEC/MS/2017  - 3 –    INFORMATION TECHNOLOGY  PAPER 032  MARK SCHEME    3. Specific Objectives:     a)  Primary key inserted (1), Registration number (1)   2 marks    b) Cost, currency                                2 marks    c)  All fields (1) Data grouped (1); Correct report  format (1)                                    3 m"
  },
  {
    "title": "CSEC Information Technology - Part 454",
    "content": "format (1)                                    3 marks    d) Form                                           1 mark    e)  Eg. Must start with the letter 'P' or other suitable  response                                       1 mark    f) Sort                                           1 mark     Total  10 marks        4. Specific Objectives: 4.11, 4.12       a)    Item Rank  Use a test audience.  2  Maintain a website  3  Verify that all the hyperlinks work  correctly.   1   3 marks"
  },
  {
    "title": "CSEC Information Technology - Part 455",
    "content": "nks work  correctly.   1   3 marks                  01229032/CSEC/SPEC/MS/2017  - 4 –    INFORMATION TECHNOLOGY  PAPER 032  MARK SCHEME    b)    2 marks  Total 5 marks   One Example (1 mark) Explanation (1 mark)  Http://www.anotherlink.com  Link to another web  page.  BacktoTop  Link to a location  within the webpage.  EmailUs or MailTo:  specimen@cxc.org  Link to an email  address.  Download Here  Link to user-created  files.    5. Specific objectives:    Key 1 – Using REPEAT Loop  Header: Tech"
  },
  {
    "title": "CSEC Information Technology - Part 456",
    "content": "ctives:    Key 1 – Using REPEAT Loop  Header: Techno_Store   appropriate heading  (1)  Declaration: The purpose of this algorithm is to output the name and  total cost for a device.          Declaration            (1)    Constant    Vatpercent = 0.16         Use of constant (1)      Variables  Name1, answer of string  Use of datatypes - three or more (2)  Cost, total_cost, vat of real  Response of char    Body  Step 1: Start      (1)  Step 2: Repeat (appropriate use of iteration (1)   Step 3: Pr"
  },
  {
    "title": "CSEC Information Technology - Part 457",
    "content": "eat (appropriate use of iteration (1)   Step 3: Print (Enter the name of device)                                  use of Output statement (1)  01229032/CSEC/SPEC/MS/2017  - 5 –    INFORMATION TECHNOLOGY  PAPER 032  MARK SCHEME  Step3: Read name1        use of Input statement (1)  Step 4: Print(Enter the cost of, name1)  Step 5: Read cost  Step 6: Print (Enter “Y” if item is taxable or “N” if it is non-taxable)  Step 7: Read Response  Step 8: If (Response = “Y”)then (use conditional branching"
  },
  {
    "title": "CSEC Information Technology - Part 458",
    "content": "Response = “Y”)then (use conditional branching               1 mark for If-then and 2 marks for If-then-else)2mks      Set vat         Vatpercent * cost     Else                Set vat         0   Endif  Step 9:  set total_cost            vat + price        1 mark for assignment variable and 1 for correct variables used  Step 10: Print ( The total cost for a , name1 , is, total_cost)                      1 mark for each output (2 marks)  Step 11: Print (Do you have another item?)  Step 12: Read"
  },
  {
    "title": "CSEC Information Technology - Part 459",
    "content": "Print (Do you have another item?)  Step 12: Read Answer  Step 13: Until ( answer = “No”)  Step 14: Stop       Terminator 1 mark    Key 2 – Using FOR Loop  Header: Techno_Store   appropriate heading  (1)  Declaration: The purpose of this algorithm is to output the name and  total cost for a device.             (1)  Constant     Vatpercent = 0.16  Use of constant (1)  Variables:  Name1, of string   Use of datatypes - three or more (2)  Cost, total_cost, vat of real  Response of char  Num of integ"
  },
  {
    "title": "CSEC Information Technology - Part 460",
    "content": "_cost, vat of real  Response of char  Num of integer      01229032/CSEC/SPEC/MS/2017  - 6 –    INFORMATION TECHNOLOGY  PAPER 032  MARK SCHEME  Body:  Step 1: Start              (1)  Step 2 : Print (how many items did you purchase?)  Step 3: Read num       Step 4: For I = 1 to num do   appropriate use of iteration (1)   Step 4i:Print (Enter the name of device)      use of Output statement (1)  Step4ii:   Read name1     use of Input statement (1)  Step 4iv:  Print(Enter the cost of, name1)  Step 4"
  },
  {
    "title": "CSEC Information Technology - Part 461",
    "content": "Step 4iv:  Print(Enter the cost of, name1)  Step 4v:  Read cost  Step 4vi:  Print (Enter “Y” if item is taxable or “N” if it is non- taxable)  Step 4vii:  Read Response  Step 4viii: If (Response = “Y”)then   (use conditional branching - 1 for If-then and 2 for If-then-else)2mks          Set vat                 Vatpercent * cost    Else                   Set vat                   0    Endif  Step 4ix:   set total_cost               vat + price        (1 for assignment variable and 1 for correct v"
  },
  {
    "title": "CSEC Information Technology - Part 462",
    "content": "(1 for assignment variable and 1 for correct variables)  Step 4x:  Print ( The total cost for a , name1 , is, total_cost)     (Output results  1 mark for each output) 2 marks  Step 4xi: Endfor  Step 5: Stop        Terminator (1)    Key 3 – Using WHILE Loop  Header: Techno_Store   appropriate Heading  (1)  Declaration: The purpose of this algorithm is to output the name and  total cost for a device.            (1)  Constant     Vatpercent = 0.16  Use of constant (1)  Variables:  Name1, of str"
  },
  {
    "title": "CSEC Information Technology - Part 463",
    "content": "16  Use of constant (1)  Variables:  Name1, of string   Use of datatypes - three or more (2)  Cost, total_cost, vat of real  01229032/CSEC/SPEC/MS/2017  - 7 –    INFORMATION TECHNOLOGY  PAPER 032  MARK SCHEME  Response of char  Num, count of integer    Body:  Step 1: Start                (1)  Step 2 : Print (how many items did you purchase?)  Step 3: Read num       Step 4: While count<=num do   appropriate use of iteration (1)  Step 4i:   Print (Enter the name of device)   Output statement (1)"
  },
  {
    "title": "CSEC Information Technology - Part 464",
    "content": "Enter the name of device)   Output statement (1)  Step4ii:   Read name1            Input statement (1)  Step 4iv:  Print(Enter the cost of, name1)  Step 4v:  Read cost  Step 4vi:  Print (Enter “Y” if item is taxable or “N” if it is non- taxable)  Step 4vii:  Read Response  Step 4viii:  If (Response = “Y”)then          (use conditional branching - 1 for If-then and 2 for If-then-else)           Set vat           Vatpercent * cost    Else                  Set vat         0    Endif  Step 4ix:   se"
  },
  {
    "title": "CSEC Information Technology - Part 465",
    "content": "Set vat         0    Endif  Step 4ix:   set total_cost         vat + price calculation        (1 for assignment variable and 1 for correct variables used)  Step 4x:  Print ( The total cost for a , name1 , is, total_cost)                                (1 mark for each output) 2 marks  Step xi  Count    count +1  Step 4xii: Endwhile  Step 5: Stop      Terminator (1)   Total 15 marks      CXC 30/G/SYLL 17 59 www.cxc.org                  Caribbean Examinations Council  Prince Road, Pine Pla"
  },
  {
    "title": "CSEC Information Technology - Part 466",
    "content": "ibbean Examinations Council  Prince Road, Pine Plantation Road,  St Michael BB11091  Tel: (246) 227 1700  Email: cxcezo@cxc.org    Caribbean Examinations Council  Prince Road, Pine Plantation Road,  St Michael BB11091"
  }
]