[
  {
  "title": "School-Based Assessment",
  "content": "The School-Based Assessment (SBA) is an internal part of the CXC CSEC Mathematics exam. Students often refer to it as the 'SBA'. It includes a project where students apply mathematical concepts to real-world situations..."
},
  {
    "title": "CSEC Mathematics - Part 1",
    "content": "CXC 10/G/SYLL 17                                                                                                                Effective for examinations from May–June 2018    SYLLABUS    MATHEMATICS    CXC 05/G/SYLL 16    Caribbean Secondary   Education Certificate ®         CXC 05/G/SYLL 16  www.cxc.org  Correspondence related to the syllabus should be addressed to:    The Pro-Registrar  Caribbean Examinations Council  Caenwood Centre  37 Arnold Road, Kingston 5, Jamaica    Telephone Number:"
  },
  {
    "title": "CSEC Mathematics - Part 2",
    "content": "ld Road, Kingston 5, Jamaica    Telephone Number: + 1 (876) 630-5200  Facsimile Number:  + 1 (876) 967-4972   E-mail Address: cxcwzo@cxc.org  Website: www.cxc.org    Copyright ©2016 by Caribbean Examinations Council   Prince Road, Pine Plantation Road, St Michael BB11091                               CXC 05/G/SYLL 16  www.cxc.org    Contents      RATIONALE ............................................................................................................................................."
  },
  {
    "title": "CSEC Mathematics - Part 3",
    "content": "................................................... 5    AIMS ........................................................................................................................................................ 6    ORGANISATION OF THE SYLLABUS ......................................................................................................... 6    FORMAT OF THE EXAMINATIONS ........................................................................................................... 7"
  },
  {
    "title": "CSEC Mathematics - Part 4",
    "content": "............................................ 7    CERTIFICATION AND PROFILE DIMENSIONS ........................................................................................... 8    WEIGHTING OF PAPER AND PROFILES .................................................................................................... 9    REGULATIONS FOR RESIT CANDIDATES .................................................................................................. 9    REGULATIONS FOR PRIVATE CANDIDATES ......"
  },
  {
    "title": "CSEC Mathematics - Part 5",
    "content": "... 9    REGULATIONS FOR PRIVATE CANDIDATES ............................................................................................. 9    SYMBOLS USED ON THE EXAMINATION PAPERS .................................................................................. 10    FORMULAE AND TABLES PROVIDED IN THE EXAMINATION ................................................................. 13    USE OF ELECTRONIC CALCULATORS ..............................................................................."
  },
  {
    "title": "CSEC Mathematics - Part 6",
    "content": "........................................................................ 14    SECTION 1: NUMBER THEORY AND COMPUTATION ............................................................................ 15    SECTION 2: CONSUMER ARITHMETIC ................................................................................................... 19    SECTION 3: SETS .................................................................................................................................... 22    SECTI"
  },
  {
    "title": "CSEC Mathematics - Part 7",
    "content": "...................................... 22    SECTION 4: MEASUREMENT ................................................................................................................. 24    SECTION 5: STATISTICS .......................................................................................................................... 27    SECTION 6: ALGEBRA ............................................................................................................................ 30    SECTION 7:"
  },
  {
    "title": "CSEC Mathematics - Part 8",
    "content": "................................ 30    SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS .............................................................................. 34    SECTION 8: GEOMETRY AND TRIGONOMETRY ..................................................................................... 39    SECTION 9: VECTORS AND MATRICES ................................................................................................... 44    GUIDELINES FOR THE SCHOOL-BASED ASSESSMENT........................"
  },
  {
    "title": "CSEC Mathematics - Part 9",
    "content": "HE SCHOOL-BASED ASSESSMENT............................................................................ 47    RECOMMENDED TEXTS ......................................................................................................................... 56    GLOSSARY OF EXAMINATION TERMS ................................................................................................... 57    GLOSSARY OF MATHEMATICAL TERMS .............................................................................."
  },
  {
    "title": "CSEC Mathematics - Part 10",
    "content": ".................................................................... 61    CXC 05/G/SYLL 16  www.cxc.org    NOTE TO TEACHERS AND LEARNERS          This document CXC 05/G/SYLL 16 replaces the syllabus CXC 05/O/SYLL 08 issued in 2008.    Please note that the syllabus has been revised and notable amendments are indicated by italics and  vertical lines.                First Published in 1977  Revised in 1981  Revised in 1985  Revised in 1992  Revised in 2001  Revised in 2008  Revised in 2016"
  },
  {
    "title": "CSEC Mathematics - Part 11",
    "content": "in 2001  Revised in 2008  Revised in 2016                  PLEASE NOTE    This icon is used throughout the syllabus to represent key features which teachers and  learners may find useful.                                         CXC 05/G/SYLL 16  www.cxc.org     Mathematics Syllabus       RATIONALE    The  Caribbean society  is  an  integral  part  of  an ever-changing  world.  The  impact  of  globalization  on  most   societies   encourages   this diverse   Caribbean   region   to   revisit"
  },
  {
    "title": "CSEC Mathematics - Part 12",
    "content": "this diverse   Caribbean   region   to   revisit   the   education   and   career  opportunities of our current and future citizens. A common denominator of the Caribbean societies is  to  create  among  its  citizens  a  plethora  of  quality  leadership  with  the  acumen  required  to  make  meaningful  projections  and  innovations  for  further  development.  Further,  learning  appropriate  problem-solving   techniques,   inherent   to   the   study   of   mathematics,   is   vital   for"
  },
  {
    "title": "CSEC Mathematics - Part 13",
    "content": "e   study   of   mathematics,   is   vital   for   such   leaders.  Mathematics  promotes  intellectual  development,  is  utilitarian  and  applicable  to  all  disciplines.  Additionally,  its  aesthetics  and  epistemological  approaches  provide  solutions  fit  for  any  purpose.  Therefore, Mathematics  is the  essential  tool  to empower  people  with the  knowledge,  competencies  and attitudes which are precursors for this dynamic world.    The  syllabus  addresses  the  personal  devel"
  },
  {
    "title": "CSEC Mathematics - Part 14",
    "content": "The  syllabus  addresses  the  personal  development  and  educational  needs  of  Caribbean  students  by  encapsulating a variety of skills integral to everyday life and prerequisites for entering environments  of work and academia. These twenty-first century skills include critical and creative thinking, problem  solving,  logical  reasoning,  modelling  ability,  team  work,  decision  making,  research  techniques,  information  communication  and  technological  competencies  for  life"
  },
  {
    "title": "CSEC Mathematics - Part 15",
    "content": "ation  and  technological  competencies  for  life-long  learning. The syllabus  also  uniquely details a smooth progression of concepts that caters for students with primary or rudimentary  knowledge  of  mathematics,  and  it  can  be  easily  subdivided  to  match  the  curricula  of the  different  grades within the local high schools. Moreover, it  is centrally positioned within the CXC sequence of  examinations  bridging the CPEA  and CCSLC with the Additional  and CAPE® Mathematics syllab"
  },
  {
    "title": "CSEC Mathematics - Part 16",
    "content": "with the Additional  and CAPE® Mathematics syllabuses.  Additionally,  the  competencies  and  certification  acquired  upon  completion  of  this  course  of  study  is  comparable with the mathematics curricula of high schools world-wide. In consideration of educational  support,  the  syllabus  provides teachers  with  useful  approaches  and techniques, and it points  to  resources which are suitable for every learning style.     This syllabus will contribute to the development of the Ideal"
  },
  {
    "title": "CSEC Mathematics - Part 17",
    "content": "us will contribute to the development of the Ideal Caribbean Person as articulated by the  CARICOM   Heads of Government in the following areas: “demonstrate multiple literacies,  independent and critical thinking and innovative application of science and technology to problem  solving. Such a person should also demonstrate a  positive work attitude and value and display  creative imagination and entrepreneurship”. In keeping with the UNESCO Pillars of Learning, on  completion of this course of"
  },
  {
    "title": "CSEC Mathematics - Part 18",
    "content": "ars of Learning, on  completion of this course of study, students will learn to do, learn to be and learn to  transform  themselves and society.                          CXC 05/G/SYLL 16  www.cxc.org   AIMS    This syllabus aims to:    1. make Mathematics relevant to the interests and experiences of students by helping them to  recognise Mathematics in the local and global environment;  2. help students appreciate the use of mathematics as a form of communication;    3. help  students  acquire"
  },
  {
    "title": "CSEC Mathematics - Part 19",
    "content": "m of communication;    3. help  students  acquire  a  range  of  mathematical  techniques  and  skills  and  to  foster  and  maintain the awareness of the importance of accuracy;    4. help   students   develop   positive   attitudes,   such   as   open-mindedness, resourcefulness,  persistence and a spirit of enquiry;    5. prepare students for the use of Mathematics in further studies;    6. help students foster a ‘spirit of collaboration’, not only with their peers but with others within  th"
  },
  {
    "title": "CSEC Mathematics - Part 20",
    "content": "t only with their peers but with others within  the wider community;     7. help students apply the knowledge and skills acquired to solve problems in everyday situations;  and,    8. integrate Information Communication and Technology (ICT) tools and skills in the teaching and  learning processes.       ORGANISATION OF THE SYLLABUS     The syllabus is arranged as a set of topics as outlined below, and each topic is defined by its specific  objectives and content/explanatory notes. It is expecte"
  },
  {
    "title": "CSEC Mathematics - Part 21",
    "content": "tives and content/explanatory notes. It is expected that  students would be  able to master the  specific  objectives and  related  content after  pursuing  a  course  in  Mathematics  over  five  years  of  secondary schooling.    SECTION 1: NUMBER THEORY AND COMPUTATION    SECTION 2: CONSUMER ARITHMETIC    SECTION 3: SETS    SECTION 4: MEASUREMENT    SECTION 5: STATISTICS    SECTION 6: ALGEBRA    SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS    SECTION 8: GEOMETRY AND TRIGONOMETRY    SECTION 9: V"
  },
  {
    "title": "CSEC Mathematics - Part 22",
    "content": "CTION 8: GEOMETRY AND TRIGONOMETRY    SECTION 9: VECTORS AND MATRICES    CXC 05/G/SYLL 16  www.cxc.org   FORMAT OF THE EXAMINATIONS     The examination will consist of two papers: Paper 01, an objective type paper and Paper 02, an essay  or problem solving type paper.  Paper 01  (1 hour 30 minutes)    The Paper will consist of 60 multiple-choice items, from all Sections  of the syllabus as outlined below.    Sections No. of items      Number Theory and Computation 6  Consumer Arithmetic 8  Sets"
  },
  {
    "title": "CSEC Mathematics - Part 23",
    "content": "ory and Computation 6  Consumer Arithmetic 8  Sets 6  Measurement 8  Statistics 6  Algebra 6  Relations, Functions and Graphs 8  Geometry and Trigonometry 8  Vectors and Matrices 4  Total 60    Each item will be allocated one mark.          Paper 02  (2 hours and 40 minutes)  The Paper consists of ten compulsory structured type questions.        The marks allocated to the topics are:        Sections No. of marks          Number Theory, Consumer  Arithmetic and Computation  9        Measurement 9"
  },
  {
    "title": "CSEC Mathematics - Part 24",
    "content": "Arithmetic and Computation  9        Measurement 9        Statistics 9        Algebra 10        Relations, Functions and Graphs 20        *Investigation        10        Geometry and Trigonometry 21         Vectors and Matrices         12     Total       100      *      The investigation question may  be set on any combination  of  objectives in the  syllabus.            CXC 05/G/SYLL 16  www.cxc.org  SCHOOL BASED ASSESSMENT: Paper 031 and Paper 032    Paper 031 (20 per cent of Total Assessment)"
  },
  {
    "title": "CSEC Mathematics - Part 25",
    "content": "032    Paper 031 (20 per cent of Total Assessment)    Paper 031 comprises a project.   The project requires candidates to demonstrate the practical application of Mathematics in everyday  life.  In  essence  it  should  allow  candidates  to  probe,  describe  and  explain  a  mathematical  area  of  interest and communicate the findings using mathematical symbols, language and tools. The topic(s)  chosen  may  be  from  any  section  or  combination  of  different  sections  of  the  syllabus."
  },
  {
    "title": "CSEC Mathematics - Part 26",
    "content": "tion  of  different  sections  of  the  syllabus. Students  are  encouraged to work in groups.    See Guidelines for School Based Assessment on pages 43 – 47.    Paper 032 (Alternative to Paper 031)  (1 hour)    This paper is an alternative to Paper 031 and is intended for private candidates. This paper comprises  two compulsory  questions.  The topic(s) tested may  be  from  any  section  or  combination  of  different  sections of the syllabus.        CERTIFICATION AND PROFILE DIMENSIONS    T"
  },
  {
    "title": "CSEC Mathematics - Part 27",
    "content": " CERTIFICATION AND PROFILE DIMENSIONS    The subject will be examined for certification at the General Proficiency.    In each paper, items and questions will be classified, according to the kind of cognitive demand made,  as follows:     Knowledge require  the recall  of  rules,  procedures,  definitions  and  facts,  that  is,  items  characterised   by   rote   memory   as   well   as   simple   computations and  constructions.    Comprehension requires algorithmic thinking that invol"
  },
  {
    "title": "CSEC Mathematics - Part 28",
    "content": "rehension requires algorithmic thinking that involves translation from one mathematical  mode to another.  Use of algorithms and the application of these algorithms  to familiar problem situations.    Reasoning requires:    (a) translation of non-routine problems into mathematical symbols and  then choosing suitable algorithms to solve the problems;    (b) combination of two or more algorithms to solve problems;    (c) use of an algorithm or part of an algorithm, in a reverse order, to solve  a"
  },
  {
    "title": "CSEC Mathematics - Part 29",
    "content": "of an algorithm, in a reverse order, to solve  a problem;    (d) inferences and generalisations from given data;    (e) justification of results or statement; and,    (f) analysis and synthesis.    Candidates’ performance will be reported under Knowledge, Comprehension and Reasoning.    CXC 05/G/SYLL 16  www.cxc.org   WEIGHTING OF PAPER AND PROFILES    The percentage weighting of the examination components and profiles is as follows:      PROFILES PAPER 01 PAPER 02 PAPER 03 TOTAL (%)  Knowledg"
  },
  {
    "title": "CSEC Mathematics - Part 30",
    "content": "LES PAPER 01 PAPER 02 PAPER 03 TOTAL (%)  Knowledge (K) 18 30 6 (12)  60 (30%  Comprehension (C) 24 40 8 (16) 80 (40%)  Reasoning (R) 18 30 6 (12) 60 (30%)  TOTAL 60  100 20 (40) 200  % 30% 50% 20% 100%     REGULATIONS FOR RESIT CANDIDATES    Resit candidates must complete Papers 01 and 02 and Paper 03 of the examination for  the year for  which they re-register.      SBA scores can be carried forward only ONCE and only during the year immediately following the first  sitting. In order to assis"
  },
  {
    "title": "CSEC Mathematics - Part 31",
    "content": "ly following the first  sitting. In order to assist candidates in making decisions about whether or not to reuse a moderated  SBA score, the Council will continue to indicate on the preliminary results if a candidate’s moderated  SBA score is less than 50% in a particular subject.     Candidates re-using SBA scores should register as “Re-sit candidates” and must provide the previous  candidate number when registering.     All  resit  candidates  may register through  schools,  recognised  educat"
  },
  {
    "title": "CSEC Mathematics - Part 32",
    "content": "may register through  schools,  recognised  educational  institutions,  or  the  Local  Registrar’s Office.       REGULATIONS FOR PRIVATE CANDIDATES    Private candidates must be registered for the examination through the Local Registrar in their respective  territories and will be required to sit Papers 01, 02 and 032,     Paper  032  is  designed  for  candidates  whose  work  cannot  be  monitored  by  tutors  in  recognised  educational institutions. The Paper will be of 1 hour duration and"
  },
  {
    "title": "CSEC Mathematics - Part 33",
    "content": "itutions. The Paper will be of 1 hour duration and will consist of two questions.                           CXC 05/G/SYLL 16  www.cxc.org   SYMBOLS USED ON THE EXAMINATION PAPERS    The symbols shown below will be used on examination papers. Candidates, however, may make use  of any symbol or nomenclature provided that such use is consistent and understandable in the given  context. Measurement will be given in S I Units.      SYMBOL     MEANING    Sets      푈      universal set    ∪      union"
  },
  {
    "title": "CSEC Mathematics - Part 34",
    "content": "Sets      푈      universal set    ∪      union of sets    ∩      intersection of sets    ∈      element of     { } 표푟  ф     the null (empty) set           subset of     퐴′      complement of set 퐴     {푥: ...}      the set of all 푥 such that . . .      Relations, Functions and Graphs    푦  푥 푛   푦 varies as 푥 푛     푓(푥)  value of the function 푓 at 푥    푓 −1 (푥)  the inverse of the function 푓(푥)    푔푓(푥) ,푔[푓(푥)]  composite function of the functions 푓 and 푔         푔 2 (푥)      푔[푔(푥)]"
  },
  {
    "title": "CSEC Mathematics - Part 35",
    "content": "functions 푓 and 푔         푔 2 (푥)      푔[푔(푥)]       0    1      2      3      4    {푥∶ 1 ≤  푥  ≤ 3}                0    1      2      3      4  {푥∶ 1 < 푥 < 3}                  CXC 05/G/SYLL 16  www.cxc.org  Number Theory    핎  the set of whole numbers    ℕ  the set of natural (counting) numbers    ℤ  the set of integers, where     { ℤ +   are positive integers ℤ −  are negative integers                       ℚ  the set of rational numbers    ℝ  the set of real numbers      5.432 432 432 . . ."
  },
  {
    "title": "CSEC Mathematics - Part 36",
    "content": "the set of real numbers      5.432 432 432 . . .      9.87212121 . . .      Measurement     05:00 h.    5:00 a.m.    13:15 h.    1:15 p.m.    7 mm ± 0.5 mm     7 mm to the nearest millimetre    10 m/s or 10 ms -1     10 metres per second       Geometry    For transformations these symbols will be used.    M    reflection    R      rotation through 휃 표     T    translation    G    glide reflection    E    enlargement    MR      rotation through  followed by reflection  ∡, ∠, ∧    angle    "
  },
  {
    "title": "CSEC Mathematics - Part 37",
    "content": " followed by reflection  ∡, ∠, ∧    angle        is congruent to     퐴                     퐵    line 퐴퐵           2345.   128 9.   7   CXC 05/G/SYLL 16  www.cxc.org  A                               퐵    ray 퐴퐵               line segment 퐴퐵      퐴                퐵           Vectors and Matrices    a or a     vector a    퐴퐵 ⃗⃗⃗⃗⃗       vector 퐴 to 퐵    | 퐴퐵 ⃗⃗⃗⃗⃗  |      magnitude of vector 퐴퐵 ⃗⃗⃗⃗⃗       퐴=( 푎푏 푐푑 )  or  퐴= [ 푎푏 푐푑 ]    the matrix 퐴     |퐴| or det(퐴)     the determinant of"
  },
  {
    "title": "CSEC Mathematics - Part 38",
    "content": "matrix 퐴     |퐴| or det(퐴)     the determinant of a matrix 퐴    Adj(A)    the adjoint of a matrix 퐴.    퐴 −1     inverse of a matrix 퐴    퐼=( 10 01 )    identity matrix under multiplication    ( 00 00 )   zero matrix or identity matrix under addition      Other Symbols    =    is equal to         is greater than or equal to         is less than or equal to    ≃    is approximately equal to         implies    퐴  퐵    if 퐴, then 퐵 or, 퐴 implies 퐵     퐴⟺퐵       퐼푓 퐴 푡ℎ푒푛 퐵 푎푛푑 퐼푓 퐵 푡ℎ푒푛 퐴 }"
  },
  {
    "title": "CSEC Mathematics - Part 39",
    "content": "s 퐵     퐴⟺퐵       퐼푓 퐴 푡ℎ푒푛 퐵 푎푛푑 퐼푓 퐵 푡ℎ푒푛 퐴 }    or  퐴 is equivalent to 퐵        CXC 05/G/SYLL 16  www.cxc.org   FORMULAE AND TABLES PROVIDED IN THE EXAMINATION       CXC 05/G/SYLL 16  www.cxc.org   USE OF ELECTRONIC CALCULATORS    Candidates are expected to have an electronic nonprogrammable calculator and are encouraged to  use such a calculator in Paper 02.      Guidelines for the use of electronic calculators are listed below.    1. Silent, electronic handheld calculators may be used."
  },
  {
    "title": "CSEC Mathematics - Part 40",
    "content": "t, electronic handheld calculators may be used.    2. Calculators should be battery or solar powered.    3. Candidates are responsible for ensuring that calculators are in working condition.    4. Candidates are permitted to bring a set of spare batteries in the examination room.    5. No compensation will be given to candidates because of faulty calculators.    6. No help or advice is permitted on the use or repair of calculators during the examination.    7. Sharing calculators is not permitte"
  },
  {
    "title": "CSEC Mathematics - Part 41",
    "content": "ination.    7. Sharing calculators is not permitted in the examination room.    8. Instruction manuals and external storage media (for example, card, tape, disk, smartcard or  plug-in modules) are not permitted in the examination room.    9. Calculators  with  graphical display,  data  bank,  dictionary  or  language  translation  are not  allowed.    10. Calculators  that  have  the  capability of  communication  with  any  agency  in or outside of  the  examination room are prohibited."
  },
  {
    "title": "CSEC Mathematics - Part 42",
    "content": "of  the  examination room are prohibited.                            CXC 05/G/SYLL 16  www.cxc.org   SECTION 1: NUMBER THEORY AND COMPUTATION      GENERAL OBJECTIVES    On completion of this Section, students should:    1. demonstrate computational skills;    2. be aware of the importance of accuracy in computation;    3. appreciate the need for numeracy in everyday life;    4. demonstrate the ability to make estimates fit for purpose;    5. understand and appreciate the decimal numeration sys"
  },
  {
    "title": "CSEC Mathematics - Part 43",
    "content": "derstand and appreciate the decimal numeration system;    6. appreciate the development of different numeration systems;    7. demonstrate the ability to use rational approximations of real numbers;    8. demonstrate the ability to use number properties to solve problems; and,    9. develop the ability to use patterns, trends and investigative skills.      SPECIFIC OBJECTIVES CONTENT/ EXPLANATORY NOTES     Students should be able to:      1. distinguish among sets of  numbers;    Sets of numbers"
  },
  {
    "title": "CSEC Mathematics - Part 44",
    "content": "inguish among sets of  numbers;    Sets of numbers:    natural numbers ℕ={1,2,3,...};   whole numbers 핎={0,1,2,3,...};  integers ℤ={...−2,−1,0,1,2,...};    rational numbers ℚ={ 푝 푞 ∶ 푝 and 푞 are integers,푞 ≠휊};     irrational    numbers    (numbers    that    cannot    be  expressed as  terminating or recurring decimals, for  example, numbers such as  and  √ 2);     real numbers ℝ= {the union of rational and irrational numbers};     inclusion relations, for example,  ℕ⊂핎⊂ℤ⊂ℚ⊂ℝ; and,    sequence"
  },
  {
    "title": "CSEC Mathematics - Part 45",
    "content": "lations, for example,  ℕ⊂핎⊂ℤ⊂ℚ⊂ℝ; and,    sequences  of  numbers  that  have  a  recognisable  pattern;  factors  and  multiples;  square  numbers;  even   numbers;   odd   numbers;   prime   numbers;  composite numbers.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 1: NUMBER THEORY AND COMPUTATION (cont’d)      SPECIFIC OBJECTIVES CONTENT/EXPLANATORY NOTES      Students should be able to:      2. compute powers of real numbers of  the form 퓍 푎 , where 푎∈ℚ ;  Including squares, square roots, cubes,"
  },
  {
    "title": "CSEC Mathematics - Part 46",
    "content": "re 푎∈ℚ ;  Including squares, square roots, cubes, cube roots.  3. evaluate    numerical    expressions   using    any    of    the    four    basic  operations on real numbers;  Addition,  multiplication, subtraction  and  division  of whole numbers, fractions and decimals; order of  operations.  4. convert  among  fractions, percents  and decimals;  Conversion  of  fractions  to decimals  and  percents,  conversion  of  decimal  to  fractions  and  percents,  conversion of percents to decimals"
  },
  {
    "title": "CSEC Mathematics - Part 47",
    "content": "nd  percents,  conversion of percents to decimals and fractions.    5. list the set of factors and multiples  of a given integer;  Positive and negative factors of an integer.  6. compute  the  H.C.F.  or  L.C.M.  of  two or more positive integers;  Highest   common   factors   and lowest   common  multiples.  7. state   the   value   of   a   digit of a  numeral in a given base;  Place value and face value of numbers  in bases 2,  4, 8, and 10.  8. convert  from  one  set  of  units  to  anothe"
  },
  {
    "title": "CSEC Mathematics - Part 48",
    "content": "8. convert  from  one  set  of  units  to  another;  Conversion   using   conversion   scales,   converting  within  the  metric  scales,  12-hour  and  24-hour  clock.  9. express a value to a given number  of:  (a) significant figures; and,    (b) decimal places.  1, 2 or 3 significant figures.  0, 1, 2 or 3 decimal places.  10. use   properties   of   numbers   and  operations in computational tasks;   Properties     of operations such     as closure,  associativity,  additive  and multiplic"
  },
  {
    "title": "CSEC Mathematics - Part 49",
    "content": "closure,  associativity,  additive  and multiplicative  identities  and inverses,  commutativity and distributivity.    11. write    any    rational    number    in  scientific notation;  Scientific notation.   For example 759000=7.59×10 5   12. calculate any fraction or  percentage of a given quantity;  Fractions and percentages of a whole. The whole  given a fraction or percentage.             CXC 05/G/SYLL 16  www.cxc.org  SECTION 1: NUMBER THEORY AND COMPUTATION (cont’d)      SPECIFIC OBJEC"
  },
  {
    "title": "CSEC Mathematics - Part 50",
    "content": "HEORY AND COMPUTATION (cont’d)      SPECIFIC OBJECTIVES CONTENT/ EXPLANATORY NOTES     Students should be able to:      13. express    one    quantity    as    a  fraction or percentage of  another;  Comparing   two   quantities   using   fractions   and  percentages.  14. compare quantities;  Ratio, proportion and rates.  15. order a set of real numbers;      Rearranging  a  set  of  real  numbers  in ascending  or  descending order. For example  1.1, 7 2 , √ 2,1.45,휋  in ascending order is   1"
  },
  {
    "title": "CSEC Mathematics - Part 51",
    "content": "1.1, 7 2 , √ 2,1.45,휋  in ascending order is   1.1, √ 2,1.45,휋, 7 2 .    16. compute terms of  a  sequence  given a rule;    17. derive an appropriate rule given  the terms of a sequence;    18. divide a quantity in a given ratio;  and,  Ratio, proportion of no more than three parts.  19. solve problems involving  concepts  in  number  theory and  computation.  Including ratio, rates and proportion.     Suggested Teaching and Learning Activities    To facilitate students’ attainment of the obj"
  },
  {
    "title": "CSEC Mathematics - Part 52",
    "content": "s    To facilitate students’ attainment of the objectives of  this  Section,  teachers  are  advised  to  engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;     (b) games and quizzes; (for example, to investigate whether a given number is rational or  irrational);    (c) appropriate software;    (d) examples of computation drawn from current affairs;    (e) the use recipes in teaching ratio and proportion; and,    (f) online dem"
  },
  {
    "title": "CSEC Mathematics - Part 53",
    "content": "ching ratio and proportion; and,    (f) online demonstrative videos.                                                                            CXC 05/G/SYLL 16  www.cxc.org  SECTION 1: NUMBER THEORY AND COMPUTATION (cont’d)      2. Explore the link between mathematics and other disciplines, for example:    (a) Music: the octave;    (b) Sciences and Nature:  periodic  tables,  counting  petals,  leaves  and  other  random  natural events;    (c) Art and Geography: enlargement of photos as compar"
  },
  {
    "title": "CSEC Mathematics - Part 54",
    "content": "Art and Geography: enlargement of photos as compared with ratio and proportion;    (d) Architecture: number patterns and lighting patterns, ratio of width to length to height  of a building or building part;    (e) Health and Family Life: nutrition facts of food products; and,    (f) Business Studies: using   approximations   in   transactions,   finding   percentages   of  investments and capital.    3. Engage the students in the history of numbers.    4. Teachers can engage students in the pro"
  },
  {
    "title": "CSEC Mathematics - Part 55",
    "content": "ers.    4. Teachers can engage students in the process of “mental computation”. The use of divisibility  tests and other ready reckoners and properties such as associativity.    5. In  the  development of  mental computation  in  the  classroom,  teachers  can  provide  oral  or  written questions and encourage students to explain how they arrived at their answers and to  compare  their  problem-solving  strategies  with  those  of  their  classmates.  Below  are  two  examples.    (a) A flight"
  },
  {
    "title": "CSEC Mathematics - Part 56",
    "content": "ates.  Below  are  two  examples.    (a) A flight departs on a journey at 0800 hours. After 30 minutes of flying time the journey  is  1 3  complete.  Estimate  the  arrival  time  of  the  flight assuming  the  flight  was  at  constant speed throughout the journey.    (b) In a cricket game,  at the end of the fifth over  the run rate of a team is 4.6 runs per  over. If the team continues to score at the same rate, determine the projected score  at the end of the twentieth over.         CXC 05/"
  },
  {
    "title": "CSEC Mathematics - Part 57",
    "content": "at the end of the twentieth over.         CXC 05/G/SYLL 16  www.cxc.org   SECTION 2: CONSUMER ARITHMETIC      GENERAL OBJECTIVES    On completion of this Section, students should:    1. develop the ability to perform the calculations required in normal business transactions, and  in computing their own budgets;    2. appreciate the need for both accuracy and speed in calculations;    3. appreciate the advantages and disadvantages of different ways of investing money;    4. appreciate that busi"
  },
  {
    "title": "CSEC Mathematics - Part 58",
    "content": "ays of investing money;    4. appreciate that business arithmetic is indispensable in everyday life; and,    5. demonstrate the ability to use concepts in consumer arithmetic to describe, model and solve  real-world problems.      SPECIFIC OBJECTIVES    CONTENT/ EXPLANATORY NOTES      Students should be able to:      1. calculate:    (a) discount;    (b) sales tax;    (c) profit; and,    (d) loss;       2. calculate    (a) percentage profit; and,    (b) percentage loss;       3. express    a"
  },
  {
    "title": "CSEC Mathematics - Part 59",
    "content": "(b) percentage loss;       3. express    a    profit,    loss,    discount,  markup    and    purchase    tax,    as    a  percentage of some value;       4. solve    problems    involving    marked  price,  selling  price,  cost  price,  profit,  loss or discount;       5. solve problems involving payments by  instalments as   in   the   case   of   hire  purchase and mortgages;       CXC 05/G/SYLL 16  www.cxc.org  SECTION 2: CONSUMER ARITHMETIC (cont’d)      SPECIFIC OBJECTIVES  CONTENT/ E"
  },
  {
    "title": "CSEC Mathematics - Part 60",
    "content": "ETIC (cont’d)      SPECIFIC OBJECTIVES  CONTENT/ EXPLANATORY NOTES      Students should be able to:    6. solve  problems  involving  simple  interest;     Principal, time, rate, amount.  7. solve problems involving  compound    interest;     Formulae   may   be   used   in   computing   compound  interest. The use of calculators is encouraged.  8. solve problems involving     appreciation and depreciation;       9. solve problems involving  measures and money; and,"
  },
  {
    "title": "CSEC Mathematics - Part 61",
    "content": "ures and money; and,                                                                                                                                                 Currency conversion.  10. solve problems involving:    (a) rates and taxes;     (b) utilities;    (c) invoices    and    shopping  bills;     (d) salaries and wages; and,    (e) insurance and  investments.         Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teach"
  },
  {
    "title": "CSEC Mathematics - Part 62",
    "content": "ttainment of the objectives of this Section, teachers are advised to engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;     (b) games and quizzes;    (c) appropriate software (for example, create an excel document to calculate utility bills  and net salary);    (d) examples of consumer arithmetic drawn from current affairs;    (e) online videos;    CXC 05/G/SYLL 16  www.cxc.org  SECTION 2: CONSUMER ARITHMETIC (cont’d)      (f) a"
  },
  {
    "title": "CSEC Mathematics - Part 63",
    "content": "SECTION 2: CONSUMER ARITHMETIC (cont’d)      (f) advertisement clippings for comparing prices; comparing prices and determining best  buy; calculating hire purchase; and,    (g) bills and financial forms, for example, calculating utility cost and completing tax forms.    2. Solve problems using the straight line and reducing balance method.    3. Conduct surveys or solve problems based on comparative shopping; finding total price for an  item purchased online.    4. Encourage in-class role play"
  },
  {
    "title": "CSEC Mathematics - Part 64",
    "content": "chased online.    4. Encourage in-class role play of market situations and Cambio.    5. Examine and verifying premiums and interest using amortization tables.          CXC 05/G/SYLL 16  www.cxc.org   SECTION 3: SETS      GENERAL OBJECTIVES    On completion of this Section, students should:    1. demonstrate the ability to communicate using set language and concepts;    2. demonstrate the ability to reason logically; and,    3. appreciate the importance and utility of sets in analysing and solv"
  },
  {
    "title": "CSEC Mathematics - Part 65",
    "content": "portance and utility of sets in analysing and solving real-world problems.      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:      1. explain  concepts  relating  to  sets;   Examples  and non-examples  of  sets,  description  of  sets using words, membership of a set, cardinality of  a set, finite and infinite sets, universal set, empty set,  complement of a set, subsets.      2. represent   a   set   in   various  forms;   Representation of a set. For exampl"
  },
  {
    "title": "CSEC Mathematics - Part 66",
    "content": "ious  forms;   Representation of a set. For example,     (a) Description:  the  set  A  comprising  the  first  three natural numbers.    (b) Set builder notation:   퐴= { 푥: 0<푥<4,푥∈ℕ } ;   (c)       Listing: 퐴={1,2,3}    3. list subsets of a given set;  Identifying  the  subsets  as  well  as  determining  the  number of subsets of a set with n elements.      4. determine elements in  intersections, unions and  complements of sets;   Intersection and union of not more than three sets.  Apply th"
  },
  {
    "title": "CSEC Mathematics - Part 67",
    "content": "n and union of not more than three sets.  Apply the result   .      5. describe  relationships  among  sets  using  set  notation  and  symbols;   Universal, complement, subsets, equal and equivalent  sets, intersection, disjoint sets and union of sets.      6. draw Venn     diagrams     to  represent relationships  among sets;   Not more than 4 sets including the universal set.      7. use Venn diagrams to  represent the relationships  among sets; and,     )()()()(BAnBnAnBAn   CXC 05/G/SYL"
  },
  {
    "title": "CSEC Mathematics - Part 68",
    "content": "s; and,     )()()()(BAnBnAnBAn   CXC 05/G/SYLL 16  www.cxc.org  SECTION 3: SETS (cont’d)      8. solve    problems    in    Number  Theory,  Algebra  and  Geometry  using concepts in Set Theory.         Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers are advised to engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;     (b) games and quizzes;    (c)"
  },
  {
    "title": "CSEC Mathematics - Part 69",
    "content": "(a) calculators;     (b) games and quizzes;    (c) appropriate software (for example, whiteboard apps for drawing and labelling Venn  diagrams);    (d) examples of sets drawn from current affairs;    (e) the use of recipes in teaching sets; and,    (f) online demonstrative videos.    2. Explore the link between sets and other disciplines, for example:    (a) Music: types of instruments, classification of songs;    (b) Sciences: periodic  tables; find  the  number  of  elements  in  a  naturally"
  },
  {
    "title": "CSEC Mathematics - Part 70",
    "content": "find  the  number  of  elements  in  a  naturally  occurring  set  based on characteristics of other sets;    (c) Art and Geography: classifying regions according to soil type or altitude;      (d) Architecture: classifying  buildings  according  to  the  style  of  roof,  shape  of  building,  number of floors, historical design;    (e) Health and family life: use medical records to categorize patients by disease, identify  intersections for example hypertension and diabetes; and,    (f) Busine"
  },
  {
    "title": "CSEC Mathematics - Part 71",
    "content": "mple hypertension and diabetes; and,    (f) Business studies: types of businesses, types of products and services.    3. Engage in activities which assign students to groups based on their interests (sets) noting those  in more than one group (intersection) and those not in a group (complement).    4. Use graphic organisers for comparing and/or classifying sets of items: the set of real numbers,  plane figures, solids.      CXC 05/G/SYLL 16  www.cxc.org   SECTION 4: MEASUREMENT      GENERAL OBJ"
  },
  {
    "title": "CSEC Mathematics - Part 72",
    "content": "cxc.org   SECTION 4: MEASUREMENT      GENERAL OBJECTIVES    On completion of this Section, students should:    1. understand that the attributes of geometrical objects can be quantified using measurement;    2. appreciate  that  all  measurements  are  approximate  and  that  the  relative  accuracy  of  a  measurement is dependent on the measuring instrument and the measurement process; and,    3. demonstrate  the  ability  to  use  concepts  in  measurement  to  model  and  solve  real-world"
  },
  {
    "title": "CSEC Mathematics - Part 73",
    "content": "n  measurement  to  model  and  solve  real-world  problems.      SPECIFIC OBJECTIVES    CONTENT/ EXPLANATORY NOTES      Students should be able to:      1. convert  units  of  length, mass,  area, volume, capacity;         Refer to Sec 1, SO8.  2. use  the  appropriate  SI  unit  of  measure    for    area,    volume,  capacity,   mass,   temperature  and  time  (24-hour  clock)  and  other derived quantities;     Refer to Sec 1, SO8.    3. determine the  perimeter  of  a  plane shape;   Estima"
  },
  {
    "title": "CSEC Mathematics - Part 74",
    "content": "rmine the  perimeter  of  a  plane shape;   Estimating    and    measuring    the perimeter    of  compound and irregular shapes.  Calculating the perimeter of polygons and circles.    4. calculate  the  length  of  an  arc  of a   circle;     Perimeter of sector of a circle  5. estimate   the   area   of   plane  shapes;     Finding   the   area   of   plane   shapes   without   using  formulae.  6. calculate  the  area  of polygons  and circles;       7. calculate the area of a sector of  a ci"
  },
  {
    "title": "CSEC Mathematics - Part 75",
    "content": ";       7. calculate the area of a sector of  a circle;       8. calculate the area of a triangle  given  two  sides  and  the  angle  they form;   Use  of  formulae.  Including  given  two  sides  and  included angle.      9. calculate the area of a segment  of a circle;       CXC 05/G/SYLL 16  www.cxc.org  SECTION 4: MEASUREMENT (cont’d)        Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers are advised to engage  stu"
  },
  {
    "title": "CSEC Mathematics - Part 76",
    "content": "this Section, teachers are advised to engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a)  calculators;     (b) games and quizzes;    (c) appropriate  software (for  example,  use  of  white  board  software  for  sketching  diagrams; Mobile apps: Math Ref with list of formulae); and,    (d) online demonstrative videos.              SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES       Students should be able to:       10. calculate the sur"
  },
  {
    "title": "CSEC Mathematics - Part 77",
    "content": "nts should be able to:       10. calculate the surface  area of   solids;   Prisms including cubes and cylinders; right pyramids  including cones; spheres.  Surface  area  of sphere,  퐴=4휋푟 2 .    11. calculate    the    volume    of  solids;   Prism   including   cube   and   cuboid,   cylinder,   right  pyramid,   cone   and   sphere.      Volume   of   sphere,                     푉= 4 3 휋푟 3     12. solve problems involving the  relations among time,  distance and speed;     Average speed.  1"
  },
  {
    "title": "CSEC Mathematics - Part 78",
    "content": "g time,  distance and speed;     Average speed.  13. estimate the margin of error  for a given measurement;     Sources of error.  Maximum and minimum measurements.  14. use scales and scale  drawings to determine  distances and areas; and,     (Link to Geography)  15. solve     problems     involving  measurement.   Perimeter, area and volume of compound shapes  and solids.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 4: MEASUREMENT (cont’d)      2. Explore the link between measurement and other d"
  },
  {
    "title": "CSEC Mathematics - Part 79",
    "content": ". Explore the link between measurement and other disciplines, for example:    (a) Music: creating music with bottles of water where the height/volume of water results  in a particular tone;    (b) Sciences and nature: area of naturally occurring surfaces; length of the beach or water  edge;  experiments  in  calculating  speed,  distance  or  time;  plot  a  graph  to  show  the  cooling  rate of boiling  water  as  time  elapse;  use  various  measurement  instruments  from a science laboratory"
  },
  {
    "title": "CSEC Mathematics - Part 80",
    "content": "easurement  instruments  from a science laboratory;    (c) Art  and  Geography:  use  of  rain  gauge,  map  reading,  measuring  distances  on  map  including irregular paths;      (d) Architecture:  finding  the  perimeter,  area  or  volume  of  structures:  roof,  wall,  floor,  room, column, eaves;    (e) Health and family life: experiment to calculate BMI; and,    (f) Business studies: determining amounts to buy given various units of lengths, area and  volume.    3. Teacher-made  resource"
  },
  {
    "title": "CSEC Mathematics - Part 81",
    "content": "hs, area and  volume.    3. Teacher-made  resources:  grid  for  finding  area  of  irregular  shapes,  rubric  for  peer  to  peer  assessment by students.    4. Engage students in investigating the value of pi and the area of the circle.                CXC 05/G/SYLL 16  www.cxc.org   SECTION 5: STATISTICS      GENERAL OBJECTIVES    On completion of this Section, students should:    1. appreciate  the  advantages  and  disadvantages  of  the   various  ways  of  presenting and  representing da"
  },
  {
    "title": "CSEC Mathematics - Part 82",
    "content": "various  ways  of  presenting and  representing data;    2. appreciate  the  necessity  for  taking  precautions  in  collecting,  analysing  and  interpreting  statistical data, and making inferences;    3. demonstrate  the ability to use  concepts in statistics  and probability to describe, model and  solve real-world problems; and,    4. understand the four levels/scales of measurement that inform the collection of data.       SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students sho"
  },
  {
    "title": "CSEC Mathematics - Part 83",
    "content": "VES    CONTENT/EXPLANATORY NOTES      Students should be able to:      1. differentiate  between  sample  and population attributes;   Sample statistics and population parameters.      2. construct  a    frequency  table  for a given set of data;   Discrete and continuous variables.  Ungrouped and grouped data.      3. determine  class  features  for  a  given set of data;   Class  interval,  class boundaries,  class  limits,  class  midpoint, class width.      4. construct statistical diagrams;"
  },
  {
    "title": "CSEC Mathematics - Part 84",
    "content": "ass width.      4. construct statistical diagrams;  Pie  charts,  bar  charts,  line  graphs,  histograms with  bars of equal width and frequency polygons.      5. determine measures of central  tendency  for  raw,  ungrouped  and grouped data;   Ungrouped data: mean, median and mode  Grouped  data: modal class,  median  class  and the  estimate of the mean.       6. determine   when   it   is   most  appropriate  to  use  the  mean,  median    and    mode    as    the  average for a set of data"
  },
  {
    "title": "CSEC Mathematics - Part 85",
    "content": "nd    mode    as    the  average for a set of data;     Levels    of measurement (measurement    scales):  nominal, ordinal, interval and ratio.   Sets with extreme values or recurring values.  7. determine the   measures   of  dispersion   (spread)   for   raw,  ungrouped and grouped data;   Range,   interquartile   range   and  semi-interquartile  range; estimating these measures for grouped data.      8. use    standard    deviation    to  compare sets of data;   No  calculation  of  the  sta"
  },
  {
    "title": "CSEC Mathematics - Part 86",
    "content": "pare sets of data;   No  calculation  of  the  standard  deviation  will  be   required.      CXC 05/G/SYLL 16  www.cxc.org  SECTION 5: STATISTICS (cont’d)          Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers are advised to engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;     (b) games and quizzes;    (c) appropriate   software   (for   example,"
  },
  {
    "title": "CSEC Mathematics - Part 87",
    "content": "(c) appropriate   software   (for   example,   use   of   applications   to   generate   and   solve  statistical problems including charts and calculating measures of central tendencies);    (d) examples  of  statistics  drawn  from  newspapers,  magazines  and  other  sources  of  current affairs; and,    (e) online demonstrative videos.    SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:      9. draw   cumulative   frequency  curve (Ogive);   Appropriate s"
  },
  {
    "title": "CSEC Mathematics - Part 88",
    "content": "lative   frequency  curve (Ogive);   Appropriate scales for axes.  Class boundaries as domain.      10. analyse statistical diagrams;  Finding  the  mean,  mode,  median, range,  quartiles,  interquartile  range, semi-interquartile  range;  trends  and patterns.      11. determine  the  proportion  or  percentage   of   the   sample  above or below a given value  from   raw   data, frequency  table or cumulative  frequency curve;         12. identify the sample space for  simple experiment;   In"
  },
  {
    "title": "CSEC Mathematics - Part 89",
    "content": "tify the sample space for  simple experiment;   Including the use of coins, dice and playing cards.  The use of contingency tables.      13. determine  experimental  and  theoretical   probabilities   of   simple events; and,   The use of contingency tables.  Addition   for   exclusive   events;   multiplication   for  independent events.      14. make inference(s) from  statistics.   Raw data, tables, diagrams, summary statistics.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 5: STATISTICS (cont’d)"
  },
  {
    "title": "CSEC Mathematics - Part 90",
    "content": "LL 16  www.cxc.org  SECTION 5: STATISTICS (cont’d)      2. Explore the link between statistics and other disciplines, for example:    (a) Music: comparing record sales of various artistes, number of weeks artistes are in the  top ten chart;    (b) Sciences:  statistics  (birth  and  death  rates)  on  various  types  of  populations:  people,  plants and animals;    (c) Geography: track rain fall, population count and density;    (d) Art and Architecture: average floor size of rooms in a buildin"
  },
  {
    "title": "CSEC Mathematics - Part 91",
    "content": "itecture: average floor size of rooms in a buildings, house lots;     (e) Health  and  family  life:  monitoring  weight  and  height,  average  amounts  of  calories,  nutritional facts; and,    (f) Business studies: Gross Domestic Product, predicting sales, purchasing decision.    3. Discuss when it is most appropriate to use Nominal, Ordinal, Interval or Ratio scales.    4. Use the class of students as the population and extract samples to investigate concepts such  as bias and sampling, meas"
  },
  {
    "title": "CSEC Mathematics - Part 92",
    "content": "estigate concepts such  as bias and sampling, measures of central tendencies and spread.        CXC 05/G/SYLL 16  www.cxc.org   SECTION 6: ALGEBRA      GENERAL OBJECTIVES    On completion of this Section, students should:    1. appreciate the use of algebra as a language and a form of communication;    2. appreciate the role of symbols and algebraic techniques in solving problems in mathematics  and related fields; and,    3. demonstrate the ability to reason with abstract entities.      SPECIF"
  },
  {
    "title": "CSEC Mathematics - Part 93",
    "content": "lity to reason with abstract entities.      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:      1. use   symbols   to represent  numbers, operations,  variables and relations;   Symbolic representation.      2. translate  between algebraic  symbols and worded  expressions;         3. evaluate arithmetic  operations involving  directed numbers;         4. simplify algebraic  expressions   using the   four  basic operations;       5. substitute numbers for  varia"
  },
  {
    "title": "CSEC Mathematics - Part 94",
    "content": "operations;       5. substitute numbers for  variables in algebraic  expressions;         6. evaluate expressions  involving binary  operations  (other  than  the  four  basic  operations);   Commutative, associative and distributive properties.        7. apply the  distributive  law to  factorise or expand algebraic  expressions;   For example,   푥 ( 푎+푏 ) = 푎푥+푏푥 푎푛푑   (푎+푏)(푥+푦) =푎푥+푏푥+푎푦+푏푦.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 6: ALGEBRA (cont’d)      SPECIFIC OBJECTIVES  CONTENT/ EXPL"
  },
  {
    "title": "CSEC Mathematics - Part 95",
    "content": "A (cont’d)      SPECIFIC OBJECTIVES  CONTENT/ EXPLANATORY NOTES      Students should be able to:      8. simplify algebraic fractions;  The four basic operation on algebraic fractions.      9. use  the  laws  of  indices  to  manipulate expressions with  integral indices;   For m 휖 ℤ, n 휖 ℤ.  (i)        푥 푚 ×푥 푛 =푥 푚+푛   (ii)      nm n m x x x     (iii)      nm n m xx      (iv)      m x   m x 1       10. solve linear equations in one  unknown;         11. solve    simultaneous    linear"
  },
  {
    "title": "CSEC Mathematics - Part 96",
    "content": "nown;         11. solve    simultaneous    linear  equations, in two unknowns,  algebraically;         12. solve a simple linear  inequality in one unknown;         13. change the subject of  formulae;   Including equations involving roots and powers.      14. factorise algebraic  expressions;     Expressions of the type:  푎 2  − 푏 2  ;    푎푥 + 푏푥 + 푎푦 + 푏푦   푎푥 2  + 푏푥 + 푐   where 푎,푏, and 푐 are integers and 푎≠0      15. rewrite a quadratic  expression in the form  2 ()axhk ;    Completing th"
  },
  {
    "title": "CSEC Mathematics - Part 97",
    "content": "ression in the form  2 ()axhk ;    Completing the square of a quadratic expression.      16. solve    quadratic    equations  algebraically;     Formula   and   by   methods of factorisation and  completing the square.      22 2baba   CXC 05/G/SYLL 16  www.cxc.org  SECTION 6: ALGEBRA (cont’d)      17. solve word problems;     Linear equation, Linear inequalities, two  simultaneous  linear  equations,  quadratic equations.  Applications  to  other  subjects  for  example  demand  and supply f"
  },
  {
    "title": "CSEC Mathematics - Part 98",
    "content": "ther  subjects  for  example  demand  and supply functions of business studies.    18. solve a  pair  of  equations  in  two    variables    when    one  equation is quadratic or non- linear and the other linear;        19. prove two algebraic  expressions to be identical;     Equations vs. identities.  20. represent  direct  and inverse  variation symbolically; and,        푦 varies directly as 푥:푦∝푥,푦=푘푥   푦 varies inversely as 푥:푦∝ 1 푥 ,푦= 푘 푥   21. solve problems involving  direct  variation"
  },
  {
    "title": "CSEC Mathematics - Part 99",
    "content": "21. solve problems involving  direct  variation    and  inverse  variation.          Suggested Teaching and Learning Activities    To facilitate students’ attainment of  the  objectives of  this  Section,  teachers  are  advised  to  engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;    (b) games and quizzes;    (c) appropriate software (for example, equation solving apps);    (d) examples of algebraic problems drawn from real"
  },
  {
    "title": "CSEC Mathematics - Part 100",
    "content": "(d) examples of algebraic problems drawn from real-life situations; and,    (e) online demonstrative videos.    2. Explore the link between algebra and other disciplines, for example:    (a) Music: the use of music symbols;    (b) Sciences and nature: rearranging scientific formulae;     (c) Architecture: determine the size or amounts of tiles/windows/doors of a floor or wall;  and,    (d) Business studies: solving equations to determine profit/loss, demand and supply.    CXC 05/G/SYLL 16  www.c"
  },
  {
    "title": "CSEC Mathematics - Part 101",
    "content": "oss, demand and supply.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 6: ALGEBRA (cont’d)      3. Introduce students to symbolic representation using examples drawn from everyday life such  as safety symbols, road signs and other familiar informational and warning signs.    4. Promote  appropriate  use  of  variables.    For  example, differentiate  between 5 푚 as  an  abbreviation for 5 metres and 5푚, where 푚 represent the number of mangoes bought.    5. Explore the concept of equality through the"
  },
  {
    "title": "CSEC Mathematics - Part 102",
    "content": "5. Explore the concept of equality through the use of:    (a) Pan Balance activities with numbers (8 + 4 =   푥   – 2) and shapes; and,    (b) Hands-on Algebra.    6. Use  manipulatives  such  as  integer  chips,  algebra  tiles  and  other appropriate  materials  to  develop the understanding of:    (a) Operations with integers.    (b) Simplifying algebraic expressions (adding/subtracting like terms).    (c) Multiplying binomials of power 1.    (d) Solving linear equations with one unknown."
  },
  {
    "title": "CSEC Mathematics - Part 103",
    "content": "(d) Solving linear equations with one unknown.    (e) Rearranging an equation/formula.    7. Conduct labs to assist students in the efficient use of calculators.  For example: to explore the  order of operations, to evaluate expressions with exponents and roots.       CXC 05/G/SYLL 16  www.cxc.org   SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS      GENERAL OBJECTIVES    On completion of this Section, students should:    1. appreciate the importance of relations in Mathematics;    2. appreciate"
  },
  {
    "title": "CSEC Mathematics - Part 104",
    "content": "nce of relations in Mathematics;    2. appreciate that many mathematical relations may be represented in symbolic form, tabular  or pictorial form; and,    3. appreciate the usefulness of concepts in relations, functions and graphs to solve  real-world  problems.      SPECIFIC OBJECTIVES    CONTENT/ EXPLANATORY NOTES       Students should be able to:      1. explain basic concepts  associated with relations;   Concept  of  a  relation,  types  of  relations, examples  and non-examples of relatio"
  },
  {
    "title": "CSEC Mathematics - Part 105",
    "content": "relations, examples  and non-examples of relations, domain, range, image,  co-domain.      2. represent     a     relation     in  various ways;   Set  of  ordered  pairs,  arrow  diagrams,  graphically,  algebraically.      3. state the characteristics   that define a function;   Concept of a function, examples and non-examples of    functions.      4. use functional notation;   For  example, 푓∶ 푥  푥 2 ;  or 푓(푥) = 푥 2  as  well  as  푦 = 푓(푥) for  given  domains. The  inverse function  푓 −1"
  },
  {
    "title": "CSEC Mathematics - Part 106",
    "content": "for  given  domains. The  inverse function  푓 −1 ( 푥 ) . Composite functions 푓푔=푓 [ 푔 ( 푥 ) ] .      5. distinguish between a  relation and a function;   Ordered  pairs,  arrow  diagram,  graphically  (vertical  line test).      6. draw graphs of linear  functions;   Concept of linear function, types of linear function  (푦 = 푐; 푥 = 푘; 푦 = 푚푥 + 푐;   where 푚,푐 and 푘 are real numbers).      7. determine  the  intercepts  of  the graph of linear  functions;   푥-intercepts    and 푦-intercepts,    gr"
  },
  {
    "title": "CSEC Mathematics - Part 107",
    "content": "nctions;   푥-intercepts    and 푦-intercepts,    graphically    and  algebraically.      8. determine  the  gradient  of a  straight line;   Definition of gradient/slope.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS (cont’d)      SPECIFIC OBJECTIVES    CONTENT/ EXPLANATORY NOTES      Students should be able to:      9. determine  the  equation  of  a  straight line;       Using:    (a) the graph of the line;    (b) the co-ordinates of two points on the line;    (c)"
  },
  {
    "title": "CSEC Mathematics - Part 108",
    "content": "the co-ordinates of two points on the line;    (c) the gradient and one point on the line; and,    (d) one point on the line or its gradient, and its  relationship to another line.      10. solve  problems  involving  the  gradient     of     parallel     and  perpendicular lines;         11. determine  from  co-ordinates  on a line segment:                 (a) the length; and,                 (b) the   co-ordinates   of  the midpoint.     The  concept  of  magnitude  or  length, concept  of  mi"
  },
  {
    "title": "CSEC Mathematics - Part 109",
    "content": "oncept  of  magnitude  or  length, concept  of  midpoint.  12. solve a  pair  of  simultaneous  linear equations in two  unknowns graphically;   Intersection of graphs.      13. represent    the    solution    of  linear inequalities    in    one  variable using:    (a) set notation;    (b) the number line; and,    (c) graph.       14. draw  a  graph  to  represent  a  linear inequality in two  variables;                 CXC 05/G/SYLL 16  www.cxc.org  SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS ("
  },
  {
    "title": "CSEC Mathematics - Part 110",
    "content": ".org  SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS (cont’d)      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:      15. use linear programming  techniques     to graphically  solve problems involving two  variables;         16. derive   the   composition   of   functions;   Composite function of no more than two functions,  for    example, 푓푔, 푓 2  given 푓 and 푔.    Non- commutativity of composite  functions (푓푔≠푔푓) in  general.      17. state the relationship"
  },
  {
    "title": "CSEC Mathematics - Part 111",
    "content": "푔푓) in  general.      17. state the relationship  between  a  function  and  its  inverse;   The concept of the inverse of a function;   The composition of inverse functions  푓 ( 푥 )  and 푓 −1 ( 푥 )  is commutative and results in 푥.       18. derive    the    inverse    of    a  function;    푓 −1 , ( 푓푔 ) −1       19. evaluate a function 푓(푥) at a  given value of 푥;      푓 ( 푎 ) ,푓 −1 ( 푎 ) ,푓푔 ( 푎 ) , where 푎∈ℝ.  20. draw  and  use  the  graph  of  a  quadratic function to identify  its feature"
  },
  {
    "title": "CSEC Mathematics - Part 112",
    "content": "of  a  quadratic function to identify  its features:    (a) an element   of   the  domain   that   has a  given image;    (b) the  image  of  a  given  element in the  domain;    (c) the maximum or  minimum    value    of  the function; and,    (d) the  equation  of  the  axis of symmetry.     Roots of the equation.                CXC 05/G/SYLL 16  www.cxc.org  SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS (cont’d)      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able t"
  },
  {
    "title": "CSEC Mathematics - Part 113",
    "content": "T/EXPLANATORY NOTES      Students should be able to:    21. interpret    the    graph    of    a  quadratic function to  determine:      Concepts of gradient of a curve at a point, tangent,  turning point.  Roots of the function.    (a) the   interval   of   the  domain  for  which  the  elements of the range  may  be  greater  than  or  less  than  a  given  point;    (b) an   estimate   of   the  value  of  the  gradient  at a given point; and,    (c) intercepts of the  function.       22. det"
  },
  {
    "title": "CSEC Mathematics - Part 114",
    "content": "(c) intercepts of the  function.       22. determine the equation of the  axis   of   symmetry and   the  maximum  or  minimum  value  of a quadratic function  expressed in the form  푎(푥 + ℎ)2 + 푘;          23. sketch the graph of a  quadratic  function  expressed  in the form   푦=푎(푥+ℎ)2 + 푘 and  determine the number  of  roots;         24. draw    graphs    of    non-linear  functions;   푦=푎푥 푛  where 푛 = −1,−2 and +3 and 푎 is  a  constant. Including distance-time and speed-time.      25."
  },
  {
    "title": "CSEC Mathematics - Part 115",
    "content": "Including distance-time and speed-time.      25.         interpret graphs of functions;  and,   Including   distance-time   graphs   and   speed-time  graphs.       26. solve problems involving   graphs of linear and non-linear  functions.          CXC 05/G/SYLL 16  www.cxc.org  SECTION 7: RELATIONS, FUNCTIONS AND GRAPHS (cont’d)      Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers are advised to engage  students in th"
  },
  {
    "title": "CSEC Mathematics - Part 116",
    "content": "on, teachers are advised to engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;     (b) games and quizzes;    (c) appropriate  software  (for  example,  the  use  of  graphing  apps  in  demonstrating  properties of graphs);    (d) examples of functions and graphs obtained from magazines and newspapers; and,    (e) online demonstrative videos.    2. Explore the link between relations, functions and graphs and other disciplines, f"
  },
  {
    "title": "CSEC Mathematics - Part 117",
    "content": "ons, functions and graphs and other disciplines, for example:    (a) Music: create a mapping of the number of beats to the music notes;    (b) Sciences:  plot  graphs  of  sound  waves,  path  of  a  projectile  such  as  a  shot  putt,  2- dimensional graph of a terrain;    (c) Art and Geography: identifying locations on a map using coordinate systems, the use  of GPS technology;     (d) Architecture: gradient of a roof, ramp;    (e) Health  and  family  life:  plotting  a  graph  of  weight  a"
  },
  {
    "title": "CSEC Mathematics - Part 118",
    "content": "family  life:  plotting  a  graph  of  weight  against  time  and  finding  the  rate  using the gradient of a function; and,    (f) Business  studies:  finding  marginal  cost  using  the  concept  of  gradient,  break  even  analysis.    3. Students can be provided with samples of ordered pairs and be required to determine the  domain, the range and whether the relation is or is not a function.    4. Encourage students to describe a function based on its properties and not the independent  v"
  },
  {
    "title": "CSEC Mathematics - Part 119",
    "content": "based on its properties and not the independent  variable.    5. Use functions machines to show input and output.    6. Demonstrate relationships between a function and its inverse: for example doubling will  undo halving, geometric interpretation as a reflection in the line 푦=푥.    7. Relate reverse processes of real life situations to functions and their inverses, for example,  the route from home to school.    8. Use real life examples of items that fit related categories to identify common c"
  },
  {
    "title": "CSEC Mathematics - Part 120",
    "content": "s that fit related categories to identify common characteristics  as an analogy to linear programing.      CXC 05/G/SYLL 16  www.cxc.org   SECTION 8: GEOMETRY AND TRIGONOMETRY       GENERAL OBJECTIVES    On completion of this Section, students should:    1. appreciate  the  notion  of space  as  a  set  of  points  with  subsets  of that  set (space)  having  properties related to other mathematical systems;     2. understand the properties and relationship among geometrical objects;    3. unde"
  },
  {
    "title": "CSEC Mathematics - Part 121",
    "content": "relationship among geometrical objects;    3. understand the properties of transformations;    4. demonstrate the ability to use geometrical concepts to model and solve real world problems;  and,    5. appreciate the power of trigonometrical methods in solving authentic problems.      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:       1. explain concepts  relating  to  geometry;   Points,  lines,  parallel  lines,  intersecting  lines  and  perpendicular   li"
  },
  {
    "title": "CSEC Mathematics - Part 122",
    "content": "nes,  intersecting  lines  and  perpendicular   lines,   line   segments,   rays,   curves,  planes; types of angles; number of faces, edges and  vertices.      2. draw   and   measure   angles  and line segments accurately  using appropriate  instruments;          3. construct  lines, angles,  and  polygons  using  appropriate  instruments;   Parallel and perpendicular lines.  Bisecting line segments and angles.  Constructing a line perpendicular to another line, L,  from a point that is not on"
  },
  {
    "title": "CSEC Mathematics - Part 123",
    "content": "r to another line, L,  from a point that is not on the line, L.  Triangles, quadrilaterals, regular and irregular  polygons.    Angles   include 30 표 ,45 표 ,60 표 ,90 표 ,120 표  and   their  combinations.      4. identify the type(s) of  symmetry   possessed   by   a  given plane figure;   Line(s)  of  symmetry,  rotational  symmetry,  order  of  rotational symmetry.               CXC 05/G/SYLL 16  www.cxc.org  SECTION 8: GEOMETRY AND TRIGONOMETRY (cont’d)      SPECIFIC OBJECTIVES    CONTENT/EXPLA"
  },
  {
    "title": "CSEC Mathematics - Part 124",
    "content": "(cont’d)      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:      5. solve    geometric    problems  using properties of:    (a) lines, angles, and  polygons;                          (b) congruent triangles;    (c) similar figures;    (d) faces, edges and  vertices of solids;  and,    (e) classes of solids.   Determining and justifying the measure of angles:  adjacent  angles,  angles  at  a  point,  supplementary  angles,  complementary  angles,  vertically"
  },
  {
    "title": "CSEC Mathematics - Part 125",
    "content": "ary  angles,  complementary  angles,  vertically  opposite  angles.    Parallel   lines   and   transversals,   alternate   angles,  corresponding angles, co-interior angles.     Triangles:   Equilateral,   Isosceles,   scalene, obtuse,  right, acute.     Quadrilaterals:   Square,   rectangle,   rhombus,   kite,  parallelogram, trapezium.    Other polygons.    Cases of congruency.         Properties of similar triangles            Prisms, pyramids, cylinders, cones, sphere.        6. solve     g"
  },
  {
    "title": "CSEC Mathematics - Part 126",
    "content": "s, cylinders, cones, sphere.        6. solve     geometric     problems  using properties of circles and  circle theorems;   Radius,     diameter,     chord,     circumference,     arc,  tangent, segment, sector, semicircle, pi.    Determining  and  justifying  angles  using  the circle  theorems:    The  angle  which  an  arc  of  a  circle  subtends  at  the  centre of a circle is twice the angle it subtends at any  point on the remaining part of the circumference.    Angles at the circumferen"
  },
  {
    "title": "CSEC Mathematics - Part 127",
    "content": "of the circumference.    Angles at the circumference in the same segment of  a  circle  and  subtended  by  the  same  arc/chord  are  equal.    The  angle  at  the  circumference  subtended by  the  diameter is a right angle.    The  opposite  angles  of  a  cyclic  quadrilateral  are  supplementary.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 8: GEOMETRY AND TRIGONOMETRY (cont’d)      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:       The exterior angle of a"
  },
  {
    "title": "CSEC Mathematics - Part 128",
    "content": "should be able to:       The exterior angle of a cyclic quadrilateral is equal to  the interior opposite angle.    The angle between a tangent to a circle and a chord  through the point of contact is equal to the angle in  the alternate segment.    A   tangent   of   a   circle   is   perpendicular   to   the  radius/diameter of that circle at the point of contact.    The lengths of two tangents from an external point  to the points of contact on the circle are equal.    The line joining the ce"
  },
  {
    "title": "CSEC Mathematics - Part 129",
    "content": "n the circle are equal.    The line joining the centre of a circle to the midpoint  of a chord is perpendicular to the chord.    7. represent   translations   in a  plane using vectors;    Column matrix notation .      8. determine  and  represent  the  location of:    (a) the image of an  object under a  transformation; and,    (b) an   object   given   the  image under a  transformation.   Translation in the plane.     Reflection in a line in that plane.     Rotation  about  a  point  (the  ce"
  },
  {
    "title": "CSEC Mathematics - Part 130",
    "content": "hat plane.     Rotation  about  a  point  (the  centre  of  rotation)  in  that plane.     Enlargement in the plane.        9. state the relationship  between   an   object   and   its  image   in   the   plane under  geometric transformations;   Orientation, similarity, congruency.        10. describe a     transformation  given an object and its image;   Translation: vector notation.   Reflection: mirror line/ axis of symmetry.   Rotation:   centre   of   rotation,   angle   of   rotation,  di"
  },
  {
    "title": "CSEC Mathematics - Part 131",
    "content": "ntre   of   rotation,   angle   of   rotation,  direction of rotation.  Enlargement: centre, scale factor 푘 such that   | 푘 | >1 or 0< | 푘 | <1.      11. locate the  image  of an  object  under     a     combination     of  transformations;           Combination of any two of:    (a) enlargement;    (b) translation;    (c) rotation; and,    (d) reflection.          y x   CXC 05/G/SYLL 16  www.cxc.org  SECTION 8: GEOMETRY AND TRIGONOMETRY (cont’d)      SPECIFIC OBJECTIVES    CONTENT/EXPLA"
  },
  {
    "title": "CSEC Mathematics - Part 132",
    "content": "(cont’d)      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:      12. use Pythagoras’ theorem to  solve problems;         13. define the     trigonometric  ratios  of  acute  angles  in  a  right triangle;     Sine, Cosine, Tangent.  14. relate objects in the physical  world to geometric objects;    Angle of elevation, angle of depression, bearing.      15. apply the trigonometric  ratios to solve problems;   Spatial geometry   and   scale   drawing,   angles"
  },
  {
    "title": "CSEC Mathematics - Part 133",
    "content": "atial geometry   and   scale   drawing,   angles   of  elevation and depression.      16. use the sine and cosine rules  to solve problems  involving  triangles; and,         17. solve     problems     involving  bearings.   Relative  position  of  two  points  given  the  bearing  of  one  point  with  respect  to  the  other;  bearing  of  one  point  relative  to  another  point  given  the  position  of  the  points. Bearing  written  in  3-digit  format  for  example 060 표 .      Suggested"
  },
  {
    "title": "CSEC Mathematics - Part 134",
    "content": "igit  format  for  example 060 표 .      Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers are advised to engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;     (b) games and quizzes;    (c) appropriate   software   (for example,  3-D   sketching   software,   2-D   apps   such   as  Geogebra);    (d) Concrete models of geometric figures in common places;"
  },
  {
    "title": "CSEC Mathematics - Part 135",
    "content": "ete models of geometric figures in common places; and,    (e) online demonstrative videos.          CXC 05/G/SYLL 16  www.cxc.org  SECTION 8: GEOMETRY AND TRIGONOMETRY (cont’d)      2. Explore the link between geometry and trigonometry and other disciplines, for example:    (a) Music: Exploring geometric properties of musical instruments;    (b) Sciences: orbital locus of planets, galaxies; geometry in nature: leaves, shells, waves,  spherical objects;    (c) Geography: the use of bearings;"
  },
  {
    "title": "CSEC Mathematics - Part 136",
    "content": "jects;    (c) Geography: the use of bearings;     (d) Art and Architecture: geometry of structures, triangles, circles; using geometric figures  to create art such as paintings, tessellations; symmetry, similarity and congruency in  structures such as the roof; and,    (e) Health and family life: the geometry of postures in exercise and athletics.    3.  Explore concepts of elevation, depression, bearings in real life situations.    4. Estimate distances and area using geometry, pictures with a"
  },
  {
    "title": "CSEC Mathematics - Part 137",
    "content": "istances and area using geometry, pictures with a known distance.    5. Engage students in activities of detecting which of two objects is taller.    6. Construction of shapes for art work such as collages.     7. Use instruments and strings to locate points of a defined locus.       CXC 05/G/SYLL 16  www.cxc.org   SECTION 9: VECTORS AND MATRICES      GENERAL OBJECTIVES    On completion of this Section, students should:    1. demonstrate  the  ability  to use  vector  notation and  concepts  to"
  },
  {
    "title": "CSEC Mathematics - Part 138",
    "content": "bility  to use  vector  notation and  concepts  to model  and  solve real-world  problems;    2. develop awareness of the existence of certain mathematical objects, such as matrices, that  do not satisfy the same rules of operation as the real number system; and,    3. appreciate   the   use   of vectors   and matrices in representing certain   types   of   linear  transformations in the plane.      SPECIFIC OBJECTIVES    CONTENT/EXPLANATORY NOTES      Students should be able to:      1. explain"
  },
  {
    "title": "CSEC Mathematics - Part 139",
    "content": "S      Students should be able to:      1. explain concepts  associated  with  vectors;   Concept of a vector, magnitude, unit vector, direction,  scalar.    Scalar multiples: parallel vectors, equal vectors, inverse  vectors.      2. simplify expressions involving  vectors;   Vector algebra: addition, subtraction, scalar  multiplication.     Vector geometry: triangle law, parallelogram law.      3. write   the   position vector   of a  point 푃(푎,푏) as 푂푃 ⃗⃗⃗⃗⃗  =( 푎 푏 )"
  },
  {
    "title": "CSEC Mathematics - Part 140",
    "content": ",푏) as 푂푃 ⃗⃗⃗⃗⃗  =( 푎 푏 )                           where 푂 is the origin (0,0);   Displacement and position vectors; including the use of  co-ordinates in the x-y plane to identify and determine  displacement and position vectors.        4. determine the   magnitude   of   a  vector;   Including unit vectors.      5. determine the direction of a vector;        6. use  vectors to solve  problems  in  geometry;   Points  in  a  straight  line, Parallel  lines;  displacement,  velocity, weight."
  },
  {
    "title": "CSEC Mathematics - Part 141",
    "content": "allel  lines;  displacement,  velocity, weight.      7. explain basic concepts  associated  with matrices;   Concept  of  a  matrix,  row,  column,  square,  identity  rectangular, order.      8. solve   problems   involving   matrix  operations;   Addition and subtraction of matrices of the same order.  Scalar multiples.    Multiplication of conformable matrices.    Equality, non-commutativity of matrix multiplication.    CXC 05/G/SYLL 16  www.cxc.org  SECTION 9: VECTORS AND MATRICES (cont’d)"
  },
  {
    "title": "CSEC Mathematics - Part 142",
    "content": "xc.org  SECTION 9: VECTORS AND MATRICES (cont’d)      SPECIFIC OBJECTIVES    CONTENT/ EXPLANATORY NOTES      Students should be able to:      9. evaluate the  determinant  of  a ‘2 x 2’ matrix;         10. define the multiplicative  inverse    of    a non-singular  square matrix;   Identity for the square matrices.        11. obtain  the  inverse  of  a  non- singular ‘2 x 2’ matrix;   Determinant and adjoint of a matrix.      12. determine a  ‘2 x 2’ matrix  associated  with  a specified  trans"
  },
  {
    "title": "CSEC Mathematics - Part 143",
    "content": "x 2’ matrix  associated  with  a specified  transformation; and,   Transformation     which     is equivalent to     the  composition of two linear transformations in a plane  (where the origin remains fixed).     (a) Reflection in: the 푥-axis, 푦-axis,                the lines 푦 = 푥 and 푦 = –푥.     (b) Rotation  in  a  clockwise  and  anticlockwise  direction    about    the    origin; the    general  rotation matrix.    (c) Enlargement with centre at the origin.      13. use matrices  to  solv"
  },
  {
    "title": "CSEC Mathematics - Part 144",
    "content": "tre at the origin.      13. use matrices  to  solve  simple  problems in Arithmetic,  Algebra and Geometry.     Data  matrices,  equality. Use  of  matrices  to  solve  linear simultaneous equations with two unknowns.    Problems involving determinants are restricted to 2x2  matrices. Matrices of order greater than ‘mxn’ will  not be set, where m ≤4, n ≤4.       Suggested Teaching and Learning Activities    To facilitate students’ attainment of the objectives of this Section, teachers are advise"
  },
  {
    "title": "CSEC Mathematics - Part 145",
    "content": "he objectives of this Section, teachers are advised to engage  students in the teaching and learning activities listed below.    1. Encourage the use of:    (a) calculators;     (b) games and quizzes;    (c) appropriate software (for example, the use of matrix solver apps);      CXC 05/G/SYLL 16  www.cxc.org  SECTION 9: VECTORS AND MATRICES (cont’d)      (d) data matrix that are extracted from sources such as grades spread sheet; and,    (e) online demonstrative videos.    2. Explore the link be"
  },
  {
    "title": "CSEC Mathematics - Part 146",
    "content": "ne demonstrative videos.    2. Explore the link between vectors and matrices and other disciplines, for example:    (a) Sciences & Nature: the effects of a river current as a vector quantity;    (b) Art  & Geography: dividing  an  image/photo  into  a  matrix  of  smaller  images  for  enlargement; and,    (c) Architecture: representing  items  in  the  class  room  such  as  a tile  on  the  floor  using  vector notation.    3. Tabulate data into matrix form.    4. Finding hidden treasures usin"
  },
  {
    "title": "CSEC Mathematics - Part 147",
    "content": "o matrix form.    4. Finding hidden treasures using clues given as vectors.    5. The use of matrices as operators in transformation.                                                               CXC 05/G/SYLL 16  www.cxc.org   GUIDELINES FOR THE SCHOOL-BASED ASSESSMENT      RATIONALE    School-Based Assessment (SBA) is an integral part of student assessment in the course covered by this  syllabus. It is intended to assist students in acquiring certain knowledge, skills and attitudes that are"
  },
  {
    "title": "CSEC Mathematics - Part 148",
    "content": "certain knowledge, skills and attitudes that are  critical  to  the  subject. The activities  for  the  School-Based Assessment are linked to the “Suggested  Practical Activities” and should form part of the learning activities to enable the student to achieve the  objectives of the syllabus.    During the  course  of  study  of the  subject,  students  obtain  marks  for  the  competencies they  develop  and demonstrate in undertaking their SBA assignments. These marks contribute to the final m"
  },
  {
    "title": "CSEC Mathematics - Part 149",
    "content": "assignments. These marks contribute to the final marks and  grades that are awarded to students for their performance in the examination.    The guidelines provided in this syllabus for selecting appropriate tasks are intended to assist teachers  and students in selecting assignments that are valid for the purpose of the SBA.  These guidelines are  also intended to assist teachers in awarding marks according to the degree of achievement in the SBA  component of the course. In order to ensure tha"
  },
  {
    "title": "CSEC Mathematics - Part 150",
    "content": "A  component of the course. In order to ensure that the scores awarded by teachers are not out of line  with  the  CXC  standards,  the  Council  undertakes  the  moderation  of  a  sample  of  SBA  assignments  marked by each teacher.    School-Based Assessment provides an opportunity to individualise a part of the curriculum to meet the  needs of students. It facilitates feedback to the students at various stages of the experience. This helps  to  build  the  self-confidence  of  the  students"
  },
  {
    "title": "CSEC Mathematics - Part 151",
    "content": "to  build  the  self-confidence  of  the  students  as  they  proceed  with  their  studies.    School-Based  Assessment further facilitates the development of critical skills and that allows the students to function  more effectively in their chosen vocation. School-Based Assessment’ therefore, makes a significant and  unique contribution to the development of relevant skills by the students. It also provides an instrument  for testing them and rewarding them for their achievements.    The Cari"
  },
  {
    "title": "CSEC Mathematics - Part 152",
    "content": "rewarding them for their achievements.    The Caribbean Examinations Council seeks to ensure that the School Based Assessment scores are valid  and  reliable  estimates  of  accomplishment. The  guidelines  provided  in  this  syllabus  are  intended  to  assist in doing so.      THE PROJECT     The project may require candidates to collect data or demonstrate the application of Mathematics in  everyday  situations. The  length  of  the  report  should  be  maximum  1000  words,  not  including"
  },
  {
    "title": "CSEC Mathematics - Part 153",
    "content": "should  be  maximum  1000  words,  not  including  appropriate quotations, sources, charts, graphs, tables, pictures, references and appendices. Students  are encouraged to work in groups.    The activities related to the Project should be integrated into the classroom instruction so as to enable  the candidates to learn and practice the skills needed to complete the project.    Some time in class should be allocated for general discussion of project work; allowing for discussion  between teache"
  },
  {
    "title": "CSEC Mathematics - Part 154",
    "content": "ject work; allowing for discussion  between teacher and student, and student and student.            CXC 05/G/SYLL 16  www.cxc.org  Role of the Teacher     The role of the teacher is to:    1. Guide students in identifying suitable topics for the project for the School Based Assessment.    2. Provide guidance throughout the project and guide the candidate through the SBA by helping  to resolve any issues that may arise.    3. Ensure  that  the  project  is  developed  as  a  continuous  exercise"
  },
  {
    "title": "CSEC Mathematics - Part 155",
    "content": "roject  is  developed  as  a  continuous  exercise  that  occurs  during  scheduled  class hours as well as outside class times.    4. Assess the project and record the marks.  Hardcopies of the completed documents should be  kept by both the teacher and the student.  The teacher should use the mark scheme provided  by CXC and include comments pertinent to the conduct of the assessment. Only the final score  is to be indicated on the record sheets which are submitted to CXC® electronically via t"
  },
  {
    "title": "CSEC Mathematics - Part 156",
    "content": "s which are submitted to CXC® electronically via the SBA  data capture module on the Online Registration System (ORS) on the Council’s website.  Assignment    The School Based Assessment consists of ONE project to be marked by the teacher in accordance with  CXC guidelines.      Why a project?    The study  of mathematics  is  essential  to  everyday  life.    It  pervades  almost  every  aspect  of  our  daily  activities: planning a picnic, baking a cake, comparing performances in a 100 metre"
  },
  {
    "title": "CSEC Mathematics - Part 157",
    "content": "ing a cake, comparing performances in a 100 metre race, shopping for  groceries, all require applying mathematical concepts and principles to investigate, describe, explain  or predict some real world phenomena.    However,  to  those  engaged  in  learning  mathematics  in  secondary  schools, the  links  between  mathematics and the real world are often not recognized or at least not identified and practised. The  purpose of a project is to encourage students to apply mathematical concepts, sk"
  },
  {
    "title": "CSEC Mathematics - Part 158",
    "content": "ourage students to apply mathematical concepts, skills and procedures  to  investigate,  describe  and  explain real  world  phenomena,  to  practise  problem-solving,  and  to  evaluate results. And these experiences are to be realized by encouraging all students to:    1. Define problems in personal ways, especially by how the problems were motivated;    2. Discuss  the  problems  with  (a)  their  teachers,  (b)  their  classmates  and  (c)  their  parents  and  knowledgeable adults;    3. De"
  },
  {
    "title": "CSEC Mathematics - Part 159",
    "content": "heir  parents  and  knowledgeable adults;    3. Develop ways of solving the problems of interest and of curiosity;    4. Record their problems and the ways they would attempt to find solutions using:    words   charts   models  symbols  tables   algorithms  diagrams  figures    5. Develop positive attitudes towards the methods of mathematics, use of mathematics and the  enjoyment associated with knowing mathematics and solving mathematical problems; and,      CXC 05/G/SYLL 16  www.cxc.org  6. Ex"
  },
  {
    "title": "CSEC Mathematics - Part 160",
    "content": "ms; and,      CXC 05/G/SYLL 16  www.cxc.org  6. Extend mathematical processes and products to exploring and understanding other subjects  on the school curriculum.    Sample Areas of Research May Include:    Hire Purchase or Cash?    1. An  explanation  of  the  advantages  and  disadvantages  of  hire  purchase,  using  data  collected  from at least two stores.    Sports Utility Vehicles versus Cars      2. Comparative  analyses  of  the  costs  of  different  types  of  vehicles,  considering"
  },
  {
    "title": "CSEC Mathematics - Part 161",
    "content": "of  different  types  of  vehicles,  considering  fuel  economy,  maintenance and features.      What features should be included in your project?    1. Explaining the mathematical ideas contained in your project.      2. Carrying our practical tasks, using one or more of the following:    (a) Ruler, compasses, protractor    (b) Drawing, constructing, measuring    (c) Counting, looking for patterns, weighing    (d) Calculators, computers, other technological devices      3. Performing calculat"
  },
  {
    "title": "CSEC Mathematics - Part 162",
    "content": "technological devices      3. Performing calculations    (a) Mentally    (b) With paper and pencil    (c) Using calculators      4. Responding orally to mathematics questions asked by the teacher, peers or other interested  persons.      5. Identifying sections of project which:    (a) are to be done inside normal class time and  scheduled by teacher; and,    (b) may be done outside normal class time at student’s convenience    CXC 05/G/SYLL 16  www.cxc.org  Guidelines for students (and their t"
  },
  {
    "title": "CSEC Mathematics - Part 163",
    "content": "www.cxc.org  Guidelines for students (and their teachers)    Main Activities for the Project    1. Stating the task(s) you which to undertake - its nature, scope and focus      2. Planning    (a) What you will do?    (b) How you will do it?    (c) What materials you will need?    (d) What procedures you will use?      3. Carrying out the plan, procedures or activities      4. Recording what you did, how you did it, and why you did what you did, using words (including  mathematical words and phr"
  },
  {
    "title": "CSEC Mathematics - Part 164",
    "content": "using words (including  mathematical words and phrases); diagrams, tables, figures or charts      5. Conclusion    (a) Your findings    (b) Comments on your findings    (c) How to improve your findings    (d) Making your findings more useful      Seven strategies that students use when they are searching for solutions to problems in mathematics.    1. Using simple numbers    - Replace the original numbers with very simple numbers and try to find a solution.  After  the solution has been found, t"
  },
  {
    "title": "CSEC Mathematics - Part 165",
    "content": "a solution.  After  the solution has been found, try the solution with the original numbers.      2. Sketch a simple diagram    - Attempt to understand the problem using your insight from geometry and the physical  arrangements of the spaces around you.          CXC 05/G/SYLL 16  www.cxc.org  3. Make a table of the results    - Try  to  discover  any  pattern  within  the  table.  You  may  reduce  the  size  of  the  table,  rotate the table and view its content from a second perspective."
  },
  {
    "title": "CSEC Mathematics - Part 166",
    "content": "view its content from a second perspective.      4. Guess and check      5. Look for patterns     - Try to create patterns by combining numbers in novel ways      6. Use algebraic symbols to express ideas      7. Make full use of calculators:    (a) Explore number ideas, number patterns and number sense    (b) Highlight estimation skills associated with arithmetic operations (such as ×, ÷, √,)    (c) Check calculations associated with a wide range of applications (from real life)    (d) Focus o"
  },
  {
    "title": "CSEC Mathematics - Part 167",
    "content": "ge of applications (from real life)    (d) Focus on the processes associated with problem-solving          ASSESSMENT CRITERIA    The project will be presented in the form of a report and will have the following parts.     1. Project Title  2. Introduction   3. Method of Data Collection  4. Presentation of Data  5. Analysis of Data  6. Discussion of Findings  7. Conclusion    It will be marked out of a total of 20 marks and the marks will be allocated to each task and profile as  outlined below."
  },
  {
    "title": "CSEC Mathematics - Part 168",
    "content": "cated to each task and profile as  outlined below.        CXC 05/G/SYLL 16  www.cxc.org  Project Descriptors Mark   K C R Total  Project Title       1   Title is clear and concise and relates to a real-world problem 1                  Introduction       4   Objectives are clearly stated and relate to title  1         Comprehensive description of the project   2       Limited description of the project   (1)       Detailed contents page with page numbers  1                  Method of Data Co"
  },
  {
    "title": "CSEC Mathematics - Part 169",
    "content": "page numbers  1                  Method of Data Collection       2   Data  collection  method  is  clearly  described,  appropriate  and  without flaws, where the data is genuinely obtained.   2       Data collection method is stated    (1)            Presentation of Data       5   Data, which is genuinely obtained, is accurate and well organised   2       Data,  which  is  genuinely  obtained, is  presented  but  is  not  well  organised   (1)       Tables/graphs/diagrams/formulas/proofs i"
  },
  {
    "title": "CSEC Mathematics - Part 170",
    "content": "1)       Tables/graphs/diagrams/formulas/proofs included, correctly  labelled, clearly  and  logically  stated, used  appropriately and  reflect the data collected.   2       Tables/graphs/diagrams/formulas/proofs included and reflect the  data collected   (1)       Accurate use of mathematical concepts 1                  Analysis of Data       2   Detailed analysis of findings done, which is coherent and reflects  the data collected and presented.     2     Limited  analysis  of  findings"
  },
  {
    "title": "CSEC Mathematics - Part 171",
    "content": "ented.     2     Limited  analysis  of  findings that  reflects  the  data  collected  and  presented.     (1)              Discussion of findings       2   Statement of findings clearly stated     1     Statement of findings follows from data collected     1              Conclusion       2   Conclusion  was  based  on  findings  and  related  to  the  purpose  of  the project     2     Conclusion related to the purpose of the project      (1)              Overall Presentation       2   In"
  },
  {
    "title": "CSEC Mathematics - Part 172",
    "content": "1)              Overall Presentation       2   Information was communicated logically using correct grammar 2         Information  was  poorly  organised  or  difficult  to  understand  at  times (1)                  Maximum for each profile 6 8 6 20      CXC 05/G/SYLL 16  www.cxc.org  EXEMPLAR    Project Title: Designing a Basketball Hoop - Why Use a Circle?    Introduction: The  purpose  of  this  project  was  to  determine  the  most  suitable  shape  for  a  basketball  hoop.    The  numb"
  },
  {
    "title": "CSEC Mathematics - Part 173",
    "content": "ble  shape  for  a  basketball  hoop.    The  number  of  goals  scored  using  the  traditional  hoop  was  compared to the number scored using square, rectangular and hexagonal hoops.                      Data Collection:  The area enclosed by the circular hoop was calculated and hoops were made using  frames to enclose an area. The dimensions of the frames were calculated to ensure  that a standard basketball could pass through each frame.       The area enclosed by a standard basketball hoop"
  },
  {
    "title": "CSEC Mathematics - Part 174",
    "content": "The area enclosed by a standard basketball hoop is 1641 cm 2 .  Efforts were made  to  use  dimensions  which  would  give  this  approximate  area.    The  hoops  in  the  different shapes were made with the enclosed areas shown.                   Circle Square Rectangle  Hexagon  1641 cm 2  1640 cm 2  1640 cm 2  1644 cm 2        Data Collection Sheet       Name of Student: _________________________________________  Shape    No. of goals  Circle      Square      Rectangle      Hexagon"
  },
  {
    "title": "CSEC Mathematics - Part 175",
    "content": "cle      Square      Rectangle      Hexagon          CXC 05/G/SYLL 16  www.cxc.org  Presentation Data: The  table  below  shows  the  number  of  goals  scored  by each  student,  using  of  each of the hoops.  Each student made 25 goal attempts for each shape.    Hence, there were a total of 300 goal attempts made.       Number of Goals Scored  Student Circle Square Rectangle Hexagon Total  Alan 22 14 09 15 60  Briana 20 12 06 10 48  Chris 17 11 04 14 46  Total 59 37 19 39 154  % success by sha"
  },
  {
    "title": "CSEC Mathematics - Part 176",
    "content": "04 14 46  Total 59 37 19 39 154  % success by shape 78.7 49.3 25.3 52.0    % of scored goals                   (out of 154)  38.3 24.0 12.3 25.3        The graph below shows the percentage of goals scored for each of the shapes.            Analysis of Data: The data collected from the experiment revealed that of the three students, Alan  scored  the  most  goals  and  Chris  the  least.    Although  some  students  were  more  successful  in  scoring,  for  each  student,  the  most  goals  wer"
  },
  {
    "title": "CSEC Mathematics - Part 177",
    "content": "oring,  for  each  student,  the  most  goals  were  scored  with  the  standard basketball hoop which was in the shape of a circle where the success rate  was 79 percent.  Overall, out of the 154 goals scored 38.3 percent were using the  circle, 25.3 percent with the hexagon, 24 percent with the square and 12.3 percent  with the rectangle.           CXC 05/G/SYLL 16  www.cxc.org  Discussion of Findings/   While it is possible to construct a basketball hoop using many   Conclusion:  different"
  },
  {
    "title": "CSEC Mathematics - Part 178",
    "content": "etball hoop using many   Conclusion:  different   shapes,   all   shapes   will   not   give   the   same   results. A  rectangular shaped hoop is  the least suitable shape and the circular  hoop, the most preferred.      Hence, in constructing a basketball hoop, the most appropriate shape  to ensure success in scoring goals is a circle.      Procedures for Reporting and Submitting the School Based Assessment    Teachers  are  required  to record  the mark  awarded  to  each  candidate  under  t"
  },
  {
    "title": "CSEC Mathematics - Part 179",
    "content": "the mark  awarded  to  each  candidate  under  the  appropriate  profile  dimension on the mark sheet provided by CXC.  The completed mark sheets should be submitted to CXC  no later than April 30 of the year of the examination.    Note:  The school is advised to keep a copy of the project of each candidate as well as copies of the  mark sheets.    Teachers will be required to submit to CXC copies of the projects of a sample of candidates as indicated  by CXC.  The sample will be re-marked by"
  },
  {
    "title": "CSEC Mathematics - Part 180",
    "content": "dicated  by CXC.  The sample will be re-marked by CXC for moderation purposes.      Moderation of School Based Assessment    The candidate’s performance on the project will be moderated.  The standard and range of marks  awarded by the teacher will be adjusted where appropriate.  However, the rank order assigned by the  teacher will  be  adjusted only  in  special  circumstances  and  then  only  after  consideration  of the  data  provided by the sample of marked projects submitted by the teach"
  },
  {
    "title": "CSEC Mathematics - Part 181",
    "content": "e sample of marked projects submitted by the teacher and re-marked by CXC.    PAPER 032    (a) This  paper  consists  of  two  questions  based  on topics  from  any  section  or  combination  of  different sections of the syllabus. The duration of the paper is 1 hour.    (b) All questions are compulsory and will require an extended response.    (c) The  paper  carries  a  maximum  of 20 marks.    Marks  will  be  awarded  for  Knowledge,  Comprehension and Reasoning as follows:    Knowledge: th"
  },
  {
    "title": "CSEC Mathematics - Part 182",
    "content": "hension and Reasoning as follows:    Knowledge: the recall of rules, procedures, definitions and facts; simple computations. (6 marks)    Comprehension: algorithmic thinking, use of algorithms and the application of algorithms to problem  situations. (8 marks)    Reasoning: translation  of  non-routine  problems  into  mathematical symbols;  making  inferences  and  generalisations from given data; analysing and synthesising. (6 marks)            CXC 05/G/SYLL 16  www.cxc.org   RECOMMENDED TEXT"
  },
  {
    "title": "CSEC Mathematics - Part 183",
    "content": "CXC 05/G/SYLL 16  www.cxc.org   RECOMMENDED TEXTS      Buckwell, G., Solomon, R., and Chung  Harris, T.   CXC  Mathematics  for  Today  1. Oxford:  Macmillan  Education, 2005.      Chandler, S., Smith, E., Ali, F., Layne,  C. and Mothersill, A.   Mathematics   for   CSEC. United   Kingdom:   Nelson  Thorne Limited, 2008.      Golberg, N.  Mathematics  for  the  Caribbean  4. Oxford:  Oxford  University Press, 2006.      Greer and Layne  Certificate  Mathematics, A  Revision  Course  for  the"
  },
  {
    "title": "CSEC Mathematics - Part 184",
    "content": "cate  Mathematics, A  Revision  Course  for  the  Caribbean. United Kingdom: Nelson Thrones Limited,  2001.      Layne, Ali, Bostock, Chandler,  Shepherd and Ali.   STP  Caribbean  Mathematics  for  CXC  Book  4. United  Kingdom: Nelson Thrones Limited, 2005.      Toolsie, R.  Mathematics,     A     Complete     Course     Volume    1.  Caribbean Educational Publisher Limited, 2006.      Toolsie, R.  Mathematics,     A     Complete     Course     Volume    2.  Caribbean Educational Publisher Lim"
  },
  {
    "title": "CSEC Mathematics - Part 185",
    "content": "Volume    2.  Caribbean Educational Publisher Limited, 2006.          Websites      http://mathworld.wolfram.com/  http://plus.maths.org/  http://nrich.maths.org/public/  http://mathforum.org/  http://www.ies.co.jp/math/java/         CXC 05/G/SYLL 16  www.cxc.org  Appendix 1A   GLOSSARY OF EXAMINATION TERMS    KEY TO ABBREVIATIONS    K - Knowledge   C - Comprehension  R - Reasoning       WORD    DEFINITION  NOTES  Analyse examine in detail         Annotate add a brief note to a label  Simple p"
  },
  {
    "title": "CSEC Mathematics - Part 186",
    "content": "Annotate add a brief note to a label  Simple phrase or a few words only.       Apply use     knowledge/principles     to     solve  problems   Make inferences/conclusions.       Assess present  reasons  for  the  importance  of  particular   structures,   relationships   or  processes   Compare     the     advantages     and  disadvantages  or  the  merits  and  demerits  of  a  particular  structure,  relationship or process.       Calculate arrive  at  the  solution  to  a  numerical  prob"
  },
  {
    "title": "CSEC Mathematics - Part 187",
    "content": "arrive  at  the  solution  to  a  numerical  problem   Steps should be shown; units must  be included.       Classify divide into groups according to  observable characteristics          Comment state  opinion  or  view  with  supporting  reasons          Compare state similarities and differences  An  explanation  of  the  significance  of  each  similarity  and  difference  stated     may     be     required     for  comparisons  which  are  other  than  structural.       Construct use  a  sp"
  },
  {
    "title": "CSEC Mathematics - Part 188",
    "content": "ther  than  structural.       Construct use  a  specific  format  to  make  and/or  draw  a  graph, histogram,  pie  chart  or  other    representation    using    data    or  material    provided    or    drawn    from  practical investigations, build (for  example, a model), draw scale diagram   Such representations should  normally  bear  a  title,  appropriate  headings and legend.       Deduce make a logical connection between two  or more pieces of information; use data  to arrive at a con"
  },
  {
    "title": "CSEC Mathematics - Part 189",
    "content": "ieces of information; use data  to arrive at a conclusion            CXC 05/G/SYLL 16  www.cxc.org  WORD    DEFINITION  NOTES  Define state concisely the meaning of a word or  term   This   should   include   the   defining  equation/formula where relevant.       Demonstrate show; direct attention to...         Derive to  deduce,  determine  or  extract  from  data   by   a   set   of   logical   steps   some  relationship, formula or result   This relationship may be general or  specific."
  },
  {
    "title": "CSEC Mathematics - Part 190",
    "content": "is relationship may be general or  specific.         Describe provide  detailed    factual information  of  the  appearance  or  arrangement  of  a  specific  structure  or  a  sequence  of  a  specific process   Description    may    be    in    words,  drawings    or    diagrams    or    any  appropriate combination.   Drawings  or  diagrams  should  be  annotated   to   show   appropriate  detail where necessary.       Determine find the value of a physical quantity         Design plan    and"
  },
  {
    "title": "CSEC Mathematics - Part 191",
    "content": "of a physical quantity         Design plan    and    present    with    appropriate  practical detail   Where  hypotheses  are  stated  or  when  tests  are  to  be  conducted,  possible outcomes should be clearly  stated and/or the way in which data  will be analysed and presented.       Develop expand or elaborate an idea or argument  with supporting reasons          Diagram simplified   representation   showing   the  relationship between components          Differentiate/  Distinguish  (bet"
  },
  {
    "title": "CSEC Mathematics - Part 192",
    "content": "ponents          Differentiate/  Distinguish  (between/  among)  state or explain briefly those differences  between  or  among  items  which  can  be  used  to  define  the  items  or  place  them  into separate categories          Discuss present   reasoned   argument;   consider  points  both  for  and  against;  explain  the  relative merits of a case          Draw make     a     line     representation     from  specimens or apparatus which shows an  accurate relation between the parts   In"
  },
  {
    "title": "CSEC Mathematics - Part 193",
    "content": "shows an  accurate relation between the parts   In   the   case   of   drawings   from  specimens,  the  magnification  must  always be stated.       Estimate make     an approximate     quantitative  judgement          Evaluate weigh  evidence  and  make  judgements  based on given criteria   The    use    of    logical    supporting  reasons  for  a  particular  point  of  view  is  more  important  than  the  view  held;  usually  both  sides  of  an  argument should be considered.       Expl"
  },
  {
    "title": "CSEC Mathematics - Part 194",
    "content": "of  an  argument should be considered.       Explain give reasons based on recall; account for      CXC 05/G/SYLL 16  www.cxc.org  WORD    DEFINITION  NOTES  Find locate a feature or obtain as from a graph         Formulate devise a hypothesis         Identify name  or  point  out  specific  components  or features          Illustrate show    clearly    by    using    appropriate  examples or diagrams, sketches          Interpret explain the meaning of         Investigate use   simple   systema"
  },
  {
    "title": "CSEC Mathematics - Part 195",
    "content": "ning of         Investigate use   simple   systematic   procedures   to  observe,  record  data  and  draw  logical  conclusions          Justify explain the correctness of         Label add names to identify structures or parts  indicated by pointers          List itemize without detail         Measure take accurate quantitative readings using  appropriate instruments          Name give only the name of  No additional information is  required.       Note write down observations         Observe"
  },
  {
    "title": "CSEC Mathematics - Part 196",
    "content": "Note write down observations         Observe pay attention to details which  characterize   a   specimen,   reaction   or  change  taking  place;  to  examine  and  note scientifically   Observations  may  involve  all  the  senses  and/or  extensions  of  them  but   would   normally   exclude   the  sense of taste.       Outline give basic steps only         Plan prepare to conduct an investigation         Predict use  information  provided  to  arrive  at  a  likely  conclusion  or  sugg"
  },
  {
    "title": "CSEC Mathematics - Part 197",
    "content": "d  to  arrive  at  a  likely  conclusion  or  suggest  a  possible  outcome          Record write an  accurate  description  of  the  full  range  of  observations  made  during  a  given procedure   This  includes  the  values   for  any  variable  being  investigated;  where  appropriate, recorded data may be  depicted  in  graphs,  histograms  or  tables.         CXC 05/G/SYLL 16  www.cxc.org  WORD    DEFINITION  NOTES  Relate show connections between; explain how  one set of facts or data de"
  },
  {
    "title": "CSEC Mathematics - Part 198",
    "content": "between; explain how  one set of facts or data depend on others  or are determined by them       Sketch make    a    simple    freehand    diagram  showing  relevant  proportions  and  any  important details          State provide  factual  information  in  concise  terms outlining explanations          Suggest offer    an    explanation    deduced    from  information provided or previous  knowledge.  (...  a  hypothesis;  provide  a  generalization    which    offers    a    likely  explanati"
  },
  {
    "title": "CSEC Mathematics - Part 199",
    "content": "ation    which    offers    a    likely  explanation    for    a    set    of    data    or  observations.)   No  correct  or  incorrect solution  is  presumed but suggestions must be  acceptable   within   the   limits   of  scientific knowledge.       Use apply    knowledge/principles    to    solve  problems   Make inferences/conclusions.                                                              CXC 05/G/SYLL 16  www.cxc.org  Appendix 1B   GLOSSARY OF MATHEMATICAL TERMS    WORD  MEANING"
  },
  {
    "title": "CSEC Mathematics - Part 200",
    "content": "GLOSSARY OF MATHEMATICAL TERMS    WORD  MEANING      Abscissa  The x-coordinate in a Cartesian coordinate system.      Absolute value   The absolute value of a real number 푥, denoted by   | 푥 | , is defined by  | 푥 | =푥 if 푥>0 and  | 푥 | =−푥 if 푥<0. For example,  | −4 | =4.         Acceleration     The rate of change of velocity with respect to time.  Acute Angle  An  angle  whose  measure  is  greater  than  0  degrees  and  less  than  90  degrees.  Acute triangle is a triangle with all three"
  },
  {
    "title": "CSEC Mathematics - Part 201",
    "content": "rees.  Acute triangle is a triangle with all three of its angles being acute.    Adjacent               Being next to or adjoining  Adjacent angles are two angles that have the same vertex and share a  common arm.  In a right triangle the adjacent side, with respect to an acute angle, is  the shorter side which, together with the hypotenuse, forms the given  acute angle.    Adjoint Matrix  The   adjoint   of  a 2×2 matrix 퐴,   denoted 퐴푑푗(퐴), satisfies   the  following:  If 퐴=( 푎푏 푐푑 ), then  퐴푑"
  },
  {
    "title": "CSEC Mathematics - Part 202",
    "content": "isfies   the  following:  If 퐴=( 푎푏 푐푑 ), then  퐴푑푗 ( 퐴 ) =( 푑−푏 −푐푎 ).      Algebraic Expression       A  combination  of  numbers,  variables  and  algebraic  operations.  For  example  3푥 4 17 +5(푦− √ 16푧) is an algebraic expression.    Algebraic Term  An algebraic expression that is strictly a multiplication of constants and  variables.  For  example  the  algebraic  expression   6푥 3 −3푥 2 +5푥  contains three algebraic terms:  ( 6푥 3 ) , ( −3푥 2 )  and (5푥).    Algorithm  A  process  consis"
  },
  {
    "title": "CSEC Mathematics - Part 203",
    "content": "3푥 2 )  and (5푥).    Algorithm  A  process  consisting  of  a  specific  sequence  of  operations  to  solve  a  certain types of problems. See Heuristic.      Alternate Interior  Angles   Angles located inside a set of parallel lines and on opposite sides of the  transversal. Also known as ‘Z-angles’.    Altitude  The  altitude  of a  triangle  is the  perpendicular  distance  of  a vertex  to  the line of the side opposite. A triangle has three altitudes.      Appreciation  An increase in valu"
  },
  {
    "title": "CSEC Mathematics - Part 204",
    "content": "altitudes.      Appreciation  An increase in value of an asset that is not due to altering its state.     Approximate  To find the value of a quantity within a specified degree of accuracy.        Arc     A portion of a circle; also a portion of any curve. See circle.    Area  The area of a plane  figure is a measure of how much of that plane is  enclosed by the figure.      CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Arithmetic Mean  The average of a set of values found by dividing the s"
  },
  {
    "title": "CSEC Mathematics - Part 205",
    "content": "average of a set of values found by dividing the sum of the values  by the amount of values.    Arithmetic Sequence   A  sequence  of  elements,  a 1 ,  a 2 ,  a 3 ,.....,  such  that  the  difference  of  successive   terms   is   a   constant   d.   For   example,   the   sequence  {2,5,8,11,14,...}  has common difference 3.    Associative Property  A binary operation ∘ on a set 푆 is associative if, for all 푎,푏 and 푐 in 푆,  ( 푎∘푏 ) ∘푐=푎∘ ( 푏∘푐 ) .    Asymptotes        Average   A straight line"
  },
  {
    "title": "CSEC Mathematics - Part 206",
    "content": ") .    Asymptotes        Average   A straight line is said to be an asymptote of a curve if the curve has the  property  of  becoming  and  staying  arbitrarily  close  to  the  line  as  the  distance from the origin increases to infinity.     The average of a set of values is the number which represents the usual  or typical value  in that set.  Average  is  synonymous with measures of  central tendency. These include the mean, mode and median.      Axis of symmetry  A line that passes through"
  },
  {
    "title": "CSEC Mathematics - Part 207",
    "content": "Axis of symmetry  A line that passes through a figure such that the portion of the figure  on one side of the line is the mirror image of the portion on the other  side of the line.    Bar Graph  A diagram showing a system of connections or interrelations between  two or more things by using bars.    Base   1. The base of a polygon is one  of its sides; for example,  a side of a  triangle.    2. The base of a solid is one of its faces; for example, the flat face of a  cylinder.    3. The b"
  },
  {
    "title": "CSEC Mathematics - Part 208",
    "content": "example, the flat face of a  cylinder.    3. The base of a number system is the number of digits it contains; for  example, the base of the binary system is two.  Bimodal       Having  two  modes,  which  are  equally  the  most  frequently  occurring  numbers in a list.    Binary Numbers     Numbers written in the base two number system. The digits used are  0 and 1. For example, 11011 2 .    Binomial       An  algebraic  expression consisting  of  the  sum  or  difference  of  two  terms.    B"
  },
  {
    "title": "CSEC Mathematics - Part 209",
    "content": "of  the  sum  or  difference  of  two  terms.    Bisector     To cut something in half. For example, an angle bisector is a line that  divides one angle into two angles of equal size.    Capacity  The maximum amount that something can contain.          CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Cartesian Plane                      Chord      A  plane  with  a  point  selected  as  an origin, some  length  selected  as  a  unit  of  distance,  and  two  perpendicular  lines  that  intersec"
  },
  {
    "title": "CSEC Mathematics - Part 210",
    "content": "e,  and  two  perpendicular  lines  that  intersect  at  the  origin,  with  positive  and  negative  directions  selected  on  each  line.   Traditionally,  the lines  are  called  x  (drawn  from  left  to  right,  with  positive direction to the right of the origin) and y (drawn from bottom  to top, with positive direction upward of the origin).  Coordinates of a  point are determined by the distance of this point from the lines, and  the signs of the coordinates are determined by whether the"
  },
  {
    "title": "CSEC Mathematics - Part 211",
    "content": "s of the coordinates are determined by whether the point is in  the positive or in the negative direction from the origin.  A line segment that connects two points on a curve.     The  Diameter of  a  circle  is  a  special  chord  that  passes  through  the  centre of the circle.  Circle  The  set of  points  in  a  plane  that  are  all a  fixed  distance  from  a  given  point which is called the centre.    The  Circumference of a circle is the distance along the circle; it’s a  special name"
  },
  {
    "title": "CSEC Mathematics - Part 212",
    "content": "e distance along the circle; it’s a  special name for the perimeter of the circle.    Class Interval  Non-overlapping intervals, which together contain every piece of data  in a survey.    Coefficients         The  constant  multiplicative  factor  of  a  mathematical  object.    For  example, in the expression 4d+5+3s, the 4, 5, and 3 are coefficients  for the variables d, t 2 , and s respectively.    Collinear  A set of points are said to be collinear if they all lie on the same straight  line"
  },
  {
    "title": "CSEC Mathematics - Part 213",
    "content": "llinear if they all lie on the same straight  line.    Commutative  Property   Reversing the order in which two objects are being added or multiplied  will yield the same result.   For all real numbers a and b, a+b=b+a and ab=ba.    Complement      The complement of a set A is another set of all the elements outside of  set A but within the universal set.    Complementary  Angles     Two angles that have a sum of 90 degrees.    Composite Function     A function consisting of two or more function"
  },
  {
    "title": "CSEC Mathematics - Part 214",
    "content": "A function consisting of two or more functions such that the output of  one  function  is  the  input  of  the  other  function.  For  example,  in  the  composite function 푓 ( 푔 ( 푥 ) )  the input of 푓 is 푔.     Composite Numbers     Numbers that have more than two factors. For example, 6 and 20 are  composite numbers while 7 and 41 are not.    Compound Interest  A  system  of  calculating  interest  on  the  sum  of  the  initial  amount  invested  together  with  the  interest  previousl"
  },
  {
    "title": "CSEC Mathematics - Part 215",
    "content": "invested  together  with  the  interest  previously  awarded;  if  A  is  the  initial sum invested in an account and r is the rate of interest per period  invested, then the total after n periods is 퐴 ( 1+푟 ) 푛 .  2 t   CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Congruent  Two shapes in the plane or in space are congruent if they are identical.  That is, if one shape is placed on the other they match exactly.    Coordinates           A  unique  order  of  numbers  that  identifies  a  po"
  },
  {
    "title": "CSEC Mathematics - Part 216",
    "content": "nique  order  of  numbers  that  identifies  a  point  on  the  coordinate  plane.  On the Cartesian two dimensional plane the first number in the  ordered  pair  identifies  the  position  with  regard  to  the  horizontal  (x- axis)  while  the  second  number  identifies  the  position  relative  to  the  vertical (y-axis).    Coplanar  A set of points is coplanar if the points all lie in the same plane.    Corresponding  Angles   Two  angles  in  the  same  relative  position  on  two  paral"
  },
  {
    "title": "CSEC Mathematics - Part 217",
    "content": "in  the  same  relative  position  on  two  parallel  lines  when  those lines are cut by a transversal.    Decimal Number  A number written in base ten.    Degrees        A degree  is a unit of measure of angles where  one  degree  is  1 360  of a  complete revolution.    Depreciation     The rate which the value of an asset diminishes due only to wear and  tear.    Diagonal  The diagonal   of   a   polygon   is   a   straight   line   joining   two   of   its  nonadjacent vertices.    Discont"
  },
  {
    "title": "CSEC Mathematics - Part 218",
    "content": "two   of   its  nonadjacent vertices.    Discontinuous Graph     A line in a graph that is interrupted, or has breaks in it.    Discrete  A  set  of  values  are  said  to  be  discrete  if  they  are  all  distinct  and  separated from each other. For example, the set of shoe sizes where  the elements of this set can only take on a limited and distinct set of  values.    Disjoint  Two   sets   are   disjoint   if   they   have   no   common   elements;   their  intersection is empty.    Distr"
  },
  {
    "title": "CSEC Mathematics - Part 219",
    "content": "elements;   their  intersection is empty.    Distributive Property  Summing two numbers and then multiplying by a third number yields  the same value as multiplying both numbers by the third number and  then adding.  In algebraic terms, for all real numbers 푎,푏, and 푐,  푎(푏+푐)=푎푏+푎푐.    Domain of the  function f    The set of objects x for which f(x) is defined.      Element of a set  A member of or an object in a set.  Empty Set  The empty set is the set that  has no elements; it is denoted wit"
  },
  {
    "title": "CSEC Mathematics - Part 220",
    "content": "s the set that  has no elements; it is denoted with the  symbol ∅.    Equally Likely     In  probability,  when  there  are  the  same  chances  for  more  than  one  event to happen, the events are equally likely to occur.  For example, if    CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING            someone flips a fair coin, the chances of getting heads or tails are the  same.  There are equally likely chances of getting heads or tails.    Equation     A  statement  that  says  that  two  mathem"
  },
  {
    "title": "CSEC Mathematics - Part 221",
    "content": "on     A  statement  that  says  that  two  mathematical  expressions  have  the  same value.    Equilateral Triangle  A triangle with three equal sides. Equilateral triangles have three equal  angles of measure 60 degrees.    Estimate  The best guess for an unknown quantity arrived at after considering all  the information given in a problem.    Event  In  probability,  an  event  is  a  set  of  outcomes  of  an  experiment.  For  example,  the  even  A  may  be  defined  as  obtaining  two  h"
  },
  {
    "title": "CSEC Mathematics - Part 222",
    "content": "even  A  may  be  defined  as  obtaining  two  heads  from  tossing a coin twice.     Expected Value  The  average  amount  that  is  predicted  if  an  experiment  is  repeated  many times.    Experimental  Probability   The chances of something happening, based on repeated testing and  observing  results.    It  is  the  ratio  of  the  number  of  times  an  event  occurred  to  the  number  of  times  tested.    For  example,  to  find  the  experimental probability of winning a game, one"
  },
  {
    "title": "CSEC Mathematics - Part 223",
    "content": "experimental probability of winning a game, one must play the game  many  times,  then  divide  by  the  number  of  games  won  by  the  total  number of games played.    Exponent  The power to which a number of variables is raised.    Exponential Function       A function that has the form y=a x , where  a is any real number and is  called the base.    Exterior Angle  The exterior angle of a polygon is an angle formed by a side and a line  which is the extension of an adjacent side.    Facto"
  },
  {
    "title": "CSEC Mathematics - Part 224",
    "content": "ich is the extension of an adjacent side.    Factors     1. The factors of a whole number are those numbers by which it can  be divided without leaving a remainder.    2. The  factors  of  an  algebraic  expression  A  are  those  expressions  which,   when   multiplied   together,   results   in   A.   For   example  푥 and (3−푦) are the factors of 3푥−푥푦.  Factorise               The  process  of  rewriting  an  algebraic  expression  as  a  product  of  its  factors.  For  example, 4푥 2 −4푦 2"
  },
  {
    "title": "CSEC Mathematics - Part 225",
    "content": "uct  of  its  factors.  For  example, 4푥 2 −4푦 2  when  factorised  may  be  written  as  ( 2푥−2푦 ) (2푥+2푦).  To factorise  completely is  to  rewrite  an  expression  as  a  product  of  prime factors. For example, 4푥 2 −4푦 2  when factorised completely is  4 ( 푥−푦 )( 푥+푦 ) .   Frequency  The number of items occurring in a given category.    Frustum  The frustum is a portion of a cone  or pyramid bounded by two faces  parallel to the base.    CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Fu"
  },
  {
    "title": "CSEC Mathematics - Part 226",
    "content": "C 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Function  A correspondence in which each member of one set is mapped unto a  member of another set.    Graph  A  visual  representation  of  data  that  displays  the  relationship  among  variables, usually cast along x and y axes.    Histogram  A  bar  graph  with  no  spaces  between  the  bars  where  the  area  of  the  bars is proportional to the corresponding frequencies.  If the bars have  the same width, then the heights are proportional t"
  },
  {
    "title": "CSEC Mathematics - Part 227",
    "content": "he same width, then the heights are proportional to the frequencies.    Hypotenuse  The side of the Right triangle that is opposite the right angle. It is the  longest of the three sides.    Identity                   1. An equation that is true for every possible value of the  variables.  For example, 푥 2 −1= ( 푥−1 )( 푥+1 )  is an identity while   푥 2 −1=3 is not, as it is only true for the values ±2.    2. The identity element of an operation is a number such that when  operated on with any ot"
  },
  {
    "title": "CSEC Mathematics - Part 228",
    "content": "s a number such that when  operated on with any other number results  in the other number.  For example, the identity element under addition of real numbers  is zero; the identity element under multiplication of 2 x 2 matrices  is ( 10 01 ).   Inequality       A relationship between two quantities indicating that one is strictly less  than or less than or equal to the other.  Infinity  The symbol ∞ indicating a limitless quantity. For example, the result of  a nonzero number divided by zero is i"
  },
  {
    "title": "CSEC Mathematics - Part 229",
    "content": "e result of  a nonzero number divided by zero is infinity.    Integers     The  set  consisting  of  the  positive  and  negative  whole  numbers  and  zero, for example, {... -2, -1, 0, 1, 2,...}.    Intercept          Intersection   The x-intercept of a graph is the value of x where the curve crosses the  x-axis.   The y-intercept of a graph is the y value where the curve crosses the y- axis.     The intersection of two sets is the set of elements which are common  in both sets.     Inverse  T"
  },
  {
    "title": "CSEC Mathematics - Part 230",
    "content": "nts which are common  in both sets.     Inverse  The  inverse  of  an  element  under  an  operation  is  another  element  which when operated on with the first element results in the identity.   For  example,  the  inverse  of  a  real  number  under  addition  is  the  negative of that number.    Irrational Number  A number that cannot be represented as an exact ratio of two integers.   For example, 휋 or the square root of 2.      CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Isosceles Tr"
  },
  {
    "title": "CSEC Mathematics - Part 231",
    "content": "L 16  www.cxc.org  WORD  MEANING      Isosceles Triangle     A triangle that has two equal sides.  Like Terms  Two terms are like terms if all parts of both, except for the numerical  coefficient, are the same.    Limit  The target value that terms in a sequence of numbers are getting closer  to.    This  limit  is  not  necessarily  ever  reached;  the  numbers  in  the  sequence eventually get arbitrarily close to the limit.    Line Graph  A diagram showing a system of connections or interrela"
  },
  {
    "title": "CSEC Mathematics - Part 232",
    "content": "agram showing a system of connections or interrelations between  two or more things by using lines.    Line symmetry  If  a  figure  is  divided  by  a  line  and  both  divisions  are  mirrors  of  each  other, the figure has line symmetry.  The line that divides the figure is  the line of symmetry.    Linear Equation  An equation containing linear expressions.    Linear Expression     An expression of the form 푎푥+푏 where 푥 is a variable of power one  and 푎 and 푏 are constants, or in more varia"
  },
  {
    "title": "CSEC Mathematics - Part 233",
    "content": "r one  and 푎 and 푏 are constants, or in more variables, an expression of the  form 푎푥+푏푦+푐, 푎푥+푏푦+푐푧+푑 where 푎,푏,푐 and 푑 are  constants.    Magnitude     The length of a vector.    Matrix  A rectangular arrangement of numbers in rows and columns.    Mean  In statistics, the average obtained by dividing the sum of two or more  quantities by the number of these quantities.    Median  In  statistics,  the  quantity  designating  the  middle  value  in  a  set  of  numbers which have been arranged i"
  },
  {
    "title": "CSEC Mathematics - Part 234",
    "content": "in  a  set  of  numbers which have been arranged in ascending or descending order.    Mode  In  statistics,  the  value  that  occurs  most  frequently  in  a  given  set  of  numbers.    Multimodal  distribution   A distribution with more than one mode. For example, the set {2, 4, 3,  5, 3, 6, 5, 2, 5, 3} has modal values 3 and 5.    Multiples  The product of multiplying a number by a whole number.  For example,  multiples of 5 are 10, 15, 20 or any number that can be evenly divided  by 5.    N"
  },
  {
    "title": "CSEC Mathematics - Part 235",
    "content": "any number that can be evenly divided  by 5.    Natural Numbers  The set of the counting numbers, that is, N = {1, 2, 3, 4...}     Negative Numbers  Numbers  less  than  zero.    In  graphing,  numbers  to  the  left  of  zero.   Negative numbers are represented by placing a minus sign (-) in front  of the number. For example, −3,−0.5,− 14 9  are negative numbers.        CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Obtuse Angle  An angle whose measure is greater than 90 degrees but less th"
  },
  {
    "title": "CSEC Mathematics - Part 236",
    "content": "ose measure is greater than 90 degrees but less than 180  degrees.    Obtuse Triangle     A triangle containing one obtuse angle.    Ordered Pair  A  set of  numbers  where  the  order  in which  the  numbers  are  written  has  an  agreed-upon  meaning.  For  example,  points  on  the  Cartesian  plane are represented by ordered pairs such as P(4,7) where 4 is the x- value and 7 the y-value.     Origin   In the Cartesian coordinate plane, the origin is the point at which the  horizontal and ver"
  },
  {
    "title": "CSEC Mathematics - Part 237",
    "content": "igin is the point at which the  horizontal and vertical axes intersect, at zero (0,0).    Parallel  Given distinct lines in the plane that are infinite in both directions, the  lines  are  parallel  if  they  never  meet.    Two  distinct  lines  in  the  coordinate plane are parallel if and only if they have the same slope.    Parallelogram  A quadrilateral that contains two pairs of parallel sides.    Pattern  Characteristic(s) observed in one item that may be repeated in similar  or identical"
  },
  {
    "title": "CSEC Mathematics - Part 238",
    "content": "item that may be repeated in similar  or identical manners in other items.    Percent     A  ratio  that  compares  a  number  to  one  hundred.    The  symbol  for  percent is %.    Perpendicular  Two lines are said to be perpendicular to each other if they form a 90  degrees angle.    Pi  The designated name for the ratio of the circumference of a circle to  its diameter.    Pie Chart  A chart made by plotting the numeric values of a set of quantities as a  set of adjacent circular wedges wher"
  },
  {
    "title": "CSEC Mathematics - Part 239",
    "content": "ntities as a  set of adjacent circular wedges where the arc lengths are proportional  to  the  total  amount.    All  wedges  taken  together  comprise  an  entire  disk.    Pie Graph  A diagram showing a system of connections or interrelations between  two  or  more  things  by  using  a  circle  divided  into  segments  that  look  like pieces of pie.    Polygon  A closed plane figure formed by three or more line segments.    Polyhedra  Any solid figure with an outer surface composed of polygo"
  },
  {
    "title": "CSEC Mathematics - Part 240",
    "content": "id figure with an outer surface composed of polygon faces.    Polynominal  An  algebraic  expression  involving  a  sum  of  algebraic  terms  with  nonnegative  integer  powers.  For  example, 2푥 3 +3푥 2 −푥+6 is  a  polynomial in one variable.     Population     In statistics population is the set of all items under consideration.    Prime  A natural  number  p  greater  than  1  is  prime  if  and  only  if  the  only  positive integer factors of p are 1 and p.  The first seven primes are 2,"
  },
  {
    "title": "CSEC Mathematics - Part 241",
    "content": "of p are 1 and p.  The first seven primes are 2,  3, 5, 7, 11, 13, 17.    CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Probability  The measure of how likely it is for an event to occur.  The probability  of an event is always a number between zero and 1.      Proportion  1. A relationship between two ratios in which the first ratio is always  equal to the second. Usually  of the form  푎 푏 = 푐 푑 .    2. The fraction of a part and the whole. If two parts of a whole are in  the  ratio  2:7,"
  },
  {
    "title": "CSEC Mathematics - Part 242",
    "content": "If two parts of a whole are in  the  ratio  2:7,  then  the  corresponding  proportions  are  2 9 and 7 9   respectively.  Protractor  An instrument used for drawing and measuring angles.    Pythagorean  Theorem   The Pythagorean Theorem states that the square of the hypotenuse is  equal  to  the  sum  of  the  squares  of  the  two  sides,  or 푎 2 +푏 2 = 푐 2 , where 푐 is the hypotenuse.       Quadrant  The four parts of the coordinate plane divided by the x and y axes.  Each  of these quadrants"
  },
  {
    "title": "CSEC Mathematics - Part 243",
    "content": "ded by the x and y axes.  Each  of these quadrants has a number designation.  First quadrant contains  all  the  points  with  positive  x  and  positive  y  coordinates.    Second  quadrant   contains  all  the   points  with  negative  x  and  positive  y  coordinates.  The  third  quadrant  contains  all  the  points  with both  coordinates  negative.  Fourth  quadrant  contains  all  the  points  with  positive x and negative y coordinates.    Quadratic Function  A function given by a polyno"
  },
  {
    "title": "CSEC Mathematics - Part 244",
    "content": "Quadratic Function  A function given by a polynomial of degree 2.    Quadrilateral     A polygon that has four sides.    Quartiles  Consider a set of numbers arranged in ascending or descending order.  The quartiles are the three numbers which divide the set into four parts  of equal amount of numbers. The first  quartile in a list  of numbers is  the number such that a quarter of the numbers is below it. The second  quartile is the median. The third quartile is the number such that three  qua"
  },
  {
    "title": "CSEC Mathematics - Part 245",
    "content": "third quartile is the number such that three  quarters of the numbers are below it.     Quotient  The result of division.    Radical     The radical symbol (√) is used to indicate the taking of a root of a  number.  √ 푥 푞  means the q th  root of x; if q=2 then it is usually written as  √ 푥.  For  example  √ 243 5 =3, √ 16 4 =2. The  radical  always  means  to  take  the  positive  value.  For  example,  both  5  and −5 satisfy  the  equation 푥 2 =25, but  √ 25=5.    Range  The  range  of  a  s"
  },
  {
    "title": "CSEC Mathematics - Part 246",
    "content": "2 =25, but  √ 25=5.    Range  The  range  of  a  set  of  numbers  is  the  difference  between  the  largest  value in the set and the smallest value in the set.  Note that the range  is a single number, not many numbers.    Range of Function f  The set of all the numbers f(x) for x in the domain of f.        CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Ratio  A comparison expressed as a fraction.  For example, the ratio of three  boys to two girls in a class is written as  3 2 or 3:2.  Ra"
  },
  {
    "title": "CSEC Mathematics - Part 247",
    "content": "wo girls in a class is written as  3 2 or 3:2.  Rational Numbers  Numbers  that  can  be  expressed  as  the  quotient  of  two  integers,  for  example, , , , 7 = .      Ray  A  straight  line  that  begins  at  a  point  and  continues  outward  in  one  direction.    Real Numbers  The  union  of  the  set  of  rational  numbers  and  the  set  of  irrational  numbers.     Reciprocal      The reciprocal of a number a is equal to   1 풂  where 푎≠0.    Regular Polygon  A polygon whose side length"
  },
  {
    "title": "CSEC Mathematics - Part 248",
    "content": "0.    Regular Polygon  A polygon whose side lengths are all the same and whose interior angle  measures are all the same.    Rhombus  A parallelogram with four congruent sides.    Right Angle  An angle of 90 degrees.    Right Triangle  A triangle containing an angle of 90 degrees.    Rotate     The turning of an object  (or co-ordinate system)  by an angle about  a  fixed point.    Root  1. The  root  of  an  equation  is  the  same  as  the  solution  of  that  equation. For example, if y=f(x),"
  },
  {
    "title": "CSEC Mathematics - Part 249",
    "content": "ution  of  that  equation. For example, if y=f(x), then the roots are the values of x  for  which  y=0.  Graphically,  the  roots  are  the  x-intercepts  of  the  graph.    2. The n th  root of a real number x is a number which, when multiplied  by itself n times, gives x. If n is odd then there is one root for every  value  of  x;  if  n  is  even there  are  two  roots  (one  positive  and one  negative)  for  positive  values  of  x  and  no  real  roots  for  negative  values  of  x.  The"
  },
  {
    "title": "CSEC Mathematics - Part 250",
    "content": "real  roots  for  negative  values  of  x.  The  positive  root  is  called  the Principal  root and  is  represented by the radical sign (√). For example, the principal  square root of 9 is written as  √ 9=3 but the square roots of 9 are  ± √ 9=±3.   Sample     A group of items chosen from a population.    Sample Space     The set of outcomes of a probability experiment. Also called probability  space.    Scalar     A quantity which has size but no direction.    Scalene Triangle     A triangle"
  },
  {
    "title": "CSEC Mathematics - Part 251",
    "content": "t no direction.    Scalene Triangle     A triangle with no two sides equal. A scalene triangle has no two angles  equal.  7 3 5 11 5 13  7 1   CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Scientific Notation  A shorthand way of writing very large or very small numbers.  A number  expressed  in  scientific  notation  is  expressed  as  a  decimal  number  between  1  and  10  multiplied  by  a  power  of  10  (for  example,  7000  =  7x10 3  or 0.0000019 = 1.9x10 -6 ).    Sector  The sector"
  },
  {
    "title": "CSEC Mathematics - Part 252",
    "content": "or 0.0000019 = 1.9x10 -6 ).    Sector  The sector of a circle is a closed figure formed by an arc and two radii  of the circle.    Segment     1. A line segment is a piece of a line with two end points.    2. A  segment  of  a  circle  is  a  closed  figure  formed  by  an  arc  and  a  chord.  Sequence  A set of numbers with a prescribed order.    Set  A  set  is  a  well-defined collection  of  things,  without  regard  to  their  order.    Significant Digits  The amount of digits required fo"
  },
  {
    "title": "CSEC Mathematics - Part 253",
    "content": "gnificant Digits  The amount of digits required for calculations or measurements to be  close  enough  to  the  actual  value.  Some  rules  in  determining  the  number of digits considered significant in a number:    - The leftmost non-zero digit is the first significant digit.    - Zeros between two non-zero digits are significant.  Trailing  zeros  to  the  right  of  the  decimal  point  are  considered  significant.    Similar     Two  figures  are  said  to  be  similar  when  all  corres"
  },
  {
    "title": "CSEC Mathematics - Part 254",
    "content": "res  are  said  to  be  similar  when  all  corresponding angles  are  equal. If two shapes are similar, then the corresponding sides are in the  same ratio.      Simple Event     A non-decomposable outcome of a probability experiment.    Simple Interest  An interest of a fixed amount calculated on the initial investment.    Simultaneous  Equations     A system (set) of equations that must all be true at the same time.    Solid  A  three  dimensional  geometric  figure  that  completely  enclose"
  },
  {
    "title": "CSEC Mathematics - Part 255",
    "content": "onal  geometric  figure  that  completely  encloses  a  volume of space.    Square Matrix     A matrix with equal number of rows and columns.    Square Root  The square root of a positive real number n is the number m such that   푚 2 = 푛.  For example, the square roots of 16 are 4 and -4.     Subset  A  subset  of  a  given  set  is  a  collection  of  things  that  belong  to  the  original set.  For example, the subsets of 퐴={푎,푏} are:  {푎},{푏},{푎,푏},  and the null set.    CXC 05/G/SYLL 16  ww"
  },
  {
    "title": "CSEC Mathematics - Part 256",
    "content": ",{푎,푏},  and the null set.    CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Surface Area  The sum of the areas of the surfaces of a solid.    Statistical Inference  The process of estimating unobservable characteristics of a population  using information obtained from a sample.    Symmetry  Two points A and B are symmetric with respect to a line if the line is a  perpendicular bisector of the segment AB.    Tangent     A line is a tangent to a curve at a point A if it just touches the curve"
  },
  {
    "title": "CSEC Mathematics - Part 257",
    "content": "a curve at a point A if it just touches the curve at  A in such a way that it remains on one side of the curve at A. A tangent  to a circle intersects the circle only once.    Translate  In a tessellation, to translate an object means repeating it by sliding it  over a certain distance in a certain direction.    Translation  A rigid motion of the plane or space of the form X goes to X + V for a  fixed vector V.    Transversal  In geometry, given two or more lines in the plane a transversal is a"
  },
  {
    "title": "CSEC Mathematics - Part 258",
    "content": "two or more lines in the plane a transversal is a line  distinct from the original lines and intersects each of the given lines in  a single point.    Theoretical  Probability   The chances of events happening as determined by calculating results  that   would   occur   under   ideal   circumstances.      For   example,   the  theoretical probability of rolling a 4 on a fair four-sided die is ¼ or 25%,  because  there  is  one  chance  in  four  to  roll  a  4,  and  under  ideal  circumstances"
  },
  {
    "title": "CSEC Mathematics - Part 259",
    "content": "to  roll  a  4,  and  under  ideal  circumstances one out of every four rolls would be a 4.      Trapezoid  A quadrilateral with exactly one pair of parallel sides.    Trigonometry                          Union of Sets   The study of triangles. Three trigonometric functions defined for either  acute angles in the right triangle are:    Sine of the angle x is the ratio of the side opposite the angle and the  hypotenuse. In short, sin푥= 푂 퐻 ;    Cosine of the angle x is the ratio of the short sid"
  },
  {
    "title": "CSEC Mathematics - Part 260",
    "content": "osine of the angle x is the ratio of the short side adjacent to the angle  and the hypotenuse. In short, cos푥= 퐴 퐻 ;    Tangent of the angle x is the  ratio of the side opposite the angle and  the short side adjacent to the angle. In short tan푥= 푂 퐴     The union of two or more sets is the set of all the elements contained  in all the sets.  The symbol for union is U.    Unit Vector       A vector of length 1.    CXC 05/G/SYLL 16  www.cxc.org  WORD  MEANING      Variable  A placeholder in an alg"
  },
  {
    "title": "CSEC Mathematics - Part 261",
    "content": "RD  MEANING      Variable  A placeholder in an algebraic expression, for example, in   3푥 + 푦 = 23,푥 and 푦 are variables.    Vector  Quantity  that  has  magnitude  (length)  and  direction.    It  may  be  represented as a directed line segment.    Velocity  The rate of change of position overtime in a given direction is velocity,  calculated by dividing directed distance by time.    Venn Diagram  A  diagram  where  sets  are  represented  as  simple  geometric  figures,  with  overlapping  and"
  },
  {
    "title": "CSEC Mathematics - Part 262",
    "content": "imple  geometric  figures,  with  overlapping  and  similarity  of  sets  represented  by  intersections  and unions of the figures.    Vertex     The  vertex  of  an  angle  is  the  point  where  the  two  sides  of  the  angle  meet.    Volume  A measure of the number of cubic units of space an object occupies.                               Western Zone Office  21 June 2016                         CARIBBEAN EXAMINATIONS COUNCIL           Caribbean Secondary Education Certificate ®  CSEC ®"
  },
  {
    "title": "CSEC Mathematics - Part 263",
    "content": "bean Secondary Education Certificate ®  CSEC ®           MATHEMATICS      Specimen Papers and  Mark Schemes/Keys                         Specimen Papers:        Paper 01   Paper 02  Paper 032             Mark Schemes and Key:    Paper 01   Paper 02  Paper 032            The Specimen Papers      Paper 01    1. The Paper 01 consists of 60 items.  However, there are 30 items in this specimen paper. The  Specimen represents the syllabus topics and the profiles in the same ratio as they will occur  o"
  },
  {
    "title": "CSEC Mathematics - Part 264",
    "content": "e profiles in the same ratio as they will occur  on the Paper 01 for the revised syllabus.    2. Vectors and Matrices will be tested on Paper 01.      Paper 02    1. The  Paper  02 will  be  marked  electronically. The  structure  of  the actual paper  has  been  modified  to  allow  candidates  to  write  in  the  spaces  following  each  part  of  a  question.   However, in an effort to limit the number of pages in the specimen paper, the spaces for the  working were omitted.    2. The topic S"
  },
  {
    "title": "CSEC Mathematics - Part 265",
    "content": "s for the  working were omitted.    2. The topic Sets will no longer be tested on Paper 02.      Paper 032    1. This is a new paper and is designed for candidates whose work cannot be monitored by tutors  in recognised educational institutions. The Paper will be of one hour duration and will consist  of two questions.       2. The Paper 032 will be marked electronically and the structure, as presented in the specimen,  will allow candidates to write in the spaces following each part of a questi"
  },
  {
    "title": "CSEC Mathematics - Part 266",
    "content": "rite in the spaces following each part of a question.          C   A  R  I  B  B  E  A  N       E  X  A  M  I  N  A  T  I  O  N  S       C  O  U  N  C  I  L CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMINATION SPECIMEN MULTIPLE  CHOICE  QUESTIONS FOR MATHEMATICS READ  THE  FOLLOWING  DIRECTIONS  CAREFULLY  Each  item in this test has four suggested answers lettered (A), (B), (C), (D).  Read each  item you are about to answer and decide which choice is best.  Sample Item  2a + 6a =    Sample"
  },
  {
    "title": "CSEC Mathematics - Part 267",
    "content": "hoice is best.  Sample Item  2a + 6a =    Sample  Answer  (A)   8a    A     B     C     D        (B)       8a 2        (C)       12a        (D)       12a 2  The best answer to this item is “8a”, so answer space (A) has been shaded.  There are 30 items in this specimen paper.  However, the Paper 01 test consists of            60 items. Copyright  ©  2015 Caribbean Examinations Council. All rights reserved. 01234010/SPEC 2015 GO ON TO THE NEXT PAGE 01234010/SPEC 2015 - 2 - LIST OF FORMULAE Volume"
  },
  {
    "title": "CSEC Mathematics - Part 268",
    "content": "01234010/SPEC 2015 - 2 - LIST OF FORMULAE Volume of a prism V = Ah where A is the area of a cross-section and h is the perpendicular  length. Volume of cylinder V = πr 2 h where r is the radius of the base and h is the perpendicular height. Volume of a right pyramid V  = — Ah where A is the area of the base and h is the perpendicular height. Circumference C = 2πr where r is the radius of the circle. Arc length S = —— × 2πr where θ is the angle subtended by the arc, measured in  degrees. Area of"
  },
  {
    "title": "CSEC Mathematics - Part 269",
    "content": "ubtended by the arc, measured in  degrees. Area of a circle A = πr 2  where r is the radius of the circle. Area of a sector A = —— × πr 2  where θ is the angle of the sector, measured in degrees. Area of trapezium A = — (a + b) h where a and b are the lengths of the parallel sides and h  is the perpendicular distance between the parallel sides. Roots of quadratic equations  If ax 2  + bx + c = 0,  then  x  =  ——————  Trigonometric ratios sin θ  =  —————"
  },
  {
    "title": "CSEC Mathematics - Part 270",
    "content": "—————                                                    cos                                                  θ   =  —————                                                   tan                                                  θ  =  ————— Area of triangle  Area of Δ = — bh where b is the length of the base and h is the perpendicular  height.  Area of  Δ ABC  =  — ab sin C  Area of Δ ABC  =  √ s (s – a) (s – b) (s – c)                                                     where"
  },
  {
    "title": "CSEC Mathematics - Part 271",
    "content": "where                                                  s   =  ———— Sine rule   ——    =    ——    =    —— Cosine rule   a 2   =  b 2   +  c 2   –  2bc cos A 1 3 1 2 θ 360 θ 360 –b + √ b 2  – 4ac 2a opposite side hypotenuse adjacent side hypotenuse opposite side adjacent side 1 2 1 2 a + b + c 2 a sin A c sin C b sin B GO ON TO THE NEXT PAGE 01234010/SPEC 2015 - 3 - 1.   The number 2 747 written to 3 significant  figures is  (A) 2 740  (B) 2 750  (C)   274  (D)     275 2. E"
  },
  {
    "title": "CSEC Mathematics - Part 272",
    "content": "(A) 2 740  (B) 2 750  (C)   274  (D)     275 2. Expressed in scientific notation  0.045 × 10 -3  is  (A) 4.5 × 10 -1   (B) 4.5 × 10 -4   (C) 4.5 × 10 -5  (D) 4.5 × 10 -6 3.  The  value  of   (5 + 2) 3 5 2  - 2 2   in  its  simplest   form is             (A)             8 21             (B)             7 3             (C)             7 2             (D)             49 3 4. How much simple  interest is due on a  loan of $1 200 for two years if the annual  rate of interest is 5 1 2  per cent?"
  },
  {
    "title": "CSEC Mathematics - Part 273",
    "content": "annual  rate of interest is 5 1 2  per cent?        (A)       $120.00        (B)       $132.00        (C)        $264.00        (D)       $330.00             Item            5 refers to the chart shown below. Rate on Fixed Deposits       2014    7.8%     2015    7.5% 5. How much  more  interest  did  a  fixed  deposit of $10 000 earn in 2015 than in  2014?  (A) $  0.30  (B)   $  3.00        (C)       $30.00        (D)       $33.00 6.   T om bought a pen for $60.  He sold it to  gain 20% on his"
  },
  {
    "title": "CSEC Mathematics - Part 274",
    "content": "ht a pen for $60.  He sold it to  gain 20% on his cost.  How much money  did he gain? (A)            $12 (B)           $40 (C)           $72 (D)            $80 7.   The   Water  Authority  charges  $10.00   per  month  for  the  meter  rent,  $25.00   for the first 100 litres and $1.00 for each  additional 10 litres.    What is the total bill for 250 litres used  in one month? (A)        $25.00 (B)       $35.00 (C)       $40.00 (D)        $50.00 GO ON TO THE NEXT PAGE 01234010/SPEC 2015 - 4 - 8."
  },
  {
    "title": "CSEC Mathematics - Part 275",
    "content": "GO ON TO THE NEXT PAGE 01234010/SPEC 2015 - 4 - 8. Which of the following sets has an infinite  number of members?  (A) {factors of 20}  (B)   {multiples of 20}  (C) {prime numbers less than 20}  (D) {odd numbers between 10 and       20}  Item 9 refers to the Venn diagram below.   9.  The  shaded  area  in  the  Venn  diagram   above represents             (A)            P′             (B)            Q′             (C)            P ∪ Q              (D)             P  ∩ Q 10.  P  and  Q  are  two"
  },
  {
    "title": "CSEC Mathematics - Part 276",
    "content": "(D)             P  ∩ Q 10.  P  and  Q  are  two  finite  sets  such  that                     n(P)  =  7,  n(Q)  =  5  and  n(P  ∩ Q)  =  3.     What is n(P ∪ Q)?        (A)       6        (B)        9        (C)       15        (D)       18 11.  How  m any  litres  of  water  would  a   container whose volume is 36 cm 3  hold?  (A)       0.036  (B)       0.36  (C)     36        (D)       3600 12.  A  man  leaves  home  at  22:15  hrs  and   reaches  his  destination  at  04:00  hrs.    On"
  },
  {
    "title": "CSEC Mathematics - Part 277",
    "content": "eaches  his  destination  at  04:00  hrs.    On   the following day, in the same time zone.   How long did the journey take?  (A) 5 hrs        (B)       5        3 4  hrs  (C)   6 hrs        (D)        6        1 4  hrs Item 13 refers to the trapezium below, not  drawn to scale. 13.  ABCD  is  a  trapezium  and  ADE  is  a   triangle.  Angles B, C  and  E  are  right   angles.  The area of the trapezium ABCD is (A)   8 cm² (B)  16 cm² (C)   30 cm² (D) 32 cm²   14.  A  circular  hole  with  diame"
  },
  {
    "title": "CSEC Mathematics - Part 278",
    "content": "² (D) 32 cm²   14.  A  circular  hole  with  diameter  6  cm  is   cut  from  a  circular  piece  of  card  with   a  diameter  of  12  cm.    The  area  of  the   remaining card, in cm 2 , is             (A)             6 π           (B)          27π           (C)          36π         (D)        108π U P Q GO ON TO THE NEXT PAGE 01234010/SPEC 2015 - 5 - 15. The mean of ten numbers is 58.  If one  of the numbers is 40, what is the mean  of the other nine?  (A)   18  (B)    60        (C)       16"
  },
  {
    "title": "CSEC Mathematics - Part 279",
    "content": "her nine?  (A)   18  (B)    60        (C)       162        (D)       540  Items 16–17  refer  to  the  table  below   which shows the distribution of the ages  of 25 children in a choir. Age111213141516 No. of children635443 16.  W hat is the probability that a child chosen  at random is AT LEAST 13 years old?  (A)   4 25             (B)             9 25             (C)             14 25             (D)             16 25 17. What is the mode of this distribution? (A) 4 (B) 6 (C) 11 (D) 16 18. Se"
  },
  {
    "title": "CSEC Mathematics - Part 280",
    "content": "his distribution? (A) 4 (B) 6 (C) 11 (D) 16 18. Seven times the product of two numbers,  a and b, may be written as        (A)        7ab        (B)        7a + b        (C)       7a + 7b        (D)        49       ab 19. If 2(x – 1) – 3x = 6, then x =              (A)             –  8             (B)            – 4        (C)        4        (D)       8        20.  3x + 1 2   –   x + 1 4  =             (A)             7x + 3 4             (B)             7x + 1 4    (C)  5x + 1 4"
  },
  {
    "title": "CSEC Mathematics - Part 281",
    "content": "7x + 1 4    (C)  5x + 1 4               (D)             5x + 3 4   21.  The  equation  of  the  line  which  passes   through the point (0, 2) and has a gradient  of  1 3  is              (A)             y  = 3x               (B)            y = 3x + 2                                      (C)             y  =  1 3  x                                       (D)             y  =  1 3  x + 2  GO ON TO THE NEXT PAGE 01234010/SPEC 2015 - 6 -  Item 25 refers to the diagram below, not  drawn to"
  },
  {
    "title": "CSEC Mathematics - Part 282",
    "content": "tem 25 refers to the diagram below, not  drawn to scale. 25. A plane travels from point A on a bearing  150 0  to point B which is 10 km from A.   How far east of A is B?  (A) 10 tan 30 0  (B) 10 cos 30 0  (C) 10 cos 60 0  (D) 10 sin 60 0  Item 26 refers to the diagram below, not  drawn to scale. 26.       Triangle       ABC  is  an  enlargement  of   triangle ADE such that   AD DB  =  AE EC  =  1 2  If the area ABC = 36 cm 2 , then the area  of DECB, in cm 2 , is        (A)       18        (B)"
  },
  {
    "title": "CSEC Mathematics - Part 283",
    "content": "DECB, in cm 2 , is        (A)       18        (B)       24        (C)       27        (D)       32 22.   If g is a function such that g(x) =  2x + 1,   which of the following coordinates satisfies  the function?             (A)            (–3, –5)             (B)            (–6, 11)             (C)            (5, 2)  (D) (13, 6)  23. What is the gradient of a line which passes  through the points ( –4, 3) and (–2, 5)?               (A)              –4               (B)              –1 3"
  },
  {
    "title": "CSEC Mathematics - Part 284",
    "content": "–4               (B)              –1 3              (C)              1 3         (D)        1 24.       If       f (x) = 2x – 3 and g(x) = 3x  +  1,  then      fg( –2) is (A)       –13 (B)          –7 (C)           5 (D)         20 - 7 - 01234010/SPEC 2015 27. The point P(2, −3) is rotated about the  origin through an angle of 90° in an anti- clockwise direction.     What  are  the  coordinates  of  the  image   P?  (A) (3, 2)  (B)   (2, 3)  (C)   (−3, 2)        (D)       (3,       −2)"
  },
  {
    "title": "CSEC Mathematics - Part 285",
    "content": "C)   (−3, 2)        (D)       (3,       −2)              Item            28 refers to the triangle PQR below,  not drawn to scale. 28.  If  angle  QPR  =  90°, PR  =  12  cm  and       PQ = 5 cm then the length of QR, in cm,  is  (A)   7        (B)       11        (C)       13        (D)       17                          . 29.  Given  that P  and  Q  are  points  with   coordinates P(1, 3) and Q(−1, 4), the   position vector PQ is             (A)             0 1               (B)             0 7"
  },
  {
    "title": "CSEC Mathematics - Part 286",
    "content": "0 1               (B)             0 7             (C)             −2 1             (D)             2 −1 30. The transformation matrix Q =  0 2 2 0               represents  (A)   a 180 ° rotation about (0, 2)  (B) a reflection in the line x = 2  (C) a reflection in the line y = 2  (D) an enlargement by scale factor 2 IF YOU FINISH BEFORE TIME IS CALLED, CHECK YOUR WORK ON THIS TEST. Item  Number Specific ObjectiveKey 1Number Theory and Computation 9(a)B 2Number Theory and Computatio"
  },
  {
    "title": "CSEC Mathematics - Part 287",
    "content": "nd Computation 9(a)B 2Number Theory and Computation 11C 3Number Theory and Computation 2D 4Consumer Arithmetic 6B 5Consumer Arithmetic 10 (e )C 6Consumer Arithmetic 4A 7Consumer Arithmetic 10 (b)D 8Sets 1B 9Sets 7D 10Sets 4B 11Measurement 1A 12Measurement 12B 13Measurement 6A 14Measurement 6B 15Statistics 5B 16Statistics 13D 17Statistics 5C 18Algebra 2A 19Algebra 10A 20Algebra 8C 21Relations, Functions & Graphs 9D 22Relations, Functions & Graphs 4A 23Relations, Functions & Graphs 8D 24Relations,"
  },
  {
    "title": "CSEC Mathematics - Part 288",
    "content": "4A 23Relations, Functions & Graphs 8D 24Relations, Functions & Graphs 19A 25Geometry & Trigonometry 13C 26Geometry & Trigonometry 5 (c )D 27Geometry & Trigonometry 11 (c )A 28Geometry & Trigonometry 12C 29Vectors & Matrices 3C 30Vectors & Matrices 12D MATHEMATICS SPECIMEN PAPER 01 CARIBBEAN EXAMINATIONS COUNCIL SECONDARY EDUCATION CERTIFICATE TEST CODE 01234020/SPEC FORM TP 01234020/SPEC C A R I B B E A N   E X A M I N A T I O N S   C O U N C I L CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMI"
  },
  {
    "title": "CSEC Mathematics - Part 289",
    "content": "CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMINATION MATHEMATICS SPECIMEN PAPER Paper 02 – General Proficiency 2 hours 40 minutes READ THE FOLLOWING INSTRUCTIONS CAREFULLY.  1.   This paper consists of  TWO sections: I and II.  2.   Section I has SEVEN questions and Section II has  THREE questions.  3.   Answer  ALL questions from the TWO sections.  4. Write your answers in the booklet provided.          5.          Do NOT write in the margins.   6. All working must be clearly shown.  7. Unl"
  },
  {
    "title": "CSEC Mathematics - Part 290",
    "content": "s.   6. All working must be clearly shown.  7. Unless otherwise stated in the question, any numerical answer that is not exact  MUST  be written to THREE significant figures.  8. A list of formulae is provided on page 4 of this booklet.           9.          If   you  need  to  rewrite  any  answer  and  there  is  not  enough  space  to  do  so  on   the  original  page,  you  must  use  the  extra  page(s)  provided  at  the  back  of  this                               booklet.  Remember to d"
  },
  {
    "title": "CSEC Mathematics - Part 291",
    "content": "booklet.  Remember to draw a line through your original answer.  10. If you use the extra page(s) you MUST write the question number clearly in  the box provided at the top of the extra page(s) and, where relevant, include  the question part beside the answer. Examination Materials Permitted Silent, non-programmable electronic calculator  Mathematical instruments DO NOT TURN THIS PAGE UNTIL YOU ARE TOLD TO DO SO. Copyright © 2015 Caribbean Examinations Council All righ"
  },
  {
    "title": "CSEC Mathematics - Part 292",
    "content": "ght © 2015 Caribbean Examinations Council All rights reserved.   01234020/SPEC 2015 Page 2 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 LIST OF FORMULAE Volume of a prism V = Ah where A is the area of a cross-section and h is the perpendicular  length. Volume of cylinder V = πr 2 h where r is the radius of the base and h is the perpendicular height. Volume of a right pyramid V  = — Ah where A is the area of the base and h is the perpendicular height. Circumference C = 2πr where r is the radius of t"
  },
  {
    "title": "CSEC Mathematics - Part 293",
    "content": ". Circumference C = 2πr where r is the radius of the circle. Arc length S = —— × 2πr where θ is the angle subtended by the arc, measured in  degrees. Area of a circle A = πr 2  where r is the radius of the circle. Area of a sector A = —— × πr 2  where θ is the angle of the sector, measured in degrees. Area of trapezium A = — (a + b) h where a and b are the lengths of the parallel sides and h  is the perpendicular distance between the parallel sides. Roots of quadratic equations  If ax 2  + bx +"
  },
  {
    "title": "CSEC Mathematics - Part 294",
    "content": "es. Roots of quadratic equations  If ax 2  + bx + c = 0,  then  x  =  ——————  Trigonometric ratios sin θ  =  —————                                                    cos                                                  θ   =  —————                                                   tan                                                  θ  =  ————— Area of triangle  Area of Δ = — bh where b is the length of the base and h is the perpendicular  height.  Area of  Δ ABC  =  — ab sin C  Area of Δ ABC  ="
  },
  {
    "title": "CSEC Mathematics - Part 295",
    "content": ".  Area of  Δ ABC  =  — ab sin C  Area of Δ ABC  =  √ s (s – a) (s – b) (s – c)                                                     where                                                  s   =  ———— Sine rule   ——    =    ——    =    —— Cosine rule   a 2   =  b 2   +  c 2   –  2bc cos A 1 3 1 2 θ 360 θ 360 –b + √ b 2  – 4ac 2a opposite side hypotenuse adjacent side hypotenuse opposite side adjacent side 1 2 1 2 a + b + c 2 a sin A c sin C b sin B Page 3 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 S"
  },
  {
    "title": "CSEC Mathematics - Part 296",
    "content": "Page 3 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 SECTION I Answer ALL questions in this section. All working must be clearly shown. 1.  (a) Using a calculator, determine the value of                          2 (3.29)5.5 1.5    0.06 − ×    giving your answer to 1 decimal place. (3 marks)  (b) The table below shows rates of exchange.                               US$1.00     =  TT$6.45 BBD$1.00  =  TT$3.00  (i) Using the table, calculate the amount in BBD dollars equivalent to US$1.00. (2 marks)"
  },
  {
    "title": "CSEC Mathematics - Part 297",
    "content": "in BBD dollars equivalent to US$1.00. (2 marks)  (ii) Gail exchanged BBD$1806.00 for US dollars.  Calculate the amount she received  in US dollars. (1 mark)  (c) The cash price of a laptop is $4799.00.  It can be bought on hire purchase by making a  deposit of $540.00 and 12 monthly instalments of $374.98 EACH.  (iii) Calculate the TOTAL hire purchase price of the laptop. (2 marks)  (iv) Calculate the amount saved by purchasing the laptop at the cash price. (1 mark)"
  },
  {
    "title": "CSEC Mathematics - Part 298",
    "content": "cash price. (1 mark)                                                 Total 9 marks Page 4 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 2.  (a) Simplify:  p 3 q 2   ×  pq 5  (1 mark)         (b)        If        a * b = 2a – 5b, calculate the value of   (i) 3 * 4 (1 mark)       (ii) (3 * 4) * 1 (1 mark)  (c)   Factorize completely:   3 x + 6y – x 2  – 2xy (2 marks)  (d) A string of length 14 cm is cut into two pieces.  The length of the first piece is x cm.  The  second piece is 5 cm longer than ha"
  },
  {
    "title": "CSEC Mathematics - Part 299",
    "content": "is x cm.  The  second piece is 5 cm longer than half the length of the first piece.   (i) State in terms of x, the length of the second piece of string. (1 mark)   (ii) Write an expression, in terms of x, to represent the TOTAL length of the two pieces  of string.  (1 mark)     (iii)   Hence, calculate the length of the first piece of string.   (2 marks)  Total 9 marks 3.   (a)   Using  a  ruler,  a  pencil  and  a  pair  of  compasses,  construct  a  rhombus,  PQRS,  in  which"
  },
  {
    "title": "CSEC Mathematics - Part 300",
    "content": "t  a  rhombus,  PQRS,  in  which                       PR = 6 cm and RPQ = 60°.  (4 marks)              (b)             Use the graph on page 5 to answer  this question.     The diagram shows triangle JKL  and its image J ́K ́L ́ after an enlargement.   (i) Draw lines on your diagram to locate the point G, the centre of the enlargement. (1 mark)     (ii)   State the coordinates of the point G.   (1 mark)     (iii)   State the scale factor of the enlar gement.  (1 mark)     (iv)   On  your diagra"
  },
  {
    "title": "CSEC Mathematics - Part 301",
    "content": "enlar gement.  (1 mark)     (iv)   On  your diagram, show the point J ́ ́, the image of the point J ́, after a reflection  in the line x = 4.  (2 marks)                                                 Total 9 marks E Page 5 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 Page 6 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 4.  (a) The line BC passes through the point A(−5, 3) and has a gradient of –.   (i) Write the equation of the line BC in the form y = mx + c. (2 marks)       (ii)  Determine  the  equa"
  },
  {
    "title": "CSEC Mathematics - Part 302",
    "content": "mx + c. (2 marks)       (ii)  Determine  the  equation  of  the  line  which  passes  through  the  origin  and  is   perpendicular to the line BC.  (2 marks)  (b) The functions f and g are defined as:                         f (x)  =    g (x) = 4x – 5     (i)   Determine f g(3).   (2 marks)     (ii)   Derive an expression for f   -1 (x). (3 marks)  Total 9 marks 5.  A  graph sheet is provided for this question.  The table below shows the time spent, to the nearest  minute, by 25 students at the"
  },
  {
    "title": "CSEC Mathematics - Part 303",
    "content": "ent, to the nearest  minute, by 25 students at the school canteen. Time spent at the  bookstore (minutes) Frequency Cumulative  Frequency 6–1022 11–1546 16–30511 21–25_____20 26–304______ 31–35125  (a) Complete the rows numbered (i) and (ii). (2 marks)   (b)    On  your  graph  on  page  7,  draw  a  cumulative  frequency  curve  of  the  time  spent  at  the   canteen,  using a scale of 2 cm to represent 5 minutes on the horizontal axis and 2 cm to  represent 5 students on the vertical axis."
  },
  {
    "title": "CSEC Mathematics - Part 304",
    "content": "to  represent 5 students on the vertical axis.   (4 marks)              (c)             Use the graph drawn at (b)  to estimate     (i)   the median time spent at the canteen   (1 mark)     (ii)   the probability that a student selected at random spent LESS than 24 minutes at  the canteen.   (2 marks)  T otal 9 marks 2 5 2x – 1 x + 3              (i)              (ii) Page 7 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 Page 8 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 6.  (a) In this question, use"
  },
  {
    "title": "CSEC Mathematics - Part 305",
    "content": "01234020/SPEC 2015 6.  (a) In this question, use π =  – .   (i) A piece of wire is bent to form a square of area 121 cm 2 .  Calculate the perimeter  of the square. (2 marks)     (ii)  The  same  piece  of  wire  is  bent  to  form  a  circle.    Calculate  the  radius  of  the   circle.  (2 marks)  (b) The diagram below shows a map of an island drawn on a grid of 1 cm squares.  The map  is drawn to a scale of 1:50 000.   (i) L and M are two tracking stations.  State, in centimetres, the distan"
  },
  {
    "title": "CSEC Mathematics - Part 306",
    "content": "cking stations.  State, in centimetres, the distance LM on the  map.  (1 mark)   (ii) Calculate the ACTUAL distance, in kilometres, from L to M on the island. (2 marks)   (iii) Calcuate the ACTUAL area, in km 2 , of the forest reserve, given that     1 × 10 10  cm 2  = 1 km 2 . (2 marks)       Total 9 marks 22 7 Page 9 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 7. The table below represents the calculation of the sum of the cubes of the first n natural numbers.   Information is missing from some"
  },
  {
    "title": "CSEC Mathematics - Part 307",
    "content": "tural numbers.   Information is missing from some rows of the table.  (a) Study the pattern in the table and complete the rows marked (i), (ii) and (iii). nSeriesSumFormula 11 3 1–  (1 + 1) 2 21 3  +2 3 9–  (1 + 2) 2 31 3  +2 3  + 3 3 36–  (1 + 3) 2 41 3  + 2 3 + 3 3  + 4 3 100–  (1 + 4) 2 5 ................................................................................. 61 3  + 2 3  + 3 3  + 4 3  + 5 3  + 6 3 441–  (1 + 6) 2 .......................................–  (1 + 8) 2 n ..............."
  },
  {
    "title": "CSEC Mathematics - Part 308",
    "content": "....................–  (1 + 8) 2 n ........................... (6 marks)  (b) It was further noted that:     1 + 2 = 3 = √ 9   1 + 2 + 3 = 6 = √ 36      1 + 2 + 3 + 4 = 10 = √ 100        Using  information  from  the  table   above  and  the  pattern  in  the  three  statements  above,   determine   (i) the value of x for which 1 + 2 + 3 + 4 + 5 + 6 = √ x (2 marks)     (ii)   a formula in terms of  n for the series: 1 + 2 + 3 + 4 + ... + n  (2 marks)"
  },
  {
    "title": "CSEC Mathematics - Part 309",
    "content": "rks)                                                 T otal 10 marks              (i)              (ii)               (iii) 1 2 4 2 2 4 3 2 4 4 2 4 6 2 4 8 2 4 Page 10 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 8. (a) Solve the pair of simultaneous equations:                         x 2  = 4 – y                         x  = y + 2  (4 marks)  (b)   (i)   Express 3 x 2  + 2x + 1 in the form a(x + p) 2  + q where a, p and q are real numbers. (2 marks)   (ii) Hence, determine for f (x) = 3x 2  + 2x +"
  },
  {
    "title": "CSEC Mathematics - Part 310",
    "content": ")   (ii) Hence, determine for f (x) = 3x 2  + 2x +1    • the minimum value for f (x)    • the equation of the axis of symmetry. (2 marks)  (c) The speed–time graph below shows the journey of a car from 8:00 a.m. to 11:00 a.m.                         Using the graph, determine   (i) the time at which the speed of the car was 40 km/h (1 mark)     (ii)   the  TOTAL distance the car travelled for the entire journey  (2 marks)     (iii)   the average speed of the car for the entire journey .  (1 mark"
  },
  {
    "title": "CSEC Mathematics - Part 311",
    "content": "speed of the car for the entire journey .  (1 mark)  Total 12 marks SECTION II Answer ALL questions in this section. All working must be clearly shown. Page 11 GO ON TO THE NEXT PAGE 01234020/SPEC 2015 9. (a) In the diagram below, not drawn to scale, O is the centre of the circle.  The lines SK and  AF are parallel.                                     ∠ KSW = 62°      ∠ SAF = 54° K F O S A W 62° 54°                         Calculate,            giving reasons for your answer, the measure of:"
  },
  {
    "title": "CSEC Mathematics - Part 312",
    "content": "iving reasons for your answer, the measure of:                         (i)              ∠  FA W                                                                                                                                                         (2 marks)                         (ii)            ∠ SKF                                                                                                                                                         (2 marks)"
  },
  {
    "title": "CSEC Mathematics - Part 313",
    "content": "(2 marks)                                                  (iii)            ∠ ASW                                                                                                                                                      (2 marks)  (b)   A  machine produces circular discs of diameter 10 cm.  The machine malfunctions and cuts  a disc to produce the shape in the figure below, not drawn to scale, with centre, O.                         Determine    (i) the measure of angle θ (2 mark"
  },
  {
    "title": "CSEC Mathematics - Part 314",
    "content": "Determine    (i) the measure of angle θ (2 marks)    (ii) the area of triangle AOB (2 marks)     (iii)    the area of the disc that was cut of f.  (2 marks)               T otal 12 marks Use π = 3.14 Page 12   01234020/SPEC 2015 10.  (a) The vertices of a quadrilateral, OPQR are (0,0), (4,2), (6,10) and (2,8) respectively.                          (i)            Using a vector method, express in the form  x y  the vectors    • OP      •   RQ   (2 marks)   (ii) Calculate | OP |, the magnitude"
  },
  {
    "title": "CSEC Mathematics - Part 315",
    "content": "(2 marks)   (ii) Calculate | OP |, the magnitude of OP. (2 marks)   (iii) State ONE geometrical relationship between the line segments OP and RQ. (2 marks)  (b) The matrix, K, maps the point S (1,4) onto S′ (−4,−1) and the point T (3,5) onto T′ (–5,–3).     Given that K =  a c   b d  ,     (i)   express as a matrix equation, the relationship between K, S, S′ , T and T′. (2 marks)   (ii) hence, determine the values of a, b, c and d. (3 marks)     (iii)   describe COMPLETEL Y the geometric transf"
  },
  {
    "title": "CSEC Mathematics - Part 316",
    "content": "(iii)   describe COMPLETEL Y the geometric transformation which is represented by  the matrix K. (2 marks)  Total 12 marks END OF TEST IF YOU FINISH BEFORE TIME IS CALLED, CHECK YOUR WORK ON THIS TEST. → → → → CARIBBEAN EXAMINATIONS COUNCIL  SECONDARY EDUCATION CERTIFICATE EXAMINATION  MATHEMATICS          Specimen Paper          Table of Specifications          Ques.  Specific Objectives P1 P2 P3 Total  1  Number Theory and Computation: 2, 3, 9 (b)  4 3 2 9  Consumer Arithmetic: 5, 9  2  Algeb"
  },
  {
    "title": "CSEC Mathematics - Part 317",
    "content": "(b)  4 3 2 9  Consumer Arithmetic: 5, 9  2  Algebra:  2, 6, 9, 10  3 4 2 9     3  Geometry and Trigonometry:  2, 3, 8 (a), 10  3 3 3 9    4  Relations, Functions & Graphs: 9 (c ), 10, 18, 19  3 3 3 9    5  Statistics: 2, 5, 7, 9, 11  3 3 3 9    6  Measurement: 2, 3, 14, 15  2 4 3 9     7  Investigation  3 2 5 10     8  Algebra: 15, 18  3 6 3 12  Relations, Functions & Graphs: 22, 25, 26  9  Geometry and Trigonometry: 6, 15, 16,   3 6 3 12     10  Vectors & Matrices: 3, 4, 11, 12, 13  3 6 3 12"
  },
  {
    "title": "CSEC Mathematics - Part 318",
    "content": "Vectors & Matrices: 3, 4, 11, 12, 13  3 6 3 12        TOTAL 30 40 30 100                                              01234020/  SPECIMEN PAPER/MS/2015    CARIBBEAN   EXAMINATIONS      COUNCIL    CARIBBEAN  SECONDARY  EDUCATION  CERTIFICATE ®  EXAMINATION              MATHEMATICS    PAPER 02 – GENERAL PROFICIENCY          MARK SCHEME    SPECIMEN PAPER 2015                         2    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTIO"
  },
  {
    "title": "CSEC Mathematics - Part 319",
    "content": "ERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 1      PROFILES  Total  K C R  (a)  (3.29) 2  − 5.5 √ 1.5 × 0.06    =   10.8241 − 5.5 0.3    =  17.747   =  17.7  to 1 decimal place      1    1    1               3     3  (b) (i) US $ 1.00 = BD $  ( 1.00 3.00 )  ×  6.45      = BD $ 2.15     (ii) Amount Gail received        = US $  ( 1806.00 2.15 )      = US $ 840.00      1          1  1   1 1 1 3  (c) (i) Cash price on laptop =  $4799.00    Deposit     =  $540.00    Total Instalments    ="
  },
  {
    "title": "CSEC Mathematics - Part 320",
    "content": "Deposit     =  $540.00    Total Instalments    =  $374.98  ×  12          =  $4499.76       The total hire purchase price of the laptop    =  $ 540.00   +  $   4499.76    =  $5039.76   (ii) The amount saved by buying the laptop at the    cash price    =  $5039.76  –       $4799.00     =  $ 240.76                              1              1              1      2 1 3  TOTAL  4 3 2  9        3    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME"
  },
  {
    "title": "CSEC Mathematics - Part 321",
    "content": "ER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 2   PROFILES  Total  K C R  (a) p 3 q 2  × pq 5  = p 4 q 7     1     1     1  (b) a * b = 2a – 5b    (i) 3 * 4 = 2 (3) – 5 (4)          = 6 – 20           = 14    (ii) (3 * 4) * 1 = (–14) * 1              = 2 (–14) – 5 (1)              = –28 – 5              = –33         1                1      1 1 2  (c) 3x + 6y – x 2  – 2xy   = 3 (x + 2y) – x (x + 2y)   = (3 – x)(x + 2y)          1    1              1 1    2  (d) (i) Length"
  },
  {
    "title": "CSEC Mathematics - Part 322",
    "content": "1    1              1 1    2  (d) (i) Length of 2nd piece =  1 2  x + 5     (ii) Sum of two lengths = x +  1 2  x + 5             =  3 2  x + 5  (iii)   =  3 2  x + 5 = 14         =  3 2  x  = 9           x  = 6     Length of 1st piece is 6 cm          1  1                        1                1    1 2 1 4  TOTAL  3 4 2  9        4    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME      QUESTION:  3  5    01234020/SPECIMEN PAPER/MS/2015"
  },
  {
    "title": "CSEC Mathematics - Part 323",
    "content": "QUESTION:  3  5    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 3    PROFILES  Total  K C R  (a)  PR = 6cm     RPQ = 60°  Locating Q    Locating S      [Not drawn to scale]                      1      1  1    1     1 2 1  4     6    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME      PROFILES  Total  K C R  (b) (i) Any 2 of KK, JJ and LL       R1        (ii) G (2, –1)"
  },
  {
    "title": "CSEC Mathematics - Part 324",
    "content": ", JJ and LL       R1        (ii) G (2, –1)         K1       (iii) Scale factor = –2          R1     (iv) a) x = 4 drawn (soi)          K1       b) J” at (8, 3)     C1                        1        1                  1  1        1      2 1 2  5  TOTAL  3 3 3  9       7    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 4    PROFILES  Total  K C R  (a) A(–5, 3); m =  2 5    (i) Equation of line BC is y – 3 =  2 5  (x + 5)         i"
  },
  {
    "title": "CSEC Mathematics - Part 325",
    "content": "tion of line BC is y – 3 =  2 5  (x + 5)         i.e. y =  2 5  x + 5    (ii) Gradient of line perpendicular to BC is     –  5 2      Equation of line through (0, 0) is     y = –  5 2  x                    1          1  1                      1      1 2 1  4  (b) f(x) =  2푥−1 푥+3 ; g(x) = 4x – 5    (i) g(3) = 12 – 5 = 7      ∴  fg(3) = 14 – 1 = 13              7 +  3   10    (ii)  2(푓 −1 )−1 (푓 −1 )+3        = x     2(f  -1 ) – 1   = xf -1  + 3x      f -1  (2 – x) = 3x + 1     f -1          = 3x"
  },
  {
    "title": "CSEC Mathematics - Part 326",
    "content": "f -1  (2 – x) = 3x + 1     f -1          = 3x + 1          2 – x      1                          1                        1            1      1      2 1 2 5  TOTAL 3 3 3 9            8    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 5    PROFILES  Total  K C  R    (a) Missing frequency = 9   Missing cumulative frequency = 24        1  1          2   2    (b)             Correct scale on both axes  3 or more points plotted c"
  },
  {
    "title": "CSEC Mathematics - Part 327",
    "content": "ect scale on both axes  3 or more points plotted correctly  Plotting at class boundary  Smooth ogive                                                      1                                                        1  1                                                            1                                    1 2 1 4  9    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME      PROFILES  Total  K C  R    (c) (i) Median time spent = 21.5 minutes"
  },
  {
    "title": "CSEC Mathematics - Part 328",
    "content": "C  R    (c) (i) Median time spent = 21.5 minutes  (d) (ii) P (time spent < 24) = 17                          25         1    1  1       1 2 3  TOTAL 3 3 3 9                                            10    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 6   PROFILES  Total  K C R    (a) (i) Area of square  = 121 cm 2   a) ∴ length of side    =  √ 121 cm                               = 11 cm    b) Perimeter of square = 4 × 11 cm"
  },
  {
    "title": "CSEC Mathematics - Part 329",
    "content": "= 11 cm    b) Perimeter of square = 4 × 11 cm                         = 44 cm    (ii) Perimeter of circle = 44 cm  i.e. 2 π R = 44 cm           R =  44 2휋  cm             = 7 cm                      [===              1        1              1                      1      1 2 1 4  (b) (i) LM = 8 cm on map    (ii) Actual distance in km       =  8 푥 50 000 100 000  km       = 4 km    (iii) Area of forest reserve on map  15 cm 2        Actual area in km 2              =  15 푥 (50 000) 2 1 푥 10 10"
  },
  {
    "title": "CSEC Mathematics - Part 330",
    "content": "n km 2              =  15 푥 (50 000) 2 1 푥 10 10  km 2                  = 3.75 km 2     1       1            1        1            1      1 2 2 5  TOTAL 2 4 3 9         11    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 7    PROFILES  Total  K C R    (a)               n Series Sum Formula        (i)  5 1 3 +2 3 +3 3 +4 3 +5 3  225  5 2 4  (1 + 5) 2   (ii) 8  129 6  8 2 4  (1 + 8) 2   (iii) n    푛 2 4  (1 + n) 2           1    1"
  },
  {
    "title": "CSEC Mathematics - Part 331",
    "content": "2   (iii) n    푛 2 4  (1 + n) 2           1    1          1    1              1        1    2 2 2 6    (b)  (i) 1 + 2 + 3 + 4 + 5 + 6 =  √ 푥     x = (1 + 2 + 3 + 4 + 5 + 6)   = 21         = 21 2          = 441    (ii) 1 + 2 + 3 + 4 + ... + n =  √ 푛 4 2 +(1+푛) 2                            =  푛 2  (1 + n)            1                                     1    1    1        1  3 4  TOTAL 3 2 5 10        12    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  M"
  },
  {
    "title": "CSEC Mathematics - Part 332",
    "content": "ATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 8    PROFILES  Total  K C R    (a) x 2  = 4 – y ... (1)      x = y + 2 ... (2)    From (2): y = x – 2   ∴ x 2   = 4 – (x – 2)   x 2   = 4 – x + 2    x 2  + x – 6 = 0   (x + 3) (x – 2) = 0    x  = – 3, 2   when x  = –3 , y = –5   when x  = 2 , y = 0                    1          1    1    1      1 2 1 4  (b) (i) 3x 2  + 2x + 1 = 3 (x 2  +  2 3  x) + 1                      = 3 [ (x +  1 3 ) 2  –  1 9 ] + 1"
  },
  {
    "title": "CSEC Mathematics - Part 333",
    "content": "= 3 [ (x +  1 3 ) 2  –  1 9 ] + 1                      = 3 (x +  1 3 ) 2  –  1 3  + 1   )                                                      = 3 (x +  1 3 ) 2  +  2 3     (ii) For f(x) = 3x 2  + 2x + 1    (a) f(x) min  =  2 3      (b) Axis of symmetry is x = –  1 3             1      1          1                      1    1 2 1 4  (c) (i)  Speed was 40 km/h at 10:45 am  (ii) Distance travelled =  1 2  (3 + 2.5) (80)km                       = 220 km  (iii) Average speed =  220 3  km/h"
  },
  {
    "title": "CSEC Mathematics - Part 334",
    "content": "0 km  (iii) Average speed =  220 3  km/h                   = 73  1 3  km/h         1  1          1      1      1 2 1 4  TOTAL 3 6 3 12        13    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME      QUESTION: 9    PROFILES  Total  K C R  (a) (i)               F A  W = 90°  54° = 36°    Use of 90° (angle in a semicircle)     (ii) S K  F = 180°  54° = 126°    Use of 180° (opposite angles of cyclic quad)     (iii) A S  W = 180°  (62° + 54°"
  },
  {
    "title": "CSEC Mathematics - Part 335",
    "content": "cyclic quad)     (iii) A S  W = 180°  (62° + 54°) = 64°    (co-interior angles)                                            1                                                1  1    1                                      1                1    1 3 2 6      14    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME      PROFILES  Total  K C R    (b) (i) 6 2  = 5 2  + 5 2  – 2 × 5 × 5 cos       cos Q =  14 50    ∴ Q = 73.7°    (ii) Area of ΔAOB =  1 2"
  },
  {
    "title": "CSEC Mathematics - Part 336",
    "content": "14 50    ∴ Q = 73.7°    (ii) Area of ΔAOB =  1 2  (5  5) sin 73.7°                 = 12 cm 2     (iii) Area of sector AOB =  73.7 360   (5 2 )                       = 16.1 cm 2     ∴ Area of segment removed    = 16.1 cm 2  – 12 cm 2  = 4.1 cm 2                                                1      1    1          1            1                      1      2 3 1 6  TOTAL 3 6 3 12        15    01234020/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME"
  },
  {
    "title": "CSEC Mathematics - Part 337",
    "content": "02 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 10    PROFILES  Tota l  K C R    (a) (i) OP = ( 4 2 )     RQ = ( 6 10 ) – ( 2 8 ) = ( 4 2 )    (ii) | PO |  = √ 4 2 +2 2  =  √ 20    (iii) OP and RQ  either  have the same length     or  are parallel      1      1      1    1                  1    2 2 1 5    (b) (i)  ( 푎    푏 푐    푑 )( 1    3 4    5 )  =  ( −4   −5 −1   −3 )      (ii)det of   ( 1    3 4    5 )  = 5 – 12 = -7     Inverse of  ( 1    3 4    5 ) =  1 7   ( 5    −3 −4"
  },
  {
    "title": "CSEC Mathematics - Part 338",
    "content": "rse of  ( 1    3 4    5 ) =  1 7   ( 5    −3 −4   1 )         ∴  ( 푎    푏 푐    푑 )  = -  1 7   ( −4   −5 −1   −3 )   ( 5    −3 −4   1 )                 = -  1 7   ( 0    7 7    0 )                          =  ( 0   −1 −1    0 )       [Complete matrix C2 R1  b or c only C1 each]    (iii) The matrix K =  ( 0   −1 −1    0 )    Representing a reflection in the line       y = –x       1        1      1                  1  1      1            1      1 4 2 7  TOTAL 3 6 3 12    TEST CODE 01234032/SPEC F"
  },
  {
    "title": "CSEC Mathematics - Part 339",
    "content": "4 2 7  TOTAL 3 6 3 12    TEST CODE 01234032/SPEC FORM TP 01234032/SPEC C A R I B B E A N   E X A M I N A T I O N S   C O U N C I L CARIBBEAN SECONDARY EDUCATION CERTIFICATE ® EXAMINATION MATHEMATICS SPECIMEN PAPER Paper 032 – General Proficiency 2 hours 40 minutes READ THE FOLLOWING INSTRUCTIONS CAREFULLY.  1.   This paper consists of  TWO questions.  2.   Answer ALL  questions.  3.   W rite your answers in the booklet provided.          4.          Do NOT write in the margins.   5. All working"
  },
  {
    "title": "CSEC Mathematics - Part 340",
    "content": "Do NOT write in the margins.   5. All working MUST be clearly shown.           6.          A  list of formulae is provided on page 2 of this booklet.          7.         If  you  need  to  rewrite  any  answer  and  there  is  not  enough  space  to  do  so  on   the  original  page,  you  must  use  the  extra  page(s)  provided  at  the  back  of  this                               booklet.  Remember to draw a line through your original answer.  8. If you use the extra page(s) you MUST wri"
  },
  {
    "title": "CSEC Mathematics - Part 341",
    "content": "wer.  8. If you use the extra page(s) you MUST write the question number clearly in  the box provided at the top of the extra page(s) and, where relevant, include  the question part beside the answer. Examination Materials Permitted Silent, non-programmable electronic calculator  Mathematical instruments DO NOT TURN THIS PAGE UNTIL YOU ARE TOLD TO DO SO. Copyright © 2015 Caribbean Examinations Council All rights reserved.   01234020/SPEC 2015 Page 2 GO ON TO THE NEXT PAGE 01234032/SPEC 2015 LIST"
  },
  {
    "title": "CSEC Mathematics - Part 342",
    "content": "e 2 GO ON TO THE NEXT PAGE 01234032/SPEC 2015 LIST OF FORMULAE Volume of a prism V = Ah where A is the area of a cross-section and h is the perpendicular  length. Volume of cylinder V = πr 2 h where r is the radius of the base and h is the perpendicular height. Volume of a right pyramid V  = — Ah where A is the area of the base and h is the perpendicular height. Circumference C = 2πr where r is the radius of the circle. Arc length S = —— × 2πr where θ is the angle subtended by the arc, measured"
  },
  {
    "title": "CSEC Mathematics - Part 343",
    "content": "ere θ is the angle subtended by the arc, measured in  degrees. Area of a circle A = πr 2  where r is the radius of the circle. Area of a sector A = —— × πr 2  where θ is the angle of the sector, measured in degrees. Area of trapezium A = — (a + b) h where a and b are the lengths of the parallel sides and h  is the perpendicular distance between the parallel sides. Roots of quadratic equations  If ax 2  + bx + c = 0,  then  x  =  ——————  Trigonometric ratios sin θ  =  —————"
  },
  {
    "title": "CSEC Mathematics - Part 344",
    "content": "tric ratios sin θ  =  —————                                                    cos                                                  θ   =  —————                                                   tan                                                  θ  =  ————— Area of triangle  Area of Δ = — bh where b is the length of the base and h is the perpendicular  height.  Area of  Δ ABC  =  — ab sin C  Area of Δ ABC  =  √ s (s – a) (s – b) (s – c)                                                     where"
  },
  {
    "title": "CSEC Mathematics - Part 345",
    "content": "where                                                  s   =  ———— Sine rule   ——    =    ——    =    —— Cosine rule   a 2   =  b 2   +  c 2   –  2bc cos A 1 3 1 2 θ 360 θ 360 –b + √ b 2  – 4ac 2a opposite side hypotenuse adjacent side hypotenuse opposite side adjacent side 1 2 1 2 a + b + c 2 a sin A c sin C b sin B Page 3 GO ON TO THE NEXT PAGE 01234032/SPEC 2015 1. The diagram below, not drawn to scale, represents the plan of a floor.  The broken li"
  },
  {
    "title": "CSEC Mathematics - Part 346",
    "content": "le, represents the plan of a floor.  The broken line RS divides the floor into two rectangles, A and B.  (a) (i) Calculate the value of x.  (1 mark)   (ii) Hence, determine the length of RS.  (1 mark) Page 4 GO ON TO THE NEXT PAGE 01234032/SPEC 2015  (b) Calculate the area of the entire floor.                                 (4 marks)  (c) Section A  of  the  floor  is  to  be  covered  with  flooring  boards  measuring  1  metre  by                               30 centimetres.     What is the"
  },
  {
    "title": "CSEC Mathematics - Part 347",
    "content": "30 centimetres.     What is the MINIMUM number of flooring boards that would be needed to completely  cover Section A?"
  },
  {
    "title": "CSEC Mathematics - Part 348",
    "content": "(4 marks) T otal 10 marks  E Page 5 GO ON TO THE NEXT PAGE 01234032/SPEC 2015 2. A graph sheet is provided for this question.  A company manufactures gold and silver stars to be used as party decorations.  The stars are placed  in packets so that each packet contains x gold stars and y silver stars.  The table below shows some of the conditions for packaging the stars. ConditionInequality (1)Each packet mu"
  },
  {
    "title": "CSEC Mathematics - Part 349",
    "content": "g the stars. ConditionInequality (1)Each packet must have at least 20 gold stars x ≥ 20 (2)Each packet must have at least 15 silver stars (3)The total number of stars in each packet must be  no more than 60 (4) x < 2y  (a) Complete the table above by    (i) writing the inequalities to represent conditions (2) and (3) (2 marks)   (ii) describing in words, the condition represented by the inequality x < 2y. (2 marks)  (b) Complete the graph on page 5, to show the common region represented by ALL F"
  },
  {
    "title": "CSEC Mathematics - Part 350",
    "content": "5, to show the common region represented by ALL FOUR  inequalities in the table above.  (3 marks)  (c) Three packets of stars (A, B, and C) were selected for inspection.  Their contents are shown  in the table below. Packet No. of gold stars (x)   No. of silver stars (y) A2520 B3515 C3025   (i) Plot the points representing A, B and C on the graph drawn at (b). (1 mark)   (ii) Hence, state which of the three packets satisfy ALL the conditions for packaging.   Justify your response."
  },
  {
    "title": "CSEC Mathematics - Part 351",
    "content": "packaging.   Justify your response.                   .................................................................................................................................                    ................................................................................................................................. (2 marks) Page 6 01234032/SPEC 2015 Total 10 marks END OF TEST IF YOU FINISH BEFORE TIME IS CALLED, CHECK YOUR WORK ON THIS TEST."
  },
  {
    "title": "CSEC Mathematics - Part 352",
    "content": "ON THIS TEST.                                         01234032/  SPECIMEN PAPER/MS/2015    CARIBBEAN   EXAMINATIONS      COUNCIL    CARIBBEAN  SECONDARY  EDUCATION  CERTIFICATE ®  EXAMINATION              MATHEMATICS    PAPER 032 – GENERAL PROFICIENCY          MARK SCHEME    SPECIMEN PAPER 2015                         2    01234032/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 032 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 1      PROFILES  Total  K C R    (a) (i) x = (12.3 – 3.4)m ="
  },
  {
    "title": "CSEC Mathematics - Part 353",
    "content": "ILES  Total  K C R    (a) (i) x = (12.3 – 3.4)m = 8.9 m     (ii) RS = (8.9 + 2.0)m = 10.9 m     1                1      - 1 1 2    (b) Area of A:     12.3 m × 6.8 m = 83.64 m 2     Area of B:    10.9 m × 3.1 m = 33.79 m 2      TOTAL area = 117.43 m 2      Correct method for finding area: C1   Either Area of A or Area of B correct: K1     Adding to find the total area: R1   Correct total: K1           1        1        1                  1    2 1 1 4    (c) Area of board 0.3 m 2   (seen or implie"
  },
  {
    "title": "CSEC Mathematics - Part 354",
    "content": "1 4    (c) Area of board 0.3 m 2   (seen or implied)     Number of boards = 83.64    (Division:C1)                 0.3                          = 278.8     (Correct  answer K1)     Number of boards needed is 279              1    1    1                1    1 2 1 4  TOTAL  3 4 3  10    3    01234032/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 032 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME    QUESTION: 2   PROFILES  Total  K C R    (a) (i) [2] y > 15    [3] x + y < 60"
  },
  {
    "title": "CSEC Mathematics - Part 355",
    "content": "15    [3] x + y < 60                                                          (ii) The number of gold stars must be LESS than    TWICE the number of silver stars.  - Less than (C1); Twice the number of silver(R1)    1      1      1              1    1 2 1 4    (b) See graph on next page     Line  x = 20 OR line y = 15        Line x + y = 60       Correct region seen or implied             1    1                1     2 1 - 3    (c) (i) Plotting any two points correctly       (ii) Packets A and C"
  },
  {
    "title": "CSEC Mathematics - Part 356",
    "content": "ny two points correctly       (ii) Packets A and C satisfy the conditions but    Packet B does not satisfy condition [4]    - Response must be supported by points seen  on the graph         1        1  1    - 1 2 3       TOTAL  3 4 3 10      4    01234032/SPECIMEN PAPER/MS/2015  MATHEMATICS  PAPER 032 – GENERAL PROFICIENCY  SPECIMEN  MARK SCHEME            CXC 05/G/SYLL 16 1    www.cxc.org                            Caribbean Examinations Council  Prince Road, Pine Plantation Road,  St Michael B"
  },
  {
    "title": "CSEC Mathematics - Part 357",
    "content": "Prince Road, Pine Plantation Road,  St Michael BB11091  Tel: (246) 227 1700  Email: cxcezo@cxc.org"
  }
]