[
  {
    "title": "About",
    "content": "At Shiva Boys' Hindu College, our dedicated team of educators and support staff work tirelessly to provide students with a nurturing, disciplined, and enriching environment. Their passion and professionalism are at the heart of everything we do. Shiva Boys' Hindu College is dedicated to nurturing young minds through holistic education, cultural grounding, and academic excellence. We empower students to become confident leaders of tomorrow."
  },
  {
    "title": "School Opened",
    "content": "Shiva Boys' Hindu College was founded on September 9th, 2000 with a vision to provide quality education grounded in tradition and values."
  },
  {
    "title": "School Motto",
    "content": "The motto for Shiva Boys' Hindu College is Excellence, Duty, Truth"
  },
  {
    "title": "Facebook Page",
    "content": "https://www.facebook.com/pages/Shiva%20Boys'%20Hindu%20College/232459590137374/#"
  },
  {
    "title": "Instagram Page",
    "content": "https://www.instagram.com/shivaboyshinducollege/"
  },
  {
    "title": "Youtube Page",
    "content": "https://www.youtube.com/@shivaboyshinducollege7329"
  },
  {
    "title": "Website Creator",
    "content": "The website shivaboys.edu.tt was designed & developed By StefanTheProgrammer using backend coding"
  },
  {
    "title": "Sage AI Creator",
    "content": "Sage AI was designed & developed By StefanTheProgrammer using backend coding"
  },
  {
    "title": "Copyright 2025",
    "content": "Copyright 2025 Shiva Boys' Hindu College. All rights reserved."
  },
  {
    "title": "School Name",
    "content": "Shiva Boys' Hindu College"
  },
  {
    "title": "School Address",
    "content": "Shiva Boys' Hindu College is located at 35-37 Clarke Road, Penal, Trinidad & Tobago"
  },
  {
    "title": "School Phone Number",
    "content": "The contact number for Shiva Boys' Hindu College is (868)372-8822"
  },
  {
    "title": "School Email",
    "content": "ShivaBoys.sec@fac.edu.tt"
  },
  {
    "title": "Normal Office Hours",
    "content": "Shiva Boys' Hindu College normal office hours are Monday to Friday: 8:00 AM - 4:00 PM, Saturday, Sunday & Public Holidays: Closed"
  },
  {
    "title": "Vacation Office Hours",
    "content": "Shiva Boys' Hindu College vacation office hours are Monday to Friday: 9:00 AM - 2:00 PM, Saturday, Sunday & Public Holidays: Closed"
  },
  {
    "title": "School hours for classes",
    "content": "Shiva Boys' Hindu College student class hours are Monday to Friday: 8:00 AM - 2:30 PM, Saturday, Sunday & Public Holidays: Closed"
  },
  {
    "title": "Find Us",
    "content": "Our school is conveniently located in the heart of Penal. We're easily accessible by public transport and have parking available for staff and visitors."
  },
  {
    "title": "Co-Curricular Clubs",
    "content": "Shiva Boys' Hindu College has a wide range of co-curricular clubs, giving students a balance to academic life. The clubs include Debate Club, Envi Club, Interact Club, Mathematics Olympiad, Sci-Pi Club, Sign Language Club, Student Council and The SBHC Spanish Club- The Latin Link"
  },
  {
    "title": "School Houses",
    "content": "Shiva Boys' Hindu College has four houses which are various representations of Lord Shiva. 1. Rudra - Strength, passion and determination. House color - Red. 2. Mahadev - Wisdom, leadership and unity. House color - Blue. 3. Trilochan - Vision, clarity and excellence. House color - Yellow. 4. Shambo - Energy, creativity and resilience. House color - Orange."
  },
  {
    "title": "SBHC Game Quiz",
    "content": "Test your knowledge about Shiva Boys' Hindu College by playing this timed quiz game"
  },
  {
    "title": "SBHC House Dash",
    "content": "SBHC House Dash is a fast-paced clicking race where students represent their house in an epic sprint to victory. Tap your way to the top and lead your house to glory!"
  },
  {
    "title": "Resources",
    "content": "Check out the Resources page to view PDF documents for school documents such as Calender of Events"
  },
  {
    "title": "Departments",
    "content": "Shiva Boys' Hindu College has three departments. 1. Business/IT/Modern Studies Department. 2. Mathematics/Science Department and 3. Language Department"
  },
  {
    "title": "Business/IT/Modern Studies Department",
    "content": "Our Business, Information Technology & Modern Studies Department equips students with practical skills in entrepreneurship, digital literacy, and social awareness. We prepare learners to thrive in the modern world through innovative projects, critical thinking, and real-world applications. The CXC Subjects under this department are 1. Accounting, 2. Computer Science, 3. Geography, 4. Information Technology, 5. Law, 6. Management of Business, 7. Principles Of Accounts, 8. Principles of Business, 9. Social Studies, 10. Sociology"
  },
  {
    "title": "Mathematics/Science Department",
    "content": "The Mathematics & Science Department fosters analytical thinking, problem-solving, and curiosity about the natural world. Through hands-on experiments and logical exploration, students gain a strong foundation to innovate, investigate, and excel in STEM fields. The CXC Subjects under this department are 1. Additional Mathematics, 2. Biology, 3. Chemistry, 4. Environmental Science, 5. Integrated Science, 6. Mathematics, 7. Physical Education, 8. Physics, 9. Technical Drawing"
  },
  {
    "title": "Language Department",
    "content": "The Language Department promotes effective communication, cultural appreciation, and linguistic fluency. Through immersive learning experiences, students develop strong reading, writing, and speaking skills in both local and global languages. The CXC Subjects under this department are 1. Art, 2. Caribbean Studies, 3. Communication Studies, 4. English Language, 5. English Literature, 6. Music, 7. Spanish, 8. Theatre Arts"
  },
  {
    "title": "CXC CSEC",
    "content": "Eighteen CXC CSEC subjects which are taught to Forms one to five students at Shiva Boys' Hindu College are Additional Mathematics, Biology, Chemistry, Electronic Document Preparation and Management (EDPM), English A, English B, Geography, Information Technology, Integrated Science, Mathematics, Physical Education, Physics, Principles of Accounts (POA), Principles of Business (POB), Social Studies, Spanish, Technical Drawing (TD) and Theatre Arts"
  },
  {
    "title": "CXC CAPE",
    "content": "Fifteen CXC CAPE subjects which are taught to Form six students at Shiva Boys' Hindu College are Accounting, Biology, Caribbean Studies, Chemistry, Communication Studies, Computer Science, Economics, Environmental Science, Information Technology, Law, Management of Business (MOB), Pure Mathematics, Physical Education, Physics, Sociology"
  },
  {
    "title": "News",
    "content": "Check out Shiva Boys' Hindu College's News page for all the latest updates on anything Shiva Boys'"
  },
  {
    "title": "Graduation 2025",
    "content": "Celebrating Our Graduating Class. On this memorable day, July 4th, 2025, we honoured the achievements and journey of the 2025 graduating class. Friends, family, and faculty gathered to celebrate resilience, excellence, and new beginnings. Story written by Mr. Kishore Sookoo. Check out the Graduation YouTube Video and Graduation Gallery."
  },
  {
    "title": "School Opens",
    "content": "School opens in the new school term 1 of 2025/2026 academic year on September 8th, 2025"
  },
  {
  "title": "School Leadership",
  "content": "The Principal of Shiva Boys' Hindu College is Mr. Devinesh Neeranjan. The Vice Principal is Pundit Rickie Maharaj."
},
{
  "title": "School Year",
  "content": "The academic school year of 2025/2026 consists of three academic terms. Term I consists of fifteen weeks from September 2nd, 2025 to December 12th, 2025. Term II consists of twelve weeks from January 5th, 2026 to March 27th, 2026. Term III consists of twelve weeks from April 13th, 2026 to July 3rd, 2026."
},
{
  "title": "School Vacation",
  "content": "School vacation after Term I of 2025/2026 academic year consists of three weeks from December 13th, 2025 to January, 2026. School vacation after Term II of 2025/2026 academic year consists of two weeks from March 27th, 2026 to April 12th 2026. School vacation after Term III of 2025/2026 academic year consists of eight weeks from July 4th, 2026 to a date to be determined."
}
]
